[
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/10/The-Amish-vote-for-donald-Trump-640x426.jpg", "title": "The Amish In America Commit Their Vote To Donald Trump; Mathematically Guaranteeing Him A Presidential Victory", "author": "Jimmy Rustling, ABC News", "content": " COLUMBUS, OH  (AP)  — History was made today in Columbus, Ohio when more than 3 million Amish poured into the city to see the American Amish Brotherhood (AAB), an organization which acts as an informal governing body for the Amish community, endorse Donald Trump for president. That number represents a significant portion of the total Amish population, which the United States Census Bureau says numbers more than 20 million men and women nationwide all pledging their vote to Trump for President. With the full force of the Amish community behind him, Donald Trump is now mathematically guaranteed to win the presidency in November.  The organization typically meets once a year and the meetings usually consist of about 300 Amish leaders who meet to discuss the challenges, such as urban sprawl, that face the community. This year, however, the organization wanted as many people in attendance as possible so they can effectively instruct all Amish men and women of legal voting age to cast their vote for the flamboyant Republican nominee.  The  Amish , who are direct descendants of the protestant reformation sect known as the Anabaptists, have typically stayed out of politics in the past. As a general rule, they don’t vote, serve in the military, or engage in any other displays of patriotism. This year, however, the AAB has said that it is imperative that they get involved in the democratic process.  “Over the past eight years, the Democratic Party has launched a systematic assault on biblical virtues,” said AAB Chairman Elijah Fisher. “We have seen more and more Christians being persecuted for their faith; we have seen the state defile the institution of marriage allowing the homogays to come together just like normal people. And now, they want to put a woman in the nation’s highest leadership role in direct violation of my favorite Bible passage,  1 Timothy 2:12 , ‘I do not permit a woman to teach or to assume authority over a man; she must be quiet’.” Fisher continued, “We need to stop this assault on God and take a stand for biblical principles. Donald Trump has shown in both action and deed that he is committed to restoring this country to the Lord’s way.”  According to statistician Nate Silver of the website fivethirtyeight.com, there are no possible scenarios in which Hillary Clinton can win with Donald Trump carrying the Amish vote.  “The Amish have their highest numbers in perennial swing states like Pennsylvania, Virginia, Ohio, Indiana, and Iowa,” Silver noted. “They also have strong numbers in reliably Democratic states like Michigan, Illinois, and New York, meaning that Hillary will lose those states as well. There is also a sizeable community in Florida which, while not as large as it is in the Midwest, is still large enough to turn Florida for Trump. Over the next two weeks, you can expect Hillary to enter into a state of freefall in all of my predictive models.”  37-year-old Paul Horner, a self-proclaimed “Donald Trump supporter since day one” told Leilani Hernandez, a reporter with local Columbus news station  WBNS-10TV  he is thrilled that Trump will be the next President.  “This is such great news, a Trump victory, I knew it would happen, I have been praying for it night and day,” Horner said. “Plus I work November 8th and it was going to be tough for me to get off work and vote because my boss is not the nicest of people. But now thanks to the great Amish people of this country, they have this thing locked up for a Donald Trump victory against crooked Hillary and I won’t have to miss work! God is good!”  The Clinton campaign issued a written statement to the AAB asking them to reconsider their decision.  “I don’t believe that Donald Trump is the person who best represents your interests,” Clinton wrote to the AAB. “As a career real estate developer, he represents a clear threat to your simple way of life. As former first lady of Arkansas, I understand the concerns of rural Americans more than any candidate in this election. I implore you to consider all of the facts before voting for my opponent.”  Most pundits believe that Mrs. Clinton’s plea is too little too late.  During a press conference in Manhattan early this morning, Trump thanked the AAB for their support and promised to put the Amish to work maintaining government buildings, which he said would save taxpayers millions because “the Amish do great work, the best work, for a very low price.”  Though Clinton has pledged to stay in the race until the very end, many of her campaign workers have already resigned. According to the  Associated Press , it is expected that the Clinton campaign will lose 50% of its staff within the next week. There is a general mood of hopelessness and despair in the Clinton camp, and many simply want to cut their losses.  “It looked like she was going to win this election easily,” said Tom Downey, a campaign manager in Ohio, “But this is what happens when you wake a sleeping giant. Clearly, Mrs. Clinton took far too much for granted in this race, and we are all now paying the price. It’s really sad to see the campaign end this way.”  The AAB chooses weekly charities for those wishing to support what they do. The AAB’s charity for the week of November 4th is  Sock It Forward , a charity that   provides the homeless with brand new socks  . If you are interested in learning more about the Amish community and the AAB, you can contact the Pennsylvania Amish Heritage Museum at (785) 273-0325. ", "post_date": "2016-11-05T06:30:37+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/trump-protester-paid-640x427.png", "title": "Donald Trump Protester Speaks Out: “I Was Paid $3,500 To Protest Trump’s Rally”", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX A.Z.  (AP)  — For months now, rumors have  circulated the Internet  that individuals were being paid to protest at rallies held by presidential hopeful  Donald Trump . Today a man from  Trump’s rally in Fountain Hills, Arizona  back in March has come forward to say that he was paid to protest the event.  “I was given $3,500 to protest Donald Trump’s rally in Fountain Hills,” said 37-year-old Paul Horner. “I answered a Craigslist ad about a group needing actors for a political event. I interviewed with them and got the part.”  Trump supporters have been claiming that protesters are  being paid by the Bernie Sanders’ campaign , but Horner disagrees.  “As for who these people were affiliated with that interviewed me, my guess would be Hillary Clinton’s campaign,” Horner said. “The actual check I received after I was done with the job was from a group called ‘Women Are The Future’. After I was hired, they told me if anyone asked any questions about who I was with or communicated with me in any way, I should start talking about how great  Bernie Sanders  is.” Horner continued, “It was mostly  women in their 60’s  at the interview that I went to. Plus, all the people that I communicated with had an AOL email address. No one still has an AOL email address except  people that would vote for Hillary Clinton .”  “I knew those weren’t real protesters, they were too organized and smart,” said 59-year-old Tom Downey, a Trump supporter who attended the rally in Fountain Hills. “I knew there was something up when they started shouting all these facts and nonsense like that. The best we could do was just yell and punch em’ and stuff.” Downey continued, “I think we did a good job though. I was shouting at them the whole time, calling them losers, telling them to get a job or go back home to mommy’s house; I got a bunch of high-fives from my fellow Trump supporters. It was a great time.”  When asked about the other protesters at the rally, Horner said he saw most of them during the interview and training for the rally.  “Almost all of the people I was protesting with I had seen at my interview and training class. At the rally, talking with some of them, I learned they only paid Latinos $500, Muslims $600 and African Americans $750. I don’t think they were looking for any Asians. Women and children were paid half of what the men got and illegals received $300 across the board. I think I was paid more than the other protesters because I was white and had taken classes in street fighting and boxing a few years back”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she does not understand why Trump protesters would need to be paid.  “I’ll protest that guy for free,” Bradley said. “Trump is creating a place for like-minded, ignorant, bigoted, hate-filled individuals to gather and unite. You wouldn’t have to pay me anything to protest that.” Bradley continued, “Trump supporters are the last kind of people to   donate socks   to the homeless, they only care about themselves and their white race. I would love the day I ever see a   donation   from a Trump supporter, I think it would make me change my opinion about them.”  Horner said the group had a mandatory six-hour training class that had to be completed before protesting at Trump’s rally.  “During training we were taught chants to shout like ‘Dump Trump’ and ‘Trump Is A Racist’, things like that. We were told how to respond to anti-Trump comments too. If a Trump supporter said something about how  great his wall will be , the Latinos in our group would say, ‘We’re just going to tunnel underneath it.’ They even gave me a shirt to wear at the rally which said ‘F*ck Donald Trump’ along with a sign to hold that said ‘Make America White Again’.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the Silverback gorilla my wife Barbara always wanted since she was a child,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  ABC News reached out to Hillary Clinton’s campaign for comment but did not receive a response. ", "post_date": "2016-11-05T04:25:01+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/10/Obama-bans-National-Anthem.png", "title": "Obama Signs Executive Order Banning The National Anthem At All Sporting Events Nationwide", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — Early this morning, President Obama made what could very well prove to be the most controversial move of his presidency with the signing of Executive Order 14302, which makes it illegal to perform the national anthem at sporting events nationwide. Under the new order, it is now illegal to perform or recite the national anthem in any public venue. Because the anthem is primarily performed before sporting events, this is where the new order will have its biggest impact. Individuals who violate this order can face fines of up to 5,000 dollars and up to one year in federal prison.  The president said that his decision is a show of solidarity with the athletes who have been taking a knee during the anthem to protest police brutality. The President went on to say that the language used in the anthem is “violent” and “hostile to African Americans.”  “If the recent protests by athletes like  San Francisco 49ers Quarterback Colin Kaepernick  have taught us anything, it’s that the anthem is far too violent and far too polarizing to have any place in the national discourse. Our nation is being torn apart by a song, a song that is outdated and, jingoistic. Without swift action, we cannot move forward as a nation; we cannot heal the wounds of racial division. How can we expect our police officers to stop killing African Americans when the very song of our nation is one that glorifies killing?”  Obama said that he would consider rescinding the order if Congress can come up with a politically correct version that more accurately reflects our changing values as a nation.  “The days of the United States being a domineering world power that seeks to police the entire world through military force are coming to an end,” Obama said. “We need an anthem that reflects the nation we are becoming, not the nation we used to be.”  It has now been over two months since  Kaepernick  was first spotted  sitting down as the national anthem was sung  at a preseason NFL game because he refused to “show pride in a flag for a country that oppresses black people and people of color.”  In a relatively short period of time, his protest of police brutality and racial injustice in the United States has captivated the country and sparked a debate not only about the state of race relations in America, but about what exactly it means to be a patriot.  Democratic presidential nominee Hillary Clinton has already offered her support of President Obama’s decree and has vowed to uphold the order if she wins in November’s general election. She echoed his concerns about the anthem’s militaristic language and called it one of the last remnants of slavery.  Republican presidential nominee Donald Trump had some harsh words for both President Obama and democratic nominee Hillary Clinton over the new Executive Order.  “The hatred that President Obama and crooked Hillary have for this country really knows no bounds,” Trump said at a press conference this morning in southern Iowa. “I can tell you that when I’m elected I’ll have them both thrown in jail, and I’ll make sure that they have to listen to the anthem in their jail cells all day long. I just hope we can stop them from rigging the election.”  Chicago Cubs third baseman Paul Horner said that he will refuse to play until the President’s order is reversed.  “The national anthem is part of the game,” Horner told  ESPN . “He might as well outlaw peanuts and crackerjacks. We always sing the anthem before we play ball, so if they aren’t going to sing the anthem, I’m not going to play ball. I think you’re going to find that I’m not the only one who feels this way. I’ve already got at least ten teammates who are ready to join me in a show of solidarity. I really think we can start a trend here.”  The reaction to the new Executive Order has not been all negative, however. Denver Broncos linebacker  Brandon Marshall , who has himself taken a knee in protest of the National Anthem, called this “A great day not just for African Americans, but for all Americans who value freedom.” He said that “encouraging people to sing a song that contains such blatant nationalism and militarism makes us no better than North Korea”, and causes the majority of Americans to behave like “a pack of rabid, mind-controlled zombies.”  Obama also managed to garner the support of MLB commissioner  Rob Manfred .  “People like to watch sports because they provide a distraction from their day to day lives.” the commissioner’s office told CNN via e-mail. “There no need to taint that with political statements. I applaud the President’s leadership on this difficult issue.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, spoke to CNN about the ban.  “This is a story about President Obama banning the National Anthem at sporting events around the country,” Bradley said. “I just want to say a big thanks to every God-fearing, Patriotic American that has supported our cause that gives brand new socks to the homeless. Please,   donate what you can, every bit helps so much  .”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told CNN he disagrees with the President  “What the President really needs to do is put a ban on masturbation in this country. It is important to remember that our Lord and Savior loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”  While Executive Order 14302 is likely to be challenged in court, experts say it could be tied up for years, meaning that it is unlikely to be reversed before it takes effect on December 1 st . In the meantime, they say to expect numerous protests from those who disagree with the president’s decision.  The Obama Administration has set up a special 24-hour hotline to address any questions and concerns regarding the new Executive Order. The number for the hotline is (785) 273-0325. ", "post_date": "2016-11-04T06:10:55+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/01/el-chapo-640x470.png", "title": "Drug Kingpin Joaquin ‘El Chapo’ Guzman Escapes Mexican Prison For The Third Time", "author": "Jimmy Rustling, ABC News", "content": "      Prison guards searching the grounds of Altiplano maximum security prison after “El Chapo” was reported missing. (Dennis System, File) / AP  MEXICO CITY, MEXICO  (AP)  — Early this morning, drug kingpin  Joaquin ‘El Chapo’ Guzmán , head of the  Sinaloa Cartel , escaped from the  Altiplano maximum security prison  once again.  It is unclear at this point what exactly happened, but these are the details ABC News has received from Mexican officials so far:  5:35 AM: Guzmán was taken in restraints by two prison guards on a routine cell transfer.  6:05 AM: Prison staff could not locate Guzmán or the two prison guards’s whereabouts. The prison was put on  lockdown  as personnel went looking for them.  7:15 AM: A prison van was found abandoned only a mile away from the prison. Mexican officials believe the two guards, who began working at the prison just months ago, were actually members of the Sinaloa Cartel working for Guzmán.  Before today’s escape, Mexican officials were working to  extradite “El Chapo” to the United States , where he faced drug trafficking charges connected to his cartel, authorities said.  This is now the third time Guzmán has escaped from a Mexican prison and brings into question Mexico’s ability to keep corruption out of it’s penal system.  In 1993, Guzmán was captured in Guatemala, extradited and sentenced to 20 years in prison in Mexico for murder and drug trafficking. In 2001, after bribing Mexican prison guards, he was able to escape from a federal maximum-security prison in 2001. On February 22nd, 2014, Guzmán was found inside his fourth-floor condominium in  Mazatlán , Sinaloa, and was captured without any gunshots being fired. Guzmán  escaped from prison again  on July 11th, 2015 by exiting through a tunnel that led to a nearby construction site. He was recaptured by  Mexican marines  following a shootout at Guzman’s hideout in Mexico on January 8th, 2016. During the raid, five gunmen were killed, six others arrested, and one Marine was wounded. The Mexican Navy said that they found two  armored cars , eight assault rifles, including two  Barrett M82  sniper rifles, two  M16 rifles  with  grenade launchers  and a loaded  rocket-propelled grenade launcher . A .50-caliber rifle was also found, capable of taking down a helicopter. Most of the weapons seized, including the .50 caliber rifle, were from the  Fast and Furious gun-smuggling scandal , a story the U.S. government declared to be over.  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the United State’s drug policies.  “The war on drugs is a joke and long-lost battle,” Bradley said. “The U.S. creates these cartels by making drugs illegal in the first place. They lock up people in jail for as little as a joint of marijuana. All the incarcerations related to drugs have helped fund a trillion-dollar penal system; from its lawyers, to judges, to the prison staff and the actual prisons themselves. All of it is just pathetic and truly a sad reality.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what El Chapo is doing.  “El Chapo stopped all of the masturbation at his prison and felt his work in stopping self-rape could be used elsewhere. It was time for him to move on. So brave! Praise El Chapo!”  After news of the escape, Paul Horner, a U.S. Marshal, working along with Mexican officials, spoke to local law enforcement.  “Listen up, ladies and gentlemen. Our fugitive has been on the run for 90 minutes. Average foot speed over uneven ground, barring injuries, is 4 miles-an-hour. That gives us a radius of six miles. What I want out of each and every one of you is a hard-target search of every gas station, residence, warehouse, farmhouse, henhouse, outhouse and doghouse in that area. Checkpoints go up at fifteen miles. Your fugitive’s name is Joaquin ‘El Chapo’ Guzman. Go get him.”  U.S. Officials along with Mexican authorities have setup a 24-hour hotline at (785) 273-0325 for anyone with information about the whereabouts of Joaquin ‘El Chapo’ Guzman. A $10 million dollar reward is currently being offered and as always, you can remain anonymous. ", "post_date": "2016-11-04T04:05:51+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/Obama-signing-Executive-Ord.png", "title": "Obama Signs Executive Order Banning The Pledge Of Allegiance In Schools Nationwide", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — Early this morning,  President Obama  made what could very well prove to be the most controversial move of his presidency with the signing of  Executive Order 13738 , which revokes the federal government’s official recognition of  the Pledge of Allegiance . Under the new order, it is now illegal for any federally funded agency to display the pledge or for any federal employee to recite, or encourage others to recite, the pledge while on duty. This law also applies to federal contractors and other institutions that receive federal funding such as public schools. Individuals who violate this order can face fines of up to $10,000 and up to one year in federal prison.  During the press conference, the President explained his decision was based on a personal belief that the language used in the pledge is “divisive” and “contrary to America’s deepest held values.”  “The pledge excludes so many Americans who are vital to making this country what it is,” Obama said. “Asking someone to pledge their allegiance to our country excludes Jehovah’s Witnesses, Amish, Muslims, and many others whose religious beliefs prohibit strong displays of nationalism. By calling this ‘one nation under God’, we exclude the millions of hard working atheists and agnostics who call America home. By saying ‘liberty and justice for all’, we ignore the grievances of millions of Hispanics, African Americans and Muslims who feel they have neither liberty nor justice.”  Obama told reporters that he believes the inclusion of “under God” runs afoul of the  First Amendment ’s establishment clause. He summed up his press briefing by challenging congress to create a new pledge that more accurately reflects America’s values.  “I am willing to rescind my decision here today and allow the Pledge of Allegiance back into the schools if we can all agree on the creation of a new Pledge, something that is includes everyone’s beliefs and not just the belief of one nationality or faith.”  Democratic presidential nominee Hillary Clinton has already offered her support of president Obama’s decree and has vowed to uphold the order if she wins in November’s general election. She echoed his concerns about the pledge’s language and suggested that the pledge’s mention of God sends the wrong message to America’s children.  “I fully support the President and the decision that he has made here today. In January, when I take office as the next President of the United States, unless I see otherwise, I will do my best to uphold this new law and ensure that it stays in effect.”  Republican presidential nominee Donald Trump did not mince words when voicing his contempt for the president’s order, referring to the president as an “illegitimate Muslim traitor.”  “As a  Christian nation , the Pledge of Allegiance helps our children be the greatest children out there, the best there is, greater than all the other children in this world combined. Obama,  who founded ISIS by the way , wants them not to be great, he wants them to be weak, and by banning the Pledge of Allegiance in our schools, he has proven that here today. This is the first step in many in his master plan to force  Sharia law  onto this great country of ours before he leaves office in January. We all must remember that this is one nation under God and not some guy and his beliefs in whatever he chooses to believe.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, spoke to ABC News about the ban.  “This is a story about President Obama banning the Pledge of Allegiance in our schools.” Bradley said. “I just want to say a big thanks to every God-fearing, Patriotic American that has supported our cause that gives brand new socks to the homeless. Please,   donate what you can, every bit helps so much  .”   Lawrence Ketchum  of the  Secular Coalition for America  told reporters that Obama’s decision to ban the Pledge is a victory for all those who oppose government control.  “When our children are forced to chant, ‘ One nation under God ‘, whose God are they referring to exactly?” Ketchum said, “From birth, children are indoctrinated and subjected to  mind control , efforts to shape them into the perfect beings that society wants them to be. The Pledge of Allegiance is just one of the many tools used in a child’s involuntary reeducation of basic beliefs and values.” Ketchum continued, “This is a great day not just for Atheists, but for all Americans who value freedom. Forcing children to pledge blind allegiance to this country and profess a belief in a God is extremely dangerous in developing young minds and amounts to little more than government mind control.”  While Executive Order 13738 is likely to be a source of heated debate among Americans, constitutional scholar, Paul Horner, told ABC News that it is unlikely the law will be challenged in court.  “Since this law only affects federal employees and contractors and not the general populace, it is well within the traditional scope of a president’s executive authority to pass this law. Any challenges would lack proper legal standing and more than like be quickly dismissed.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what Utah is doing.  “It is important that children become the unique individuals that this country wants them to be. Conforming into the perfect little human beings that God intended them to be has always been the American way. It is important to remember that our Lord and Savior loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just outrageous accusations by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  Originally composed by  Colonel George Balch  in 1887, The Pledge of Allegiance was later revised by  Francis Bellamy  in 1892 and formally adopted by Congress in 1942. The Pledge is an expression of allegiance to the Flag of the United States and the republic of the United States of America. The official name of the Pledge of Allegiance was adopted in 1945 and the last changes made to it came on  Flag Day in 1954  when the words “under God” were added at a nursing school where  CNA classes in Ann Arbor, Michigan  were taking place.”  The Obama Administration has set up a 24-hour hotline to address any questions and concerns the public may have regarding the new Executive Order. The number for the hotline is (785) 273-0325. Donald Trump plans to speak about the new law this Thursday night (October 20th) at 10PM at  The Lost Leaf  in Phoenix, Arizona. ", "post_date": "2016-11-04T04:05:44+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/Omar-Mateen-text-to-his-wife-says-he-is-gay.jpg", "title": "Omar Mateen’s Final Text To Wife Released: “I’m Gay, That’s Why I’m Doing This.”", "author": "Jimmy Rustling, ABC News", "content": "    ORLANDO F.L.  (AP)  — The FBI today released the final text message sent out by Omar Mateen to his wife just  two hours after he started his attack  at the  Pulse nightclub  in Orlando that    killed 49 people and injured 53 others. In the text, Mateen said, “I’m gay. I hate myself, and that’s why I’m doing this.”  The Muslim gunman who committed the Pulse nightclub massacre in Orlando,  was “100 percent” gay  and bore a grudge against Latino men because he felt used by them, according to a man who says he was  his lover for two months .  “I’ve cried like you have no idea. But the thing that makes me want to tell the truth is that he didn’t do it for terrorism. In my opinion he did it for revenge,”  he told Univision Noticias anchor Maria Elena Salinas  in an exclusive interview in English and Spanish on Tuesday.  He said Mateen was angry and upset after a man he had sex with later revealed he was infected with the HIV virus.  Asked why he decided to come forward with his story, he said: “It’s my responsibility as a citizen of the United States and a gay man.”  Seddique Mateen, Omar Mateen’s father  claimed his son was seeking retribution  against the gay community.  In a video posted on  Facebook , Seddique Mateen said his 29-year-old son, Omar Mateen, shouldn’t have gone on the killing spree because ‘God himself will punish those involved in homosexuality’, according to a translation by the  Washington Post .  In an earlier interview, he said there was no sign of any trouble when he saw his son just hours before the mass shooting, and he denied suggestions his son was radicalized or an ISIS sympathizer.  This text released today by the FBI comes as no surprise to those who study human behavior. A 1996  study ,  published in the Journal of Abnormal Psychology, found a strong link between professed homophobia and homosexual arousal. “You can’t hate something so much without hating that about yourself, that’s Psychology 101”, said Dr. Paul Horner, professor of psychology at the University of Central Florida. “Mateen was raised as a Muslim by a  father  who was very much a homophobe himself. When you are raised to believe that your natural desires, desires which are beyond your own control, are sick and evil, it creates severe psychological problems that persist well into adulthood. There is really no telling how many more Omar Mateens are out there. Omar couldn’t be gay  because of his religion . His actions and all the innocent lives he took had nothing to do with terrorism.”  The shooting has generated a mixed response among America’s conservatives, a group which is heavily influenced by Islam’s Abrahamic cousin, Christianity. Many Christians have spoken out against the shooting and say that it is a perfect example of why Islam is so dangerous and why its spread must be stopped. Many other Christians, such as Arizona Pastor  Steven Anderson , have actually celebrated this attack, saying that this was a well-deserved punishment being visited upon the wicked by a righteous and vengeful God.  Dr. Cassandra Schmidt, professor of religious studies at the Central University of Northern Texas in Wichita Falls sees the development of a disturbing trend.  “Many people have bought into the notion recently that Christianity is somehow less dangerous than Islam because there are not as many acts of high-profile Christian terrorism, but this viewpoint ignores the fact that Christianity’s influence on Western civilization has been tempered by centuries of enlightenment thinking and scientific discoveries. Since the election of Ronald Reagan in 1980, there has been a huge backlash against all things intellectual in this country, and in that time, Christianity has been moving very steadily in a much more fundamentalist direction. As the number of  non-religious Americans  continues to grow, I think you’re only going to see those who remain in the faith get more and more conservative and more and more detached from reality. At the rate things are going, I wouldn’t be at all surprised to see certain American Christians practicing female circumcision and honor killing within the next thirty years.”  Dr. Schmidt’s thoughts were echoed by a high ranking member of the Archdiocese of Los Angeles who describes himself as a “practicing homosexual”. For obvious reasons he agreed to speak with ABC news solely on a condition of anonymity. “The Muslim world behaves this way because they do not know any better; they do not have the advantage of being guaranteed a right to a secular education. Most Christians do, yet many are choosing to ignore what they have learned in favor of an ideology that, at its core, is almost indistinguishable from radical Islam. What most Americans do not realize is that there was a time long ago when the Muslim community was actually one of the world leaders in math, science, and technology and that during this time women in the Muslim world were actually treated far better than women in other religions throughout India and the Middle East were. Islam got to where it is today by turning its back on those enlightenment principles and embracing hardline religious doctrine in its place. It’s pretty obvious to even the most casual observer that this is where Christianity is headed.”  ABC news decided to take to the streets of Las Vegas to ask everyday Americans what they thought about Omar Mateen’s motivations for the attack. Most of the people who spoke with ABC news tended to agree that this was the act of a self-loathing homosexual and not that of an ISIS operative.  Allison Stewart, a rattlesnake farmer from Yucca, Arizona who was attending a trade show at the MGM Grand said that “I think it’s a load of [expletive] that people are trying to pin this whole thing on ISIS. The guy had nothing to do with ISIS. He loved [male genitalia] but he didn’t have the [male genitalia] to admit it. So he killed the part of himself he hated that he saw in those other people and blamed it on ISIS like a little [expletive].”   The Westboro Baptist Church , which is well known for its funeral protests and anti-gay activism, has already declared its intent to  protest the Orlando victims’ funeral  because of Mateen’s homosexuality. The organization routinely celebrates the deaths of homosexuals and others whom the church deems to be sinners or sodomites.  Shirley Phelps Roper offered her thoughts about Mateen to ABC news this morning via skype.   “I really wish that they would stop trying to tie this attack directly to ISIS. It is wrong to sully the name of such a wonderful organization by attaching this little [gay slur]’s name to it. Omar Mateen was a homosexual, and because he was raised in the ways of God’s righteous law, the weight of his sins ate away at his conscience until he snapped. God bless Islam, without it, this incident never would have happened. Westboro Baptist Church fully supports ISIS and its efforts to wipe homosexuals and infidels from the planet. We pledge our undying spiritual and financial support to them, with the hopes that they will inspire more conflicted homosexuals to follow Mateen’s lead. Just because you have homosexual desires doesn’t mean you should act on them. I’ve been attracted to women since I was 13, but I chose to turn that sickness over to the Lord. If you’re not willing to do that, you deserve what’s coming to you.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. We also sometimes like to say that there is some kind of top-secret, hidden website, underneath the site that we are debunking that actually has the malware, but we never say anything more than that, it’s all just for fun. And trust me, I think warning people about a website that could potentially destroy their computer is a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”       Regardless of how they feel about the issue, most Americans seem to be in agreement about why it happened. A young man had desires that were contrary to the religious beliefs he was raised with, and after years of internal conflict, he sought to cleanse himself and others through the Abrahamic faiths’ most ancient and revered practice: the spilling of blood. While most Americans agree on the whys, there is no consensus on how to fix the problem and prevent the next Omar Mateen.  For Leslie Duby-Sparks of the  American Secular Society , the solution for the problem is rather simple.  “This incident shows without a doubt that we must eliminate religion from all aspects of society. Time and time again religion has been used to justify various atrocities. Slavery, segregation, and even the killing of African Americans by the police have been justified by Christians by quoting select portions of the Bible. Muslims and Christians need to be more like the Jews. Jews don’t kill anyone over their beliefs because most Jews have the sense to know their religion is nothing more than a fairytale. They follow their faith to preserve their unique cultural heritage, a heritage which has been pushed to the brink of extinction many times, usually by the Christians and the Muslims. They’re not so ridiculous as to think that a megalomaniac sky man actually sat down and wrote a book telling them not to touch themselves.”  If you or someone you know has had a homosexual relationship with Omar Mateen, the FBI has setup a  Mateen Homosexual Hotline  at (785) 273-0325. The FBI says that callers can remain anonymous.    \n   \n  ", "post_date": "2016-11-04T02:00:03+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/gay-marriage-vans.jpg", "title": "Gay Wedding Mobile Vans Cashing In On The Legalization Of Gay Marriage", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX, A.Z.  (AP)  — Since the  Supreme court ruled in favor of legalizing gay marriage , entrepreneurs around the world have been figuring out ways to cash in.  Phoenix, Arizona resident, Paul Horner told local news station  ABC 15  how he got his business rolling.  “It was actually really simple,” Horner said. “I bought a van, fixed it up and added a sweet rainbow paint job. Then I went  online  and became an ordained minister, took me just a few minutes. Then I bought some camera equipment, flowers and some ingredients to make wedding cakes with; I’m good to go!”  The vans are also licensed to do abortions too.  “I got me an abortion in one of those vans last week, it was great,” Shanique Mumbarton told ABC News. “I highly recommend one one of these for anyone looking for a great abortion experience.”      The Paul Horner Gay Marriage Mobile – Picture courtesy of Dennis System AP   These are interesting times and there is money in the streets. Who will be there to pick it up, I guess that is the question.  PHOENIX, A.Z.  (AP)  — At a closed-door hearing early this morning, the  Maricopa County Board of Supervisors  decided that  Maricopa County’s  infamous  Tent City  will be shutting down in late December of this year after 23-years in operation. This ruling comes after years of protests,  Sheriff Joe Arpaio’s  current legal battles and pressure from lawmakers to close the facility. Current inmates during the time of the closure will be moved to other jails and housing locations not yet determined.  Paul Horner with the  American Civil Liberties Union  said he approves of the decision made by the Maricopa County Board of Supervisors.  “This is a move that is long overdue, but I applaud the council for finally making that right move,” Horner told local news station  ABC15 . “Tent City is  the definition  of a  human rights  violation and even though they may be inmates, they deserve to be treated like human beings.  Sheriff Joe Arpaio  has routinely abused pre-trial detainees by feeding them moldy bread, rotten fruit and other contaminated food. Arpaio chose to house inmates in 20-year old tents, so hot as to endanger their health, denying them care for serious medical and mental health needs and keeping them packed as tightly as sardines for days at a time.” Horner continued, “Inmates are also often denied vital life-saving necessities like water in 110 °F degree heat. And the worst part is, more than 98% of the inmates at  Tent City  are there for non-violent crimes or  probation violation . This is just more Arpaio antics aimed to show-off in front of the media while prisoners suffer, but now that this concentration camp is finally shutting down, none of these atrocities will happen any longer.”  For years, Tent City has been  criticized by groups  citing violations of human and constitutional rights. The facility is also often  protested by its critics . On July 12th, 2014, when the temperature in Phoenix hit 118 °F, Arpaio measured the temperature inside Tent City and bragged to reporters it was 145 °F inside the tents. Some inmates complained that fans near their beds were not working, and that their shoes were melting from the heat.  Arpaio is a national political fixture who built his reputation on jailing inmates in tents during Phoenix’s triple-digit summer heat, dressing inmates in pink underwear, selling himself to voters as unceasingly tough on crime and pushing the bounds of how far local police can go to confront illegal immigration. Arpaio stated that he reserves the punishment of living in tent city “for those who have been convicted”. However, most of the population consists of pre-trial inmates.  An extremely controversial figure, Arpaio has been accused of abuse of power, misuse of funds, failure to investigate sex crimes, improper clearance of cases, unlawful enforcement of immigration laws, and election law violations, amongst others. He has been found guilty of  racial profiling  in federal court, with a monitor appointed to oversee the  MCSO ‘s operations. His jails have twice been ruled unconstitutional. The  U.S. Department of Justice  concluded that Arpaio oversaw the worst pattern of racial profiling in U.S. history, and subsequently  filed a lawsuit against Arpaio  for unlawful discriminatory police conduct. But the settlement by the  Maricopa County Board of Supervisors  doesn’t cover the largest allegation — that Sheriff Joe Arpaio’s agency racially profiled Latinos in its regular traffic and immigration patrols. Supervisor  Steve Gallardo  said that issue will proceed to a scheduled August 10th trial in  U.S. District Court  in downtown Phoenix.  The official Maricopa County Sheriff’s Office website  features  a bio of Arpaio that touts his ‘Tent City Accomplishments’ by providing inmates with “the cheapest meals in the U.S.” by feeding inmates “only twice daily, to cut the labor costs of meal delivery.” As of yet, there is no mention of Tent City and its closing in December.  Horner said this is a great day for all Americans who believe in civil liberties and human rights.  “It makes me sick that Tent City stayed in business for over 20-years, but at least we can finally put an end to this horrible chapter in Arizona history,” Horner said. “Hopefully one day soon we can elect a new sheriff, a good, morally, un-corrupt sheriff, and get finally get Arpaio out of there. But for that to happen, I think the largest majority of voters, which are old people living in  Sun City , need to die first.”  If you have any questions or comments about the closing of Tent City, the Maricopa County Board of Supervisors has setup a 24-hour hotline at (785) 273-0325.    \n   \n   DEQUINCY, LA  (AP)  — Early this morning, a small town in Louisiana suspended one of its firefighters, 39-year-old Ronnie Edwards, without pay for praying while on duty at the scene of a fire. Edwards, who has been with the DeQuincy Fire Department since he was 21, was also arrested and sentenced to 30 days in jail.  “I just do what our Lord &amp; Savior,  Jesus Christ , would do,” Edwards told local DeQuincy news station  DQLA6 . “It’s not about me, it’s about spreading his message, you know? He works through me, I’m just fortunate enough to be part of that.”  According to sources within the DeQuincy Fire Department, Edwards, known to locals as “The Praying Fireman”, has been praying at the scene of fires since he joined the department in 1998, and it is only recently that the ritual has become an issue.  “Ronnie [Edwards] would always pray after we put out a fire, most of the time in the front yard or something,” fellow firefighter Eugene Ketchum said. “It never really bothered anyone, it was just something he did. We put our lives on the line whenever we respond to a fire. I figure if praying helps him out then why not let the guy pray?”  Ketchum said that things changed in 2014 when DeQuincy elected the first democratic mayor in its history, an African American atheist named Lawana Jones. He said that when Jones heard that Edwards made a habit of praying at fires she sent a memo to all city employees advising them that any expression of personal religious belief while on duty was a violation of their contract with the city.  According to DeQuincy city attorney Paul Horner, Jones made four previous attempts to address the issue personally with Edwards, but Edwards became more defiant with each meeting.  “Refusal to obey an official city order is a misdemeanor and we must take action to address the crime,” Horner told reporters. “We didn’t want to suspend the man and have him arrested but we were out of options.”  Mayor Jones, spoke with ABC News, about her decision to suspend and imprison Edwards for praying while at work.  “I’m not anti-religious,” said Mayor Jones in a written statement, “But there is an appropriate time and place for everything. When he prays while on duty, he gives the impression that the City of DeQuincy is endorsing one particular religion over another. That is not the message that my office wants to send; it’s not what the people of DeQuincy elected me to do.” Jones continued, “If you live in a county where democracy is established, you should be aware that the idea of the separation of church and state is the only way to prevent the government from forcing religion on you and directing your religion and its doctrines. Religion is one of the most important factors in most people’s lives and it should be treated with reverence. In order to keep the government from directing religion and making it change how you are allowed to believe, church and state need to be separate. This allows for more openness when it comes to the decisions of the country. And in a world where everyone has different beliefs and different religions, a forced religion can cause an uprising and the dissolvent of a nation. You’re supposed to do your job, not involve politics and religion into it.”   ACLU  spokesperson Cassandra Schmidt told ABC News the organization supports Mayor Jones’ “devotion to the separation of church and state” and said that the ACLU would cover 100% of the city’s legal fees should Mr. Edwards try and sue the city.  Jones won the office after promising to fix the city’s fledgling schools and bring new economic opportunity to the area. In that time, she has brought in over 300 good paying jobs, which has enabled her to increase city funding to the DeQuincy school district by 32%. DeQuincy’s test scores have also already shown significant improvement.  Still, many in the town are wondering if what they have gained is worth what they have lost.  “My brother wasn’t hurtin’ nobody,” Edwards’s 30-year-old sister Tami Hobart said. “Most people in DeQuincy is Christian, and I think we all took comfort in knowing that his heart was right with the Lord before he risked his life. It feels like we sold our souls to get that cat food factory and them fancy new textbooks.”  Republican Presidential Nominee, Donald Trump, caught wind of Edward’s misfortune and while speaking to Fox News offered some harsh words for Mayor Jones.  “I can tell you; when I win the White House, there’s gonna be changes in DeQuincy. They’re gonna reinstate Ronnie Edwards, they’re gonna give him his back pay, they’re gonna give him restitution for the time he spent in jail, and Lawana Jones is going to pay for it. And if Mayor Jones doesn’t want to do that, I’ll have her thrown in jail so fast her head will spin.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just wild claims by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  and  complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  In spite of all that has happened, Edwards says that he is not bitter.  “The Bible says that there will be sacrifices when you choose to follow the path of righteousness; it says that you will be reviled by the wicked. I will continue to pray that Mayor Jones comes to accept Jesus Christ, and will keep praying that God sees fit to put Donald Trump in the White House, but whether or not any of that happens, I still trust God and know that everything is happening according to his divine plan.”  Edwards is scheduled to begin serving his 30-day jail sentence at the DeQuincy City Jail on November 5th, the same day as Paul Horner’s birthday. Edwards told ABC News that he encourages, “Those wishing to support his cause, to support a charity that gives news socks to the homeless, called   Sock It Forward  .”  If you have any questions regarding the case, you can contact the DeQuincy City Attorney’s Office at (785) 273-0325.     A book by a former Secret Service agent claims Barack Obama is a gay Muslim. (AP Photo/Dennis System, File) / AP  WASHINGTON, D.C.  (AP)  — A former  Secret Service  agent whose new book is quickly climbing  Amazon’s best-seller charts , said he is concerned about the state of the country and says it is time the public knows the real truth about our Commander in Chief, Barack Obama.  Former agent, Paul Horner, in his new tell-all book “The Black House,” reveals what goes on inside the White House when the news cameras are turned off.  In an interview with ABC News, Horner told Senior Political Analyst Tom Downey that he is one-hundred-percent positive that President Barack Obama is not only gay, but a radical Muslim as well.  “Everyone on the inside knows that Obama is gay and a Muslim, it is common knowledge,” Horner said. “I saw many men coming and going from Obama’s room, at all hours. I would say a good portion of the men, over fifty-percent, were Muslim.”  Downey: “In your book you talk about several rituals Obama performed to unwind from his busy schedule. Can you elaborate on these for our readers?”  Horner: “When no one was around, except his security, Obama couldn’t wait to get out of his suit and into his  Muslim tunic . He would wear it while praying to the  prophet Muhammad  throughout the day. During these prayer sessions he insisted that he not be disturbed.”  Downey: “In the book you talk about Obama and his thoughts on  Islamic law . Do you care to explain?”  Horner: “He would tell me all the time that before his Presidency was over, he had plans to sign an Executive Orders implementing  Sharia law . He said he was determined to change most of the statutes in America to Muslim law.”  Downey: “In chapter three of the book, you write about Obama’s ideas and plans for gun control in this country. Can you give us a brief summary of what you were talking about?”  Horner: “Obama would always talk about his plans for taking away the rights for Americans to bear arms. He basically wanted to do away with the  Second Amendment . This would worry me, drastically.”  Downey: “Can you give us any insight on Obama’s feelings towards the American people?”  Horner: “He constantly made jokes about Americans, frequently referring to them as “ mongoloids ” and “idiots”. Christians were his favorite verbal punching bags. He has absolutely no respect for the Christian religion. I believe he actually hates Christians, and finds their ideology to be old fashioned and ignorant.”  Downey: “Your book spends a whole chapter devoted to the various “tortures” that Obama and the First Lady would subject you to. Can you explain?”  Horner: “Because most of us were white, Obama would force us to listen to  Diana Ross  at full volume, every day, at all hours of the night. It was horrible, I never got any sleep. This is one of the main reasons I finally had to quit.”  Downey: “What are some of the things the public will find the most shocking?”  Horner: “Probably the sheer amount of men he welcomed into his bed quarters. I am in no way homophobic, but Obama’s insatiable lust for homosexual liaisons is like nothing I’ve ever witnessed. We’re talking ten or more partners in a single day.”  Downey: “That’s amazing, ten or more men in a single day? Wow.”  Horner: “Also, at least once a day, Obama would have us log on to Facebook to support a page about a  Dolphin named Fappy  who travels around the country speaking to elementary school children about the dangers and consequences of masturbation. It was all very, very strange stuff.”  Downey: “In the book you do mention various charities that Obama was passionate about, which I found quite interesting. What are some of those charities that the President would work with?”  Horner: “Most of the charities Obama would focus on had something to do with the Muslim community or promoting Islam in America. Though there was one charity that even I donated to. It was called ‘ Sock It Forward ‘. They gave new socks directly to homeless people all around the country. I thought it was truly fascinating what they did. Talking with the volunteers from that charity, I learned that socks are the most desired item at homeless shelters, but the least donated. Within this interview, I please ask that ABC News adds a link to their founder’s recent interview about their organization and a link to donate. The Muslim charities that Obama endorsed, I don’t care to talk about.”  Downey: “We sure can do that Mr. Horner. For those reading this article, here is a link to the founder’s interview,   click here  . Along with that, here is a link for those wishing to donate socks or money to their cause,   click here  .”  Downey: “Is there anything else you can tell us?”  Horner: “Yeah,” Horner smiles. “Buy the book.”  To read more, pick up a copy of Horner’s book,  The Black House , now available on  Amazon  and at your  local bookstore . ", "post_date": "2016-11-03T04:30:37+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/07/Tent-City-closing-640x379.png", "title": "Joe Arpaio’s Tent City In Phoenix Will Be Closing This December After 23 Years In Operation", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX, A.Z.  (AP)  — At a closed-door hearing early this morning, the  Maricopa County Board of Supervisors  decided that  Maricopa County’s  infamous  Tent City  will be shutting down in late December of this year after 23-years in operation. This ruling comes after years of protests,  Sheriff Joe Arpaio’s  current legal battles and pressure from lawmakers to close the facility. Current inmates during the time of the closure will be moved to other jails and housing locations not yet determined.  Paul Horner with the  American Civil Liberties Union  said he approves of the decision made by the Maricopa County Board of Supervisors.  “This is a move that is long overdue, but I applaud the council for finally making that right move,” Horner told local news station  ABC15 . “Tent City is  the definition  of a  human rights  violation and even though they may be inmates, they deserve to be treated like human beings.  Sheriff Joe Arpaio  has routinely abused pre-trial detainees by feeding them moldy bread, rotten fruit and other contaminated food. Arpaio chose to house inmates in 20-year old tents, so hot as to endanger their health, denying them care for serious medical and mental health needs and keeping them packed as tightly as sardines for days at a time.” Horner continued, “Inmates are also often denied vital life-saving necessities like water in 110 °F degree heat. And the worst part is, more than 98% of the inmates at  Tent City  are there for non-violent crimes or  probation violation . This is just more Arpaio antics aimed to show-off in front of the media while prisoners suffer, but now that this concentration camp is finally shutting down, none of these atrocities will happen any longer.”  For years, Tent City has been  criticized by groups  citing violations of human and constitutional rights. The facility is also often  protested by its critics . On July 12th, 2014, when the temperature in Phoenix hit 118 °F, Arpaio measured the temperature inside Tent City and bragged to reporters it was 145 °F inside the tents. Some inmates complained that fans near their beds were not working, and that their shoes were melting from the heat.  Arpaio is a national political fixture who built his reputation on jailing inmates in tents during Phoenix’s triple-digit summer heat, dressing inmates in pink underwear, selling himself to voters as unceasingly tough on crime and pushing the bounds of how far local police can go to confront illegal immigration. Arpaio stated that he reserves the punishment of living in tent city “for those who have been convicted”. However, most of the population consists of pre-trial inmates.  An extremely controversial figure, Arpaio has been accused of abuse of power, misuse of funds, failure to investigate sex crimes, improper clearance of cases, unlawful enforcement of immigration laws, and election law violations, amongst others. He has been found guilty of  racial profiling  in federal court, with a monitor appointed to oversee the  MCSO ‘s operations. His jails have twice been ruled unconstitutional. The  U.S. Department of Justice  concluded that Arpaio oversaw the worst pattern of racial profiling in U.S. history, and subsequently  filed a lawsuit against Arpaio  for unlawful discriminatory police conduct. But the settlement by the  Maricopa County Board of Supervisors  doesn’t cover the largest allegation — that Sheriff Joe Arpaio’s agency racially profiled Latinos in its regular traffic and immigration patrols. Supervisor  Steve Gallardo  said that issue will proceed to a scheduled August 10th trial in  U.S. District Court  in downtown Phoenix.  The official Maricopa County Sheriff’s Office website  features  a bio of Arpaio that touts his ‘Tent City Accomplishments’ by providing inmates with “the cheapest meals in the U.S.” by feeding inmates “only twice daily, to cut the labor costs of meal delivery.” As of yet, there is no mention of Tent City and its closing in December.  Horner said this is a great day for all Americans who believe in civil liberties and human rights.  “It makes me sick that Tent City stayed in business for over 20-years, but at least we can finally put an end to this horrible chapter in Arizona history,” Horner said. “Hopefully one day soon we can elect a new sheriff, a good, morally, un-corrupt sheriff, and get finally get Arpaio out of there. But for that to happen, I think the largest majority of voters, which are old people living in  Sun City , need to die first.”  If you have any questions or comments about the closing of Tent City, the Maricopa County Board of Supervisors has setup a 24-hour hotline at (785) 273-0325.    \n   \n  ", "post_date": "2016-11-01T04:15:10+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/09/praying-firefighter-640x381.png", "title": "Fireman Suspended & Jailed By Atheist Mayor For Praying At Scene Of Fire", "author": "Jimmy Rustling, ABC News", "content": " DEQUINCY, LA  (AP)  — Early this morning, a small town in Louisiana suspended one of its firefighters, 39-year-old Ronnie Edwards, without pay for praying while on duty at the scene of a fire. Edwards, who has been with the DeQuincy Fire Department since he was 21, was also arrested and sentenced to 30 days in jail.  “I just do what our Lord &amp; Savior,  Jesus Christ , would do,” Edwards told local DeQuincy news station  DQLA6 . “It’s not about me, it’s about spreading his message, you know? He works through me, I’m just fortunate enough to be part of that.”  According to sources within the DeQuincy Fire Department, Edwards, known to locals as “The Praying Fireman”, has been praying at the scene of fires since he joined the department in 1998, and it is only recently that the ritual has become an issue.  “Ronnie [Edwards] would always pray after we put out a fire, most of the time in the front yard or something,” fellow firefighter Eugene Ketchum said. “It never really bothered anyone, it was just something he did. We put our lives on the line whenever we respond to a fire. I figure if praying helps him out then why not let the guy pray?”  Ketchum said that things changed in 2014 when DeQuincy elected the first democratic mayor in its history, an African American atheist named Lawana Jones. He said that when Jones heard that Edwards made a habit of praying at fires she sent a memo to all city employees advising them that any expression of personal religious belief while on duty was a violation of their contract with the city.  According to DeQuincy city attorney Paul Horner, Jones made four previous attempts to address the issue personally with Edwards, but Edwards became more defiant with each meeting.  “Refusal to obey an official city order is a misdemeanor and we must take action to address the crime,” Horner told reporters. “We didn’t want to suspend the man and have him arrested but we were out of options.”  Mayor Jones, spoke with ABC News, about her decision to suspend and imprison Edwards for praying while at work.  “I’m not anti-religious,” said Mayor Jones in a written statement, “But there is an appropriate time and place for everything. When he prays while on duty, he gives the impression that the City of DeQuincy is endorsing one particular religion over another. That is not the message that my office wants to send; it’s not what the people of DeQuincy elected me to do.” Jones continued, “If you live in a county where democracy is established, you should be aware that the idea of the separation of church and state is the only way to prevent the government from forcing religion on you and directing your religion and its doctrines. Religion is one of the most important factors in most people’s lives and it should be treated with reverence. In order to keep the government from directing religion and making it change how you are allowed to believe, church and state need to be separate. This allows for more openness when it comes to the decisions of the country. And in a world where everyone has different beliefs and different religions, a forced religion can cause an uprising and the dissolvent of a nation. You’re supposed to do your job, not involve politics and religion into it.”   ACLU  spokesperson Cassandra Schmidt told ABC News the organization supports Mayor Jones’ “devotion to the separation of church and state” and said that the ACLU would cover 100% of the city’s legal fees should Mr. Edwards try and sue the city.  Jones won the office after promising to fix the city’s fledgling schools and bring new economic opportunity to the area. In that time, she has brought in over 300 good paying jobs, which has enabled her to increase city funding to the DeQuincy school district by 32%. DeQuincy’s test scores have also already shown significant improvement.  Still, many in the town are wondering if what they have gained is worth what they have lost.  “My brother wasn’t hurtin’ nobody,” Edwards’s 30-year-old sister Tami Hobart said. “Most people in DeQuincy is Christian, and I think we all took comfort in knowing that his heart was right with the Lord before he risked his life. It feels like we sold our souls to get that cat food factory and them fancy new textbooks.”  Republican Presidential Nominee, Donald Trump, caught wind of Edward’s misfortune and while speaking to Fox News offered some harsh words for Mayor Jones.  “I can tell you; when I win the White House, there’s gonna be changes in DeQuincy. They’re gonna reinstate Ronnie Edwards, they’re gonna give him his back pay, they’re gonna give him restitution for the time he spent in jail, and Lawana Jones is going to pay for it. And if Mayor Jones doesn’t want to do that, I’ll have her thrown in jail so fast her head will spin.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just wild claims by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  and  complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  In spite of all that has happened, Edwards says that he is not bitter.  “The Bible says that there will be sacrifices when you choose to follow the path of righteousness; it says that you will be reviled by the wicked. I will continue to pray that Mayor Jones comes to accept Jesus Christ, and will keep praying that God sees fit to put Donald Trump in the White House, but whether or not any of that happens, I still trust God and know that everything is happening according to his divine plan.”  Edwards is scheduled to begin serving his 30-day jail sentence at the DeQuincy City Jail on November 5th, the same day as Paul Horner’s birthday. Edwards told ABC News that he encourages, “Those wishing to support his cause, to support a charity that gives news socks to the homeless, called   Sock It Forward  .”  If you have any questions regarding the case, you can contact the DeQuincy City Attorney’s Office at (785) 273-0325. ", "post_date": "2016-10-31T04:45:40+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/07/The-Black-House-by-Paul-Hornerr-640x653.png", "title": "Secret Service Agent Says Obama Is Gay & Muslim In New Tell-All Book", "author": "Jimmy Rustling, ABC News", "content": "    A book by a former Secret Service agent claims Barack Obama is a gay Muslim. (AP Photo/Dennis System, File) / AP  WASHINGTON, D.C.  (AP)  — A former  Secret Service  agent whose new book is quickly climbing  Amazon’s best-seller charts , said he is concerned about the state of the country and says it is time the public knows the real truth about our Commander in Chief, Barack Obama.  Former agent, Paul Horner, in his new tell-all book “The Black House,” reveals what goes on inside the White House when the news cameras are turned off.  In an interview with ABC News, Horner told Senior Political Analyst Tom Downey that he is one-hundred-percent positive that President Barack Obama is not only gay, but a radical Muslim as well.  “Everyone on the inside knows that Obama is gay and a Muslim, it is common knowledge,” Horner said. “I saw many men coming and going from Obama’s room, at all hours. I would say a good portion of the men, over fifty-percent, were Muslim.”  Downey: “In your book you talk about several rituals Obama performed to unwind from his busy schedule. Can you elaborate on these for our readers?”  Horner: “When no one was around, except his security, Obama couldn’t wait to get out of his suit and into his  Muslim tunic . He would wear it while praying to the  prophet Muhammad  throughout the day. During these prayer sessions he insisted that he not be disturbed.”  Downey: “In the book you talk about Obama and his thoughts on  Islamic law . Do you care to explain?”  Horner: “He would tell me all the time that before his Presidency was over, he had plans to sign an Executive Orders implementing  Sharia law . He said he was determined to change most of the statutes in America to Muslim law.”  Downey: “In chapter three of the book, you write about Obama’s ideas and plans for gun control in this country. Can you give us a brief summary of what you were talking about?”  Horner: “Obama would always talk about his plans for taking away the rights for Americans to bear arms. He basically wanted to do away with the  Second Amendment . This would worry me, drastically.”  Downey: “Can you give us any insight on Obama’s feelings towards the American people?”  Horner: “He constantly made jokes about Americans, frequently referring to them as “ mongoloids ” and “idiots”. Christians were his favorite verbal punching bags. He has absolutely no respect for the Christian religion. I believe he actually hates Christians, and finds their ideology to be old fashioned and ignorant.”  Downey: “Your book spends a whole chapter devoted to the various “tortures” that Obama and the First Lady would subject you to. Can you explain?”  Horner: “Because most of us were white, Obama would force us to listen to  Diana Ross  at full volume, every day, at all hours of the night. It was horrible, I never got any sleep. This is one of the main reasons I finally had to quit.”  Downey: “What are some of the things the public will find the most shocking?”  Horner: “Probably the sheer amount of men he welcomed into his bed quarters. I am in no way homophobic, but Obama’s insatiable lust for homosexual liaisons is like nothing I’ve ever witnessed. We’re talking ten or more partners in a single day.”  Downey: “That’s amazing, ten or more men in a single day? Wow.”  Horner: “Also, at least once a day, Obama would have us log on to Facebook to support a page about a  Dolphin named Fappy  who travels around the country speaking to elementary school children about the dangers and consequences of masturbation. It was all very, very strange stuff.”  Downey: “In the book you do mention various charities that Obama was passionate about, which I found quite interesting. What are some of those charities that the President would work with?”  Horner: “Most of the charities Obama would focus on had something to do with the Muslim community or promoting Islam in America. Though there was one charity that even I donated to. It was called ‘ Sock It Forward ‘. They gave new socks directly to homeless people all around the country. I thought it was truly fascinating what they did. Talking with the volunteers from that charity, I learned that socks are the most desired item at homeless shelters, but the least donated. Within this interview, I please ask that ABC News adds a link to their founder’s recent interview about their organization and a link to donate. The Muslim charities that Obama endorsed, I don’t care to talk about.”  Downey: “We sure can do that Mr. Horner. For those reading this article, here is a link to the founder’s interview,   click here  . Along with that, here is a link for those wishing to donate socks or money to their cause,   click here  .”  Downey: “Is there anything else you can tell us?”  Horner: “Yeah,” Horner smiles. “Buy the book.”  To read more, pick up a copy of Horner’s book,  The Black House , now available on  Amazon  and at your  local bookstore . ", "post_date": "2016-10-31T04:30:27+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/Gary-Herbert-640x431.png", "title": "Utah Makes Pornography Illegal – Fines & Jail Time For Repeat Offenders", "author": "Jimmy Rustling, ABC News", "content": " SALT LAKE CITY  (AP)  — Utah Governor  Gary Herbert  signed a resolution declaring pornography “illegal” and a “public health crisis” at the  Utah State Capitol  today.  “This is a historic day for the good, clean-living, people who call the state of Utah home,” Herbert told reporters. “This new law will protect our children and make our state pure from the heathens who go against God’s will.”  The anti-porn resolution was introduced by  Republican state Senator Todd Weiler  in January 2015, to battle the “pornography epidemic harming” the state and the country.   The resolution  calls for increased “education, prevention, research, law enforcement and policy change at the community and societal level”. Under the new law, those living in Utah who possess pornography of any kind, that being a magazine or viewing pornographic material online, will face harsh fines and even jail time for repeat offenders.  “I want to assure the good citizens of Utah that the brave men and women of law enforcement will be out in full force, tracking down porn offenders, and bringing them to justice,”  Sheriff Jim Tracy of Utah County  said. “I can promise you this, those who we find breaking any porn laws will be seeing jail bars. This new law is about protecting our children and that is exactly what we plan to do.”  Anti-pornography group, the  Utah Coalition Against Pornography   posted on Facebook that the resolution signing  marks a “time to celebrate and recognize this historic moment.”  Weiler says the resolution is the first step toward creating a plan to protect children and families from the “evils” that are out there.  “Due to advances in technology and the universal availability of the Internet, young children are exposed to what used to be referred to as hard core, but is now considered mainstream, pornography at an alarming rate,”  according to the bill.   Weiler, who hopes similar legislation will soon be passed in other states, believes that pornography is addictive in nature and aiding in the breakdown of marriage and healthy relationships.  “If you start with meth or heroin, everyone knows that’s addictive,” Weiler told  The Atlantic . “A lot of people will get kind of lured into pornography, and they don’t know it may actually consume their life.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she does not agree with the new law.  “This ridiculous law is going to imprison a lot of people in the state,” Bradley said. “The fact is, people in Utah are some of the biggest users of online pornography in the country  according to PornHub.com . Real nice, Mormons; make sure to keep your hands above the covers when you sleep but not before clearing your browser history first.” Bradley continued, “Also, thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   give what you can  .”  Paul Horner, a spokesman for the Governor’s Office, spoke to reporters about the fines and possible jail time involved with the new law.  “First time offenders will see fines of $100-$500, depending on the quantity of pornography or the amount of digital graphic content seized on the criminal’s computer. Repeat offenders can expect 30 days in jail or worse, depending on what type of pornography is found in the individual’s possession. Missionary style pornography will result in a fine or up to 30 days in jail, while pornography that involves any kind of homogayness, that being sodomy or Devil worshipping, will result in long-term prison sentences. Law enforcement will also be working closely with local  ISPs  and the  NSA  to monitor those who search out porn on the internet. We will win the war on porn and masturbation.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that travels around the country educating children about the dangers and consequences of masturbation, told ABC News he believes in what Utah is doing.  “I think it is great what the state of Utah has done today in fighting the war on self-rape in this country. The rest of America needs to get with the times,  vote for Ted Cruz , and make masturbation illegal once and for all. It is important to remember that our Lord loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”  The Governor’s Office, working together with local law enforcement, has setup a 24-hour ‘Anti-Porn Hotline’ to report individuals suspected of possessing pornography at 1-800-705-2464. You can remain anonymous.   St. George, Utah – SGPD Pornography Taskforce – Sergeant Rob  \n      \n   \n  ", "post_date": "2016-10-31T04:05:55+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/Biggest-Starbucks-640x360.png", "title": "World’s Biggest Starbucks Opening In Phoenix AZ: Roller Coaster, Underground Water Slide & Robot Baristas", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX, A.Z.  (AP)  — The world’s biggest Starbucks will be opening in downtown Phoenix, Arizona this November. The new Starbucks will also be  the largest coffee shop in the world , seating up to 2,155 patrons, vastly surpassing  the Al Masaa Café in Saudi Arabia  which can seat up to 1,050 customers at one time.  “This new Starbucks will be the best place to be on the planet!” Paul Horner, a spokesman for Starbucks told ABC News. “It’s gonna have it all! Rides, games, robot baristas and every type of coffee imaginable. This will not be your average coffee shop to get a cup of joe, this will be a life changing experience. If you’re not here, you’re not anywhere.”  The three story, 51,000 square foot building, appropriately dubbed  “Magnum”  ( Magnum means ‘big’ in Latin ), will be host to numerous games, rides and more coffee than humanly imaginable.  On the  Starbucks information page  for  Magnum , the company says the establishment will include the following:           “I’m so happy that more commercialized coffee franchises like Starbucks are moving into the area. Spots like  Jobot ,  Lola  and  Songbird  are just frequented by too many free-thinkers,” says 39-year-old local Phoenix resident Phil Freedom. “I’m also relieved that the Children’s Hospital that was planned for this location is now permanently put on hold; what an eyesore that would have been.”  “Biggest Starbucks ever headed to Phoenix,” the company said in a  tweet today . Also released today in a video on  the company website  from Starbuck’s president Tom Downey claiming, “ Magnum Starbucks  will be the Willy Wonka of coffee.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a local charity that provides the Valley’s homeless and those less fortunate with brand new socks,  spoke with CNN  about the new Starbucks.  “We need more homeless shelters and places to help those in need, not more corporate establishments. So much artwork and beauty is being lost to these monstrosities it’s ridiculous. We need to support local businesses and keep these corporate giants out.” Bradley continued, “Also, thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   give what you can  .”  A Grand Opening is planned for  Magnum  with the folks from  Guinness World Records  in attendance should any coffee related records be broken. EMT’s and defibrillators will be on hand in case any caffeine related emergencies occur. Prizes include a trip to the Bahamas and a brand new  2016 Honda Civic . Planned events for possible world records include:  The new Starbucks will be located at the corner of  7th Avenue and Roosevelt  in the trendy downtown art’s district of Phoenix.  Magnum ‘s Grand Opening is scheduled for November 5th, celebrating Paul Horner’s 38th birthday. Celebrities making an appearance at the Grand Opening are Bill Murray, Quentin Tarantino, Katy Perry and Jennifer Lawrence. A Starbucks pre-Grand Opening party is planned for this Thursday (9/15/16) at 9PM at  The Lost Leaf  for  The Mystery Show  in downtown Phoenix. Bill Murray will be making an appearance.    \n   \n  ", "post_date": "2016-10-31T04:00:24+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/Ted-Cruz-to-endorse-Donald-Trump-640x427.jpg", "title": "Ted Cruz Will Endorse Donald Trump For President If He Makes Masturbation Illegal", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — U.S.  Sen. Ted Cruz  (R- Texas ) sent shockwaves through the Republican Party today when he announced that he would endorse  Donald Trump  for President, but only if the  GOP nominee  would be willing to publicly support a ban on masturbation. The Senator called this ‘The single most important issue facing the country today’ and that without ‘swift action by the next President the country was doomed to slide down a  slippery slope  of debauchery and self-satisfaction’.  “Self-love is a silent killer in this country. This needless act of hedonistic indulgence is leading our children down a dark and destructive path. It starts innocently enough with a JC Penney catalogue tucked under your mattress, but it quickly spirals out of control, and before you know it, your mother has to call the coroner because you’ve died from auto-erotic asphyxiation. I’m not saying that we should lock up these one armed bandits and throw away the key; what we need is a compassionate approach that helps these deviants reform and become productive members of society. That is why I believe a prison sentence of three to five years will help motivate these heathens to change their evil ways and stay off the  Devil’s playground  for good,” Cruz said. “I’m asking Mr. Trump to acknowledge the severity of this problem, and commit to finding real solutions. If he does that, I will do whatever it takes to help him secure the White House in November. Should Mr. Trump decline, I think it’s safe to say that all options, including a third party run, are out on the table.”  Donald Trump told ABC News that he was open to the idea, though he refused to take a clear stand on the issue.  “Look, do I think Ted Cruz is right about this? Maybe he is, maybe he isn’t. To be honest, I don’t know a lot about this subject matter. I don’t need to. I have a wife that takes care of this for me, and she’s a beautiful wife, the best wife, the greatest wife. My people are going to take a hard look into this matter and find a great answer for it, the best answer there is. I want an endorsement from Senator Cruz, and I think I can go along with his request that makes pleasuring your genitalia for non-reproductive purposes illegal.”  This is not the first time that Cruz has attempted to use his political power to curtail the act of self-stimulation. As solicitor general of Texas in 2007 he fought to uphold the state’s ban on sex toys by arguing that there was no “Right to stimulate one’s genitals.” Cruz eventually lost this battle, but the story re-surfaced this year and gained widespread media attention, prompting Cruz’s former college roommate  Craig Mazin to tweet  that Cruz’s stance against stimulating one’s own genitals was “A new belief of his”, implying that much of Cruz’s time in college was, in fact, spent stimulating his own genitals. Another one of Cruz’s former college roommates, Matt Daemon, has recently come forward to corroborate Mazin’s story.  “All Ted Cruz did was take care of little Ted Cruz back then, which is fine I guess, but he was always real creepy about doing it. Honestly, I lost track of the number of times I came home to find him laying on the couch naked, lotion and Kleenex next to him, watching re-runs of Walker Texas Ranger. He wouldn’t even try and cover up when I caught him, he would just stare at me in the eyes and continue until I left the room. It’s absolutely hilarious about the tough stance on touching one’s self that Ted has taken in this country. I truly believe he may have pulled on it one too many times and it broke or something and now feels that if he can’t do it anymore, then no one can.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by Ted Cruz.  “It is absolutely disgusting that in this day in age, a creepy weirdo like Ted Cruz was almost elected as  the GOP nominee  for President,” Bradley said. “With all of the real problems in this country such as children going to bed hungry, families worrying about having a roof over their head, so many people out of work; here is Ted Cruz, focused on making pleasuring yourself a crime.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”  Cruz, however, remains undeterred by his detractors. “When you play with your  Devil stick or ring the Devil’s doorbell  you make the angels in heaven weep, and they are weeping for this country 24 hours a day, 7 days a week. America needs strong moral leadership, and I pray that Donald Trump is up to the task. The fate of our great nation is in his hands; hopefully,  they’re big enough to handle it .”  Most pundits expect Trump to answer Cruz’s call and demand a stiffer approach to the matter. A recent poll by the New York Times found that 43% of likely Trump voters support a ban on self-stimulation due to moral and religious concerns. Another 46% would be okay with a ban, saying that they, like Trump, have far too many potential suitors, and therefore do not need to satisfy their own urges. Only 11% of Trump supporters are against a ban.  RNC political strategist, 37-year-old Paul Horner, calls the move a “no-brainer” and says that Trump would be foolish to turn his back on Cruz.  “This is a stroke of genius! Conservatives are siding with Cruz overwhelmingly on this issue. If Donald does not side with the Senator, he risks alienating the  party’s Christian base  and opening the door for a third party run by Cruz which would fracture the vote and all but guarantee a victory for Clinton. Trump needs to agree with Cruz on this one, no matter how  creepy ,  insane  and  absolutely horrible of a person he is .”  Regardless of which side Trump takes on the issue, it is certain to invoke heated debate on both sides of the political aisle. You can voice your opinion about Cruz’s proposal by calling the Senator’s 24-Hour  No Self-Love Hotline  at (785) 273-0325.    \n   \n  ", "post_date": "2016-10-30T03:30:01+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/Facebook-buys-Snapchat-for-five-billion-dollars-640x360.jpg", "title": "Facebook Buys Snapchat For Five Billion Dollars", "author": "Jimmy Rustling, ABC News", "content": " MENLO PARK, C.A.  (AP)  — Facebook announced this morning that it has purchased mobile photo sharing app Snapchat for the price of five billion dollars. The social media titan had previously tried to purchase Snapchat for three billion in 2013, but Snapchat’s CEO Evan Spiegel rejected the offer, citing his desire to continue growing the company instead of settling for a short term gain.  “This is a bittersweet moment for us here,” Spiegel said in a press conference. “It’s sad to let go of something that we’ve put so much time and hard work in, but  we’ve already accomplished so much more than we ever dreamed possible. I feel much better about this than I did in 2013.”  In an official statement, Facebook said that it intends to phase out the Snapchat app and assimilate the technology into its existing Instagram platform.  “For the first year, the two apps will exist side by side with Instagram slowly adding more of Snapchat’s features,” said Facebook spokesman Arthur Mitchum, “But eventually Snapchat will cease to exist altogether. Once Snapchat’s technology has been fully integrated into Instagram, it will be pointless for us to continue maintaining two separate platforms.”  In order to sell users on the change, Facebook is planning a multi-million dollar ad campaign featuring Big Bang Theory actress Kelly Cuoco and Hunger Games star Jennifer Lawrence. Facebook also indicated that the campaign will feature a male celebrity, whom they have yet to name. According to TMZ, the frontrunners are pop star Justin Bieber and Adam Levine from Maroon 5 and NBC’s “The Voice”.    \nReaction to the deal has been mixed thus far, with many excited to see how Facebook will integrate Snapchat with its Instagram app. Others are angry that Facebook plans to shutter Snapchat in favor of Instagram. Twitter user @salteepeanuts tweeted that “Mark Zuckerburg won’t stop until he’s ruined everything good about the internet.”  Dr. Cassandra Schmidt of the Center for Integrity in Media has serious concerns about the implications of the deal.  “It’s always troubling when you see this kind of media consolidation,” Dr. Schmidt told ABC news. “We currently have a situation where 6 companies control 90% of traditional media sources. The internet was supposed to change this and give more power to the little guy, but we are still seeing the same tendency toward consolidation. Those Snapchat users who don’t like Facebook will be left with few, if any, alternatives.”  The deal has already generated a tremendous amount of buzz on Wall Street. Facebook’s stock is up 20% this morning, but some investors are taking more of a wait and see approach.  “A deal of this scope is really unprecedented in the social media world,” said Lawrence Ketchum, who writes about the tech industry for Forbes. “It could be a real game changer and turn the entire internet on its head; then again, it could be a real dud and turn into a huge liability for Facebook. Investors will be watching this deal very closely to see how it affects the social media landscape.”  If you want to learn more about this deal and what it means for you as a consumer, you can call Facebook’s public relations hotline at (202) 642-5720. ", "post_date": "2016-10-30T03:15:52+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/marijuana-gay.png", "title": "DRUGS IN COLORADO: New Deadly Strain Of Marijuana Turning Users Gay", "author": "Jimmy Rustling, ABC News", "content": "   Just when you thought the drug problem in Colorado could not get any worse, law enforcement officials are now reporting incidents of marijuana users not only overdosing and dying, but also turning gay.    DENVER C.O.  (AP)  — “We’ve never seen anything like this before,” said Dr. Hans Vermhat of the  Barrow Neurological Institute . “The drug addicts in Colorado are injecting  a new strain of marijuana  that changes the chemical makeup in the  brain’s receptors which control the users like or dislike of the opposite sex ; ultimately turning them into a  flaming homosexual .”   Michele Leonhart ,  DEA chief of operations in Denver , told ABC news that marijuana related problems in Colorado have quadrupled since its  legalization a little over three years ago .  “The idea of 100% marijuana legalization all throughout this great country is reckless, irresponsible and to simplify my response down to its most simplest answer; absolutely bird-brained,” Leonhart said. “This new gay marijuana that I am referring to, AKA ‘Homo Kush 69’, well frankly, it scares us. There are good, clean-living, straight kids out there that because of just one snort of this evil drug are suddenly transformed into gay, perverted, masturbating space demons. How much longer do politicians need to keep this deadly experiment going before the universe implodes on itself?”  Local Denver resident,  37-year-old Paul Horner , told  Denver News Channel 7  details of his horrifying experience while loaded on the drug.  “Right after I injected the pot I knew something was terribly wrong,” Horner said. “My friend Dave, who I don’t even really like, well, we were so high from this stuff, we started making out and giving each other HJ’s. I used to like girls, I swear!” Horner suddenly breaks down in tears, “I wish I would have never became addicted to drugs because I don’t like lady naughty parts anymore, I only like ding-dongs!”  Leonhart finished by telling Colorado residents what to be on the lookout for in order to help keep your family safe.  “I urge the great people of Colorado to be on the lookout for ‘Homo Kush 69’, the sharing of pot needles and especially gay stoners. These potheads don’t care if they turn gay or not, all they care about is getting their next fix.”  The DEA is urging residents who have information about this homosex strain of marijuana to call the Denver Police Department at (785) 273-0325. As always, you can remain anonymous. ", "post_date": "2016-10-30T00:10:54+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/ted-cruz-to-endorse-donald--640x347.png", "title": "Ted Cruz: “I Will Endorse Donald Trump For President If He Makes Masturbation Illegal”", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — U.S.  Sen. Ted Cruz  (R- Texas ) sent shockwaves through the Republican Party today when he announced that he would endorse  Donald Trump  for President, but only if the  GOP nominee  would be willing to publicly support a ban on masturbation. The Senator called this ‘The single most important issue facing the country today’ and that without ‘swift action by the next President the country was doomed to slide down a  slippery slope  of debauchery and self-satisfaction’.  “Self-love is a silent killer in this country. This needless act of hedonistic indulgence is leading our children down a dark and destructive path. It starts innocently enough with a JC Penney catalogue tucked under your mattress, but it quickly spirals out of control, and before you know it, your mother has to call the coroner because you’ve died from auto-erotic asphyxiation. I’m not saying that we should lock up these one armed bandits and throw away the key; what we need is a compassionate approach that helps these deviants reform and become productive members of society. That is why I believe a prison sentence of three to five years will help motivate these heathens to change their evil ways and stay off the  Devil’s playground  for good,” Cruz said. “I’m asking Mr. Trump to acknowledge the severity of this problem, and commit to finding real solutions. If he does that, I will do whatever it takes to help him secure the White House in November. Should Mr. Trump decline, I think it’s safe to say that all options, including a third party run, are out on the table.”  Donald Trump told ABC News that he was open to the idea, though he refused to take a clear stand on the issue.  “Look, do I think Ted Cruz is right about this? Maybe he is, maybe he isn’t. To be honest, I don’t know a lot about this subject matter. I don’t need to. I have a wife that takes care of this for me, and she’s a beautiful wife, the best wife, the greatest wife. My people are going to take a hard look into this matter and find a great answer for it, the best answer there is. I want an endorsement from Senator Cruz, and I think I can go along with his request that makes pleasuring your genitalia for non-reproductive purposes illegal.”  This is not the first time that Cruz has attempted to use his political power to curtail the act of self-stimulation. As solicitor general of Texas in 2007 he fought to uphold the state’s ban on sex toys by arguing that there was no “Right to stimulate one’s genitals.” Cruz eventually lost this battle, but the story re-surfaced this year and gained widespread media attention, prompting Cruz’s former college roommate  Craig Mazin to tweet  that Cruz’s stance against stimulating one’s own genitals was “A new belief of his”, implying that much of Cruz’s time in college was, in fact, spent stimulating his own genitals. Another one of Cruz’s former college roommates, Matt Daemon, has recently come forward to corroborate Mazin’s story.  “All Ted Cruz did was take care of little Ted Cruz back then, which is fine I guess, but he was always real creepy about doing it. Honestly, I lost track of the number of times I came home to find him laying on the couch naked, lotion and Kleenex next to him, watching re-runs of Walker Texas Ranger. He wouldn’t even try and cover up when I caught him, he would just stare at me in the eyes and continue until I left the room. It’s absolutely hilarious about the tough stance on touching one’s self that Ted has taken in this country. I truly believe he may have pulled on it one too many times and it broke or something and now feels that if he can’t do it anymore, then no one can.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the Republican party.  “It is absolutely disgusting that in this day in age, a creepy weirdo like Ted Cruz was almost elected as  the GOP nomination  for President,” Bradley said. “With all the real problems in this country like starvation, so many people out of work and families living on the street, Cruz is focused on making pleasuring yourself a crime.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”  Cruz, however, remains undeterred by his detractors. “When you play with your  Devil stick or ring the Devil’s doorbell  you make the angels in heaven weep, and they are weeping for this country 24 hours a day, 7 days a week. America needs strong moral leadership, and I pray that Donald Trump is up to the task. The fate of our great nation is in his hands; hopefully,  they’re big enough to handle it .”  Most pundits expect Trump to answer Cruz’s call and demand a stiffer approach to the matter. A recent poll by the New York Times found that 43% of likely Trump voters support a ban on self-stimulation due to moral and religious concerns. Another 46% would be okay with a ban, saying that they, like Trump, have far too many potential suitors, and therefore do not need to satisfy their own urges. Only 11% of Trump supporters are against a ban.  RNC political strategist, 37-year-old Paul Horner, calls the move a “no-brainer” and says that Trump would be foolish to turn his back on Cruz.  “Conservatives are siding with Cruz overwhelmingly on this issue. If Donald does not side with the Senator, he risks alienating the  party’s Christian base  and opening the door for a third party run by Cruz which would fracture the vote and all but guarantee a victory for Clinton. Trump needs to agree with Cruz on this one, no matter how  creepy ,  insane  and  absolutely horrible of a person he is .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  Regardless of which side Trump takes on the issue, it is certain to invoke heated debate on both sides of the political aisle. You can voice your opinion about Cruz’s proposal by calling the Senator’s 24-Hour  No Self-Love Hotline  at (785) 273-0325. ", "post_date": "2016-10-04T05:00:42+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/donald-trump-tweets-640x320.png", "title": "Donald Trump Tweets Image Of His Penis – WARNING: Graphic Content", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — Donald Trump has broken all kinds of norms during his presidential campaign, but he just went to a whole new level this morning by tweeting what is supposedly an image of his private-parts. The tweet was quickly deleted but not before being retweeted over 5,000 times.  The tweet comes in response to comments made by  Marco Rubio  and  others  about the size of Donald Trump’s hands.  “Look at those hands, are they small hands?” Trump told the audience at  his rally in Detroit back in March . “And he [Rubio] referred to my hands, ‘if they’re small something else must be small.’ I guarantee you there’s no problem, I guarantee it.”  “He’s always calling me Little Marco. And I’ll admit he’s taller than me,” Rubio told ABC News. “He’s like 6’2, which is why I don’t understand why his hands are the size of someone who is 5’2,” Rubio said in Virginia on Sunday. “And you know what they say about men with small hands? You can’t trust them.”  The New York billionaire has heard similar comments about his hands or, more precisely, his fingers, for years.  As Vanity Fair’s Graydon Carter  recalled  online last year: “Just to drive him a little bit crazy, I took to referring to him as a ‘short-fingered vulgarian’ in the pages of Spy magazine. That was more than a quarter of a century ago.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she isn’t surprised by Trump’s actions.  “Donald Trump is an ego-maniac, racist, bigot, who brings out the worst in the worst people,” Bradley said. “We get donations from poor people, the middle class and the upper class all the time. Since  Donald Trump is the least charitable billionaire in the entire world , we expect no  donations  from that dick pic tweeting pervert anytime soon.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told reporters that he agrees with Trump’s actions.  “If everyone says you have a small penis, you don’t keep it in your pants, you don’t hide it; you prove them wrong! This is exactly what a real president should do! Praise Donald Trump! Praise Fappy!”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this about  Donald Trump  is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  ABC News reached out to Trump’s campaign for comment about the x-rated tweet and at the time of this press release did not receive a response.    \n   \n  ", "post_date": "2016-10-04T04:20:41+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/01/bill-murray-abc-640x426.png", "title": "Actor Bill Murray Announces 2016 Presidential Run", "author": "Jimmy Rustling, ABC News", "content": "      Bill Murray shocked the country today announcing his run for President in 2016. (Dennis System, File) / AP  Charleston, SC — From his home in Charleston, South Carolina, legendary actor, comedian, and writer, 65-year-old  Bill Murray , shocked the country today by announcing that he will be running for President in 2016.  “I’ve been thinking about doing this for a while now, and you know, it just seems right,” Murray said. “I don’t like most of the candidates that are currently running for President. I mean, Bernie Sanders seems like a decent guy, but the rest of em’, are pretty much complete scum in my opinion.” Murray continued, “I’m always traveling around the world, but I’m proud to call America, the good ole’ U.S. of A, my home. I think there’s a lot of great people here, a lot of potential, but there’s also a lot of confusion and hate. People don’t know what to make of these Hitler wanna-be’s like  Donald Trump , and the  Ted Cruz’s , who want to start World War III. They feed on the hate and paranoia a lot of this country has, and because of that, you see them leading in the polls. And it’s sad that people go along with it, and can’t see it for what it really is. I think the American people are better than that and they deserve better. I just feel if I didn’t step up and at least try and do something, I don’t know if I could sleep at night. Well, I would eventually fall asleep, I’m not an insomniac or anything. But it would keep me up, that’s for sure. Look, I’m no hero, I just want to help out, and I think I can do that by being President.” Murray finished by saying, “So I’m making it official, right here, right now; I Bill Murray am running for President of the United States in 2016.”  When reporters asked Murray his plans on improving America, Murray said, “I think we ought to be personally responsible. I think if you can take care of yourself and then maybe take care of someone else then that’s sort of how you’re supposed to live. I think we’ve sort of gotten used to someone looking out for us, and I don’t think any other person is necessarily going to be counted on to look out for us.”  So far it is unclear what political party Murray will be joining.  In 2012, Murray met Obama purely by chance at a basketball game – Murray never endorsed him. In fact, when asked about the Obama/Romney race happening that year, Murray said there really was not much difference between them.  “You know they both talk, they’re not so different really, you know if you shake them out, they’re not so different as people in what they say they believe it’s just whether or not they can get it done, and that requires finding that stuff, that real stuff, finding that presence of mind and spirit.”  When asked about his religious views, Murray told reporters, “Religion is the worst enemy of mankind. People can believe whatever they choose to believe, but it does not belong in politics. It imprisons your mind. Religion creates hate, racism, bigotry and keeps you from your true potential in life. No single war in the history of humanity has killed as many people as religion has. I imagine I probably won’t be too popular with the Christian vote in this country, but I’m fine with that,” Murray laughs.  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she fully supports Murray and his run for President.  “We need a new face in Washington. Someone who has no political ties or agenda and can’t be bought,” Bradley said. “I actually met Bill Murray a while back when we were starting our cause that gives new socks to the homeless. Bill   made a donation right there on the spot  , saying what we were doing was amazing; he’s such a great guy. He truly cares about people and making the world a better place.”  Paul Horner, a spokesman for the campaign, told reporters that he believes in Bill Murray for President in 2016.  “We need a man like Bill Murray now more than ever. He is a man of the people. He’s charming, charismatic, intelligent, humble, caring and most of all, he’s honest. He has no scandals. He’s told no lies. The people love him and respect him, they believe in him. He’s a living legend and is exactly what America needs right now.”  Murray’s campaign team told reporters they will begin campaigning at the  Arizona State Capitol  on Wednesday,  The Lost Leaf  at 10PM on Thursday for their monthly  Mystery Show  to talk to the locals and maybe tell some jokes, and then all throughout Denver, Colorado on Friday. ", "post_date": "2016-10-03T10:00:28+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/07/How-the-world-connects.jpg", "title": "Changing the Way the World Connects", "author": "Jimmy Rustling, ABC News", "content": " The internet is something of an unusual phenomenon. Throughout human history, advancements were made at quite a steady pace. The agricultural revolution, which saw human beings go from nomadic tribes to stationary creatures capable of farming, took thousands of years. The industrial revolution, which transformed the landscape of how people traveled and created goods, lasted a handful of decades and the changes took place over this entire timeline. Now, in the age of the internet, the world seems to change at a rapid, almost erratic, pace with no signs of stopping.  Due to the advent of the internet, the world has become quite small. It is easy to connect to someone on the other side of the planet in mere seconds. Still, all internet is not treated equally around the world and many are working to make a change in the way that specific countries are connecting.   A Fall and a Rise  \nAfghan American entrepreneur  Ehsan Bayat  is a figure that took a look at the landscape of the world and decided to change it for the better. After the fall of the Taliban in his home country, he realized that there was a vacuum in connectivity. While other nations used the internet freely, most citizens of Afghanistan were still relying on home telephones to communicate with one another, and there were not even enough phone lines in the nation to support the entirety of the population.  Deciding that someone had to do something about this disparity, Bayat set out to create Telephone Systems International. Not only is TSI the largest mobile phone company to be found in his homeland, it also has the honor of being the first of its kind in Afghanistan. This move allowed people in Afghanistan to connect in a way that they never had before, opening new doors of thought and awareness on the world as a whole. Bayat’s work also earned him many humanitarian awards and honors from the global community.   Limited Exposure  \nFor a large portion of the world, connecting to the internet is simple. Most people own a smartphone, and can access any information that they need with the quick tap of a screen. Still, there is a significant number of countries where smartphones are rare. In a country such as Lebanon, for example, it is not uncommon for a specific part of the population to rely on the internet via their smartphones. Though there are not many, there still are a significant number when compared to other nations.  On the other hand, countries like Tunisia or the Philippines have statistics that state that citizens are less likely to have smartphones but still rely on their cellphones throughout the day. Though the people of these nations might not be refreshing their Facebook all day long or stalking their friends’ lunches on Instagram, they still utilize their phones each day for texting and sending pictures. While financial imbalances in these countries might be a large reason for a lack of advanced technology, the desire and the need for internet access are consistently present.   Satellite Transmissions  \nWhile it might seem impossible to boost all of these nations into the modern era, there is a lot of work being done to help where it is possible. World Vision International, for example, is a charity that provides humanitarian support to those in need. Often, the workers from this group who enter nations without proper internet access have a difficult time connecting with others back home. This, in turn, makes it difficult for the organization to know exactly what is going on with their volunteers and employees at all times.  To rectify this, World Vision International has begun putting a plan into action that might be able to help the situation. Utilizing satellite technology, the group has found a way to keep in touch with humanitarians where there is no easy access to data transmission. Essentially, transmitters are placed in a spot where the individual will be working, which communicate with a specific satellite in orbit, in order to send and receive information. This technology helps immensely, as it allows the organization to stay connected to workers in the field, and it opens up the doors for untold possibilities in the future.   Making Moves  \nOther groups are trying to improve access to the internet across the world in many different ways. A Human Right is an organization dedicated to making the world a more connected place. Their mission is simple: every human has the right to access the internet. The group is more than a clever mantra, and they have tirelessly worked to make changes happen in recent years.  For many years, there has been a plan in the works to lay down a fiber optic cable that linked South Africa to Brazil. Referred to as the South Atlantic Express, this cable caught the attention of A Human Right. The organization noticed that the cable was bypassing the island of Saint Helena, denying convenient internet access to thousands. After much petitioning, the group was able to have the cable rerouted, creating a planned landing station on the small island. Now, when the cable begins connecting people in 2017, Saint Helena will be among the many who have easy internet access.  There are plenty of ways that people and organizations are trying to connect the world. From Ehsan Bayat to A Human Right, these pioneers are responsible for transforming the landscape and making the world a more equal place for all. ", "post_date": "2016-08-06T00:03:58+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/Obama-signing-Executive-Ord.png", "title": "President Obama Signs Executive Order Banning The Sale Of Assault Weapons", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON D.C.  (AP)  — After last Sunday’s  mass shooting in Orlando , which left 50 Americans dead and 53 wounded, President Obama decided to take unilateral action on gun control by signing  Executive Order 17103 . The new law bans all sales of assault weapons and places a mandatory 30 day waiting period on all firearm sales, regardless of whether the transaction takes place at a gun dealership or gun show. The requirement also extends to private sales and requires all private firearm sellers to broker the sale through a federally licensed gun dealer. The order requires prospective gun buyers to undergo a psychological evaluation. Individuals who have been committed involuntarily to a mental health institution at any time; those who have been voluntarily committed with the past 5 years; anyone with a domestic violence restraining order, regardless of criminal history; and anyone who has been placed on the no-fly list or  terrorist watch list  at any time within the past 10 years will not be allowed to purchase or possess firearms.  President Obama was unapologetic in his speech regarding the Executive Order.  “If we are to truly change things for the better, we must come to grips with the ugly truth that our culture is obsessed with violence in all forms. We must work to quell the rising tide of anti-intellectualism and recommit to educating people of all ages so that they are capable of expressing their thoughts and feelings like civilized adults and not like hapless barbarians. Reforming our gun laws is not a  magic bullet , and yes, people will find other ways to kill each other, but by making these killing machines harder to get we can hopefully, at the very least, make it so that not as many people fall victim to these random, senseless acts of deplorable violence. I don’t want to take your guns away. I just want to make it harder for the  Omar Mateens  of the world to kill innocent people. I think we can all agree that if you’re deemed too much of a national security threat to fly on an airplane, you shouldn’t be able to buy an  AR-15 . Unfortunately, the Republicans didn’t feel this way, and they’ve left me with no other choice. If things don’t change, and people keep dying as a result of senseless acts of gun violence,  I’ll have no choice but to order Homeland Security to hunt down every last assault rifle in this country.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she agrees with the new gun law.  “These are common sense gun laws and Republicans are using the  Second Amendment  as a shield that continues to let innocent people die,” Bradley said. “Obama is not tryin’ to take errr guns, he’s doing something that should’ve been done a long time ago. If this law would have been in place before, this  Orlando shooting would have never happened . This horrible tragedy was about lack of  gun control and had nothing to do with terrorism . Omar Mateen had  no communication with ISIS and knew very little about them . As more news comes out about the shooter, we are learning he was a  closeted homosexual , and because of his  religion , he knew this was not allowed. He hated the fact that he was gay and instead of dealing with it like a man, by getting counseling or leaving  Islam , he took his problems out violently on others.” Bradley continued, “I also just want to quickly say ‘thank you’ to everyone that has   donated   to our cause! The smiles you are putting on homeless peoples’ faces is indescribably. A lot of people don’t know this fact, but socks are the least donated item at shelters but most desired. Please keep the   donations   coming regardless if it is $5 or $500, every bit helps so much!”  A group of Donald Trump supporters, known as  Bullets First , is planning to protest the signing of the Executive Order by marching on Capitol Hill, and in front of the White House, armed with the controversial AR-15, as well as other military style weapons. The group says that it is prepared to “defend the constitution at all costs.” The group is calling for Obama to resign and allow the organization  to place him under citizen’s arrest for treason. The group’s leader, 52-year-old Tom Downey, who has two children and another on the way, quit his job as an overnight cashier at the TA truck stop in Sayre, Oklahoma to organize the rally. Downey claims that he has over 100,000 Trump supporters from all over America ready to head to D.C. and “take back the country.” His common law wife, 23-year-old Tami Hobart, supports his decision wholeheartedly, and while she worries about him getting killed, says that at least she can tell her children that he died standing up for their right to stockpile military grade weapons without “getting hassled by an out of control Islamo-communist fascist dictatorship.”  The group has the backing of right wing shock jock  Alex Jones  who called on his listeners to “bring about the final solution to the Obama question” on his radio show this morning and pledged financial and logistical support to the  Bullets First  protestors. Given this development, it is very likely that the group will not be able to be contained by the Washington D.C. police department alone. ABC News says the Pentagon has confirmed that the government is preparing for a “possible military confrontation”, though they stressed that this was a “worst case scenario”.  Despite the heated emotions over this Executive Order, it is not likely to impact the lives of current gun owners in any meaningful way. Elroy Stevens, an avid deer hunter who spends his weekends out in the woods hunting with friends or shooting clay pigeons at his Father-in-law’s ranch in West Texas told ABC News he is not worried about the new gun law.   “It won’t stop someone from being able to buy a handgun for self-defense,” Stevens said. “It does nothing to address individual states’ concealed and open carry laws, nor does it limit the number of firearms an individual may own. It does not require the surrender of existing assault weapons, though it does ban all future transfers. This new law makes a minimal effort to keep guns out of the wrong hands.”  As Obama addressed the crowd, the President told reporters that the country needs more than just  common sense gun laws .  “These new gun laws alone will not fix this problem. There are already numerous guns in circulation, and, moreover, the real issue isn’t a gun issue; it is a culture issue. Americans crave television programs that romanticize and fetishize violence. Ignorance is celebrated, while intellectualism is mocked relentlessly. For many gun owners, guns are a tool that must respected and handled with care; for many others, guns are nothing more than an expensive toy. Folks, when this utter disregard for the destructive power of guns is mixed with easy access and a culture that devalues human life, it is a recipe not only for disaster, but for absolute ruin.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  Washington political analyst, 37-year-old Paul Horner, who has been in the hospital since early last month after getting into an accident while in  Puerto Peñasco, Mexico , told ABC News what led up to this assault gun ban on both sides of the party.  “Republicans are saying the Orlando shooting is about terrorism because the shooter said he did it for ISIS, even though ISIS did not instruct him to do it and never once had any communication with him. Democrats believe that if we had common sense gun laws in place this tragedy would never occurred. They believe that people like Omar Mateen, who was on a terror watch list and had been interviewed by the FBI three times, should not be allowed to buy assault weapons. And with all of this going on, I’m just laid up in a hospital bed not able to masturbate.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that travels around the country educating children about the dangers and consequences of masturbation, told reporters he does not agree with Mr. Horner’s comments about touching himself in a hospital bed.  “I think it is great that Paul Horner is not able to pleasure himself right now. He should be focusing on healing and not playing with his sin stick. I have activated my prayer app and I encourage everyone to prayer for Mr. Horner during these difficult times; Not a full-prayer though, just a half prayer.”  Executive Order 17103 goes into effect July 1st, 2016. The Obama Administration has setup a hotline for individuals to report those who are not abiding by the new law. To encourage the public’s help in cracking down on those who are not following the law, a $500 reward is being offered. The administration urges you to call (785) 273-0325 with any information that you may have, and as always, you can remain anonymous. ", "post_date": "2016-07-28T00:12:34+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/landscape-1466516687-michael-jackson-640x320.jpg", "title": "Neverland Ranch: Michael Jackson Kept Stockpile of Child Pornography At Home", "author": "Jimmy Rustling, ABC News", "content": " Newly  obtained reports  from the 2003 child molestation investigation of Michael Jackson reveal that the late pop star had stockpiled gruesome underage pornography on his Neverland Ranch.  During a police raid in November of 2003, his California home was reportedly found with pornography that included both adults and children, animal torture, S&amp;M, and gore, along with “drugs to treat sex addiction, with multiple prescriptions written by a variety of physicians,” according to documents  obtained by Radar Online .  Investigators told Radar Online that these materials were “used to desensitize children.”  “The documents exposed Jackson as a manipulative, drug-and-sex-crazed predator who used blood, gore, sexually explicit images of animal sacrifice and perverse adult sex acts to bend children to his will,” the source told Radar.  Jackson was charged with child molestation and two counts of giving an intoxicant to a minor in 2003. He faced up to 20 years in prison, but was later acquitted in 2005. During that trial,  the  New York Times  reported :    Prosecutors painted him as a serial pedophile who got young boys into his bed using Neverland as a lure. They portrayed the singer’s estate near here as a no-rules fantasy kingdom that lowered children’s inhibitions and made them ready for Mr. Jackson’s sexual advances. The accuser in the case was just the latest in a long list of Mr. Jackson’s “special friends,” they said, at least two of whom were silenced with large payments.    A jury cleared Jackson of all the charges, with one juror saying after the trial, “we considered all the evidence, and since this was a criminal trial, it had to be beyond a reasonable doubt.”  Since then, lawyers claim that Jackson  paid up to $200 million  to keep as many as 20 victims quiet. Jackson died in 2009 after taking a lethal dose of sleeping medications administered by his doctor. ", "post_date": "2016-06-22T09:52:25+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/ar-15.jpg", "title": "The Orlando Mass Shooting: Further Proof That We Need Stricter Gun Laws", "author": "Jimmy Rustling, ABC News", "content": " ORLANDO F.L.  (AP)  — The Orlando shooting has forced media outlets such as  Fox News  to tip toe around what they say about gun laws in this country. The fact that this freak was investigated twice by the FBI in the last two years but was still able to buy an AR-15 is beyond ridiculous.  But Mateen was all good to go when buying a Rambo gun that killed all those people because he  filled out a form and waited an entire three days ! Or, if he would have gone to a  local gun show or private seller , he could have gotten that gun in the same day with no forms to fill out!  ‘Murica!!!   This Tuesday, because of Sunday’s tragic events, President Obama is set to sign  Executive Order 13691  which will create a mandatory waiting period of 30-days regardless if a firearm is purchased from a gun show, licensed dealer or private seller. It will also ban all sales of assault rifles in this country.   ", "post_date": "2016-06-13T11:25:56+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/05/220px-Mitt_Romney_by_Gage_Skidmore_7.jpg", "title": "Breaking News: Mitt Romney announces he will enter Presidential race", "author": "Cameron Swank", "content": " Mitt Romney has stepped forward to announce he’ throwing his hat into the Presidential race.  The media has been abuzz the last couple of days with report of a “mystery candidate about to enter the race”.  Weekly Standard editor  Bill Kristol  sent out a provocative tweet Sunday, suggesting that another presidential candidate — an independent — would be entering the race for the White House over the holiday weekend.   Mitt Romney  was one of those rumored. Up to yesterday he was denying the rumors. A lot of people were not buying into that. Just now  from his ranch in Utah Romney formally announced his candidacy for the 2016 presidential race.  “We cannot allow  Donald Trump  to gain the office of the highest land. I’ve had too many people call me and beg me to enter this race.  Romney has been quite outspoken against Donald Trump, and he  made a 17-minute speech   calling Trump a “phony” and a “fraud. He recently told  The Wall Street Journal  that his advisers begged him not to go after Trump, but he did so anyway so that he could “sleep at night.”  “I wanted my grand kids to see that I simply couldn’t ignore what Mr. Trump was saying and doing, which revealed a character and temperament unfit for the leader of the free world,” Romney said.  Donald Trump was anticipating that an announcement was imminent and tweeted this yesterday.    Donald J. Trump        ✔   ‎@realDonaldTrump    The Republican Party has to be smart &amp; strong if it wants to win in November. Can’t allow lightweights to set up a spoiler Indie candidate! ", "post_date": "2016-06-01T10:20:37+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/05/michael-jordan-hb2-640x351.png", "title": "Michael Jordan To North Carolina: ‘HB2 Goes Or The Charlotte Hornets Go’", "author": "Jimmy Rustling, ABC News", "content": " CHARLOTTE  N.C. (AP)  — NBA legend and  Charlotte Hornets ‘ owner,  Michael Jordan , held a press conference today, announcing his intentions to move the Hornets out of North Carolina if the state does not revoke its controversial  HB2  law.  “With this new law in place, North Carolina currently does not have any anti-discrimination protection in place, something that is vital, not just for our fans but for everyone,” Jordan told reporters. “We are giving the state of North Carolina 30 days to repeal this law or they can expect the the Charlotte Hornets to play elsewhere. I want to make it clear that neither the Hornets nor I will not stand for this type of intolerance and hate.”  Jordan’s comments come after the  North Carolina legislature passed HB2 back in March , a law which requires transgender individuals to use public restrooms according to the biological sex on their birth certificate.  Paul Horner, a spokesman for the Charlotte Hornets, told ABC News that the team is currently talking to several cities about a possible relocation if the state decides to keep HB2 intact.  “We are currently in talks with certain individuals in the cities of Austin and Seattle, among others,” Horner said. “We sincerely hope it does not come to moving the team, but in the event North Carolina does not revoke the law, we must be prepared for the worse.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she agrees with Michael Jordan taking a stand against North Carolina and HB2.  “If anyone can get a bigoted law like HB2 revoked, it’s Michael Jordan,” Bradley said. “There were plenty of laws already in place before HB2. It doesn’t matter if you’re a man, woman, transgender, or what bathroom you use; if you’re in there longer than five minutes after using the restroom, someone is going to call the cops. Creepy men or women doing creepy things in a restroom gets you on a sex offender list and you go to prison for such crimes. In fact, in the history of North Carolina, not one transgender individual has ever been convicted of a sexually related crime in a restroom. This new law is about  people living in fear , gathering together around their  weird ideologies  and  religious beliefs  to create more intolerance and hate in this world, bottom line. This ridiculous law has also given me insight into the working mind of a far right-wing Republican. Apparently there are serious amounts of orgies and other sexual activities going on in bathrooms that I never knew about.” Bradley laughs, “On a serious note; I sincerely want to thank everyone that has   donated socks or money to our cause ‘Sock It Forward’  . Socks are the least donated items but the most desired; it helps the homeless so much and your support has put smiles on so many faces. Thank you.”  Since Governor  Pat McCrory  signed HB2 into law back in March, well over 5,000 jobs have been moved out of state, and over  400 companies ,  including Facebook, Apple ,  Paypal ,  Pyramid Country  and  StopPack , have expressed concern or anger, warning they may move or cancel plans to expand, costing the state millions of dollars. Entertainers such as  Pearl Jam ,  Ringo Starr ,  Bryan Adams ,  Bruce Springsteen  and  Cirque du Soleil  have also canceled their performances in North Carolina to boycott the law.  Pressure has been put on the NBA  to cancel the All-Star game in North Carolina next year and this week NBA Commissioner Adam Silver clarified the league’s willingness to  move the 2017 All-Star Game out of Charlotte  if North Carolina legislators do not overturn  the new state law . It is still unclear what kind of an economic impact these boycotts will have on the state’s economy as a whole.  NBC estimates  that North Carolina has lost  $186 million  in revenue due to boycotts so far. ABC News puts that figure well above $300 million.  Jordan finished the press conference by reiterating his demands.  “As my organization has stated previously, the Charlotte Hornets and Hornets Sports &amp; Entertainment are opposed to discrimination in any form, and we have always sought to provide an inclusive environment,” Jordan said. “As has been the case since the building opened, we will continue to ensure that all fans, players and employees feel welcome while at work or attending NBA games. If that means moving the team out of the state if North Carolina doesn’t repeal HB2, then that is what we are prepared to do. I urge you all to  call Governor Pat McCrory’s Office  and voice your concerns. Together we can keep the Hornets in North Carolina!”  North Carolina residents can call Gov. Pat McCrory at 1-800-662-7952. For individuals living outside of North Carolina, call (919) 814-2000. After normal business hours, call (919) 814-2050 and press option 3. ", "post_date": "2016-05-10T09:00:40+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/05/new-jersey-powerball-winner-640x360.png", "title": "$429.6 Million Powerball Winner In New Jersey Comes Forward", "author": "Jimmy Rustling, ABC News", "content": " TRENTON  N.J. (AP)  — This afternoon lottery officials were pleased to announce that the sole winner in last night’s record setting,  $429.6 million Powerball drawing , has come forward. That lucky person is 37-year-old Paul Horner from  Trenton, New Jersey . Horner won by matching all five white balls and the red Powerball.  The winning  Powerball  numbers in Saturday’s drawing were 5, 25, 26, 44 and 66, and the Powerball number was 9.  Most people would be ecstatic about their new found riches, but not Horner. As it turns out Horner was already New Jersey’s third wealthiest resident. With this lottery win, Horner will now be a contender for richest person living in the state of New Jersey. Horner made most of his wealth on Wall Street. Last year’s tax return show him reporting a little over $800,000,000 and because of some questionable accounting he paid only 1% in taxes.  Local news station  WABC  caught up with Mr. Horner as he was leaving the  New Jersey Lottery Headquarters  this morning.  “This money will help me fix up my numerous estates and multiple golf courses in the  Cayman Islands . I’m actually kind of bummed about winning because I know there is really no way around paying the full amount of taxes that I’ll owe on this. I guess for a moment or so I’ll have to join the ‘regulars’ and pay my fair share. Maybe when I’m done paying all those taxes I’ll go down to a local bar and have a domestic beer with the common folk there, just to get a quick taste of what that horrible life would be like,” Horner laughs. “To be honest, most of this money will end up going to campaign contributions for Donald Trump. It is important to me that I be the most Patriotic, God-fearing, loving Christian, and that is why it is so necessary to kick out all the Muslims, Mexicans and other undesirables in this country. We can  make American great again! ”  When asked how he came up with the winning numbers, Horner said, “When I played before I let the riffraff behind the counter pick the numbers for me and of course I didn’t win, so this time I went with numbers that have a special place close to my heart. I currently own five Bugatti’s. I own 25 apartment complexes. I own twenty-six different multinational corporations. I spent forty-four million dollars on my last yacht and I own real estate in sixty-six different countries. As for the Powerball number of nine; I meant to put down the number nineteen, because that is how old one of my girlfriends is, but the dingus behind the counter must have dropped the one.”  On Wall Street Horner’s nickname is ‘The Gutter’.  “He basically buys up a company, fires everybody, puts them all out on the street. Then when the stock price goes up he sells everything off and just walks away. He’s such an a*shole. We all just love him here,” Tom Downey of  Goldman Sachs  told ABC News.  Lottery officials are still not sure what to make of the winner who matched all six numbers correctly.  “He’s a bad person”, said lottery official Tim Parkos. “I’m kind of sad that this thing is finally over. That money was growing into something really amazing. With all of that money you could feed most of the world’s starving children,   provide the homeless with new socks  , or build clean drinking water systems in every third world country. I’m pretty sure there is no God when a guy like Paul Horner becomes the winner of something this special.”  Though not everyone feels that Horner is such a bad guy. Horner’s cousin, Alex Horner, told ABC News he only has praise and good things to say about his relative.  “Yeah Paul is a good guy, no matter what most people say. Even though we grew up a few states apart we always managed to get together and hang like bros. Like this one time I was training for my high school golf tournament and got to practice at his private golf course resort in the Cayman Islands. It’s like $600 a round for the public but he was nice enough to give me the family 10% discount since I played after 3PM. He’s always looking out for the fam like that. I think its super cool he’s donating to politics and stuff, pretty noble of him.”  Sarah Bradley, founder of   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she does not agree with Horner winning the Powerball.  “That money could have gone to something great, and now it will be just wasted on some rich fat cat, the same people that are driving out the middle and lower class in this country. Maybe Horner will find it in his heart to do something that actually helps humanity. Like what we do,   giving out new socks to the homeless  . It doesn’t get any better or more rewarding than that.”  Horner’s winning ticket was purchased at a 7-Eleven store in Trenton, according to Courtney Groves with the New Jersey Lottery.  Saturday’s jackpot was the 7th largest Powerball jackpot in U.S. history. The Powerball is played in California and 43 other states, plus Washington, D.C., Puerto Rico and the U.S. Virgin Islands. Tickets cost $2 apiece, and drawings take place at 7:59 p.m. PT every Wednesday and Saturday. ", "post_date": "2016-05-10T09:00:22+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/pat-mccrory-hotline1.png", "title": "North Carolina Governor Sets Up Hotline To Report Anyone Not Using Correct Bathroom", "author": "Jimmy Rustling, ABC News", "content": " Raleigh, NC — At a press conference today,  North Carolina Gov. Pat McCrory  took further steps to ensure that his controversial bill,  HB2 , will be upheld when it comes to law enforcement. McCrory announced that his office has setup a 24-hour hotline for individuals to call if they witness someone not abiding by the new law.  “If you see a woman, who doesn’t look like a woman, using the woman’s restroom, be vigilant, call the hotline, and report that individual.” McCrory told reporters. “We need our state to unite as one if we’re going to keep our children safe from all the sexual predators and other aberrant behavior that is out there.”  Tom Downey, a spokesman for the Governor’s Office, explained the new hotline to reporters.  “Beginning today, individuals that notice any kind of gender-suspicious activity in the men’s or women’s restrooms are encouraged to call the new ‘HB2 Offender Hotline’,” Horner said. “We encourage North Carolina’s residents to take photographs and report as much detail as possible when calling. With the information gathered from this hotline, we’ll be working closely with local law enforcement agencies to make sure this law is enforced and those who break the law see jail bars. We are sending a clear message to all the transsexuals out there; their illegal actions and deviant behavior will no longer be tolerated in the state of North Carolina.”  “I applaud HB2, the offender hotline they setup and Governor Pat McCrory,” North Carolina resident Steve Jenkins told local news station  WTVD . “As a man, how would some women like it if I followed her into the restroom and just told her that everything is OK because I’m transgender? She wouldn’t like it at all, and that’s why you need a law like HB2.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News HB2 and the new hotline make no sense.  “In the history of North Carolina, not one sexually related criminal act has happened in a bathroom by  someone who is transgender . No arrests, no convictions, but they still want to make laws, just in case that “one time” ever happens. It’s like making laws outlawing marijuana in the event that someone actually ever dies from it,” Bradley said. “There were plenty of laws already in place before HB2. It doesn’t matter if you’re a man, woman, transgender, or what bathroom you use; if you’re in there longer than 5 minutes after using the restroom, someone is going to call the cops. This new law is about  people living in fear , gathering together around their weird ideologies and religious beliefs to create more intolerance and hate in this world, bottom line.”  “I don’t want my money, my taxes going towards anything that discriminates against anyone, especially in public bathrooms,” said North Carolina resident, Steven Hamilton. “I don’t care what a private individual or business does and how hate-filled they want to be, because I can protest and show as much discontent towards them as I want to, but when it comes to my money, those places better be free for all to use, no matter what sexual identity a person may identify with.” Hamilton continued, “Also, I have an eight-year-old daughter who I don’t like using the restroom by herself. What am I supposed to do now? Take her into the women’s bathroom and hope I don’t get arrested or take her with me into the men’s restroom and hope the cops don’t get called? And what if the cops show up and I don’t have my birth certificate on me? Would I actually go to jail? All of this is completely insane.”  Since Governor  Pat McCrory  signed HB2 into law last month, well over 1,000 jobs have been moved out of state, and over  400 companies ,  including Facebook, Apple ,  Paypal ,  Pyramid Country  and  StopPack , have expressed concern or anger, warning they may move or cancel plans to expand, costing the state millions of dollars. Entertainers such as  Pearl Jam ,  Ringo Starr ,  Bryan Adams ,  Bruce Springsteen  and  Cirque du Soleil  have also canceled their performances in North Carolina to boycott the law.  Pressure has been put on the NBA  to cancel the All-Star game in North Carolina next year, though as of yet,  the league is not budging . It is still unclear what kind of an economic impact these boycotts will have on the state’s economy as a whole.  NBC estimates  that North Carolina has lost  $186 million  in revenue due to boycotts so far.  To report suspicious bathroom activity, North Carolina residents can call the ‘HB2 Offender Hotline’ at 1-800-662-7952. For individuals living outside of North Carolina, please call (919) 814-2000. To file a complaint after normal business hours, call (919) 814-2050 and press option 3. ", "post_date": "2016-04-27T12:00:53+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/adam-silver-640x403.jpg", "title": "NBA Cancels 2017 All-Star Game In North Carolina Over Anti-LGBT Law", "author": "Jimmy Rustling, ABC News", "content": " Charlotte, NC — NBA Commissioner  Adam Silver  held a press conference today, announcing that Charlotte, North Carolina will no longer be hosting the 2017 All-Star game due to the state’s recent passing of the anti-LGBT law  HB2 .  “With this new law in place, Charlotte currently does not have any anti-discrimination protection in place, something that would be vital for a large event such as the All-Star Game,” Silver told reporters. “We are giving the state of North Carolina 30 days to repeal this law or they can expect the 2017 All-Star game to be held elsewhere. I want to make it clear that the NBA will not stand for this type of intolerance and hate.”  Silver’s comments come just weeks after the North Carolina legislature passed HB2, the  Public Facilities Privacy &amp; Security Act , which requires transgender people (and everyone else) to use public restrooms according to the biological sex on their birth certificate. The new law also strips North Carolina workers of the ability to sue under a state anti-discrimination law, a right that has been upheld in court since 1985.  “If you were fired because of your race, fired because of your gender, fired because of your religion,” said  Allan Freyer, head of the Workers’ Rights Project at the North Carolina Justice Center  in Raleigh, “You no longer have a basic remedy.”  Since Governor  Pat McCrory  signed HB2 into law last month, well over 1,000 jobs have been moved out of state, and over 100 companies,  including Facebook, Apple ,  Paypal ,  Pyramid Country  and  StopPack , have expressed concern or anger, warning they may move or cancel plans to expand, costing the state millions of dollars. In addition to that, by not hosting the 2017 NBA All-Star game, the state stands to lose even more. It is uncertain the exact figure, but in 2014, the  All-Star game in New Orleans   generated $106.1 Million  and in 2015, New York  generated approximately $195 million in economic activity .   On Friday, Bruce Springsteen cancelled his concert in Greensboro  because of North Carolina’s controversial new LGBT bill stating, “With deepest apologies to our dedicated fans in Greensboro, we have canceled our show scheduled for Sunday, April 10th. Some things are more important than a rock show and this fight against prejudice and bigotry — which is happening as I write — is one of them. It is the strongest means I have for raising my voice in opposition to those who continue to push us backwards instead of forwards.”  Earlier this week, a women’s advocacy group,  UltraViolet , began circulating an  online petition  urging Nike and PepsiCo — two chief sponsors of previous NBA All-Star weekends — to not support the 2017 event if it is held in Charlotte. There is also a new  campaign in North Carolina  encouraging people to  call McCrory’s office  every time they use a public restroom to  report on their compliance with the law .   North Carolina has become a fierce battleground for culture war issues.  Since the GOP captured the legislature in 2010 and the governorship in 2012 , there’s been a steady stream of conservative changes, from much stricter voter laws to looser gun laws to overhauling taxes. The legislature even considered a  proposal  to establish Christianity as the official state religion.   Marina Mangiaracina , a transgender individual, who is a journalist for  SB Nation , does not agree with the new law.  “First of all, no one carries around their birth certificate. How is a cop going to check what gender a person has on that document? Second of all, the policy of refusing to change the gender on your birth certificate until you have sex reassignment surgery is dangerous. Not all trans people need, want, or can afford sexual reassignment surgery. It’s an extremely delicate and risky procedure that  costs anywhere from $7,000 to $50,000 . Not to mention all of the missed work in the weeks of recovery. Forcing, or even encouraging transgendered people to have that surgery is sickening. If the person wants the surgery, that’s one thing. But not everybody can afford that surgery. It simply discriminates against the poor.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that the new law needs to be repealed.  “This is a ridiculous law that makes absolutely no sense,” Bradley said. “According to the law, a transgender man, a person with a vagina but has male features, such as a beard, now has to go into the women’s bathroom. Then the police get called. How exactly do they verify what’s going on there? Does the transgender man have to drop his pants or is that person required to be carrying their birth certificate at all times? And according to the idiots behind this law, it’s about stopping sexual predators. How? Is it really that hard for a man to put on a wig and a Hillary suit and go into the women’s restroom? No. This law is about bigotry, hate, intolerance and taking away human rights from the LGBT community.”  David Mikkelson, founder of Snopes.com, told ABC News that his wife Barbara is transgender.  “Stories like this have helped put my children through college, buy a new car, a home and even get the surgery my wife Barbara wanted; her name actually used to be Ted,” Mikkleson laughs, “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, look at this article we wrote about  Scientology supposedly losing its tax-exempt status . What is the name of the person or website responsible for the hoax? We claim to know it, since we list the website’s disclaimer; but no real information is there. We even go as far as saying the site that started the story spreads  malware and viruses , but we don’t say what website it is. I think warning people about a website that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but that’s a lot of work and people will click our ads regardless, bottom line; so why do the extra work?  And lots of people complain , but since we block  archive.org  it just becomes their word versus ours.” Mikkelson breaks down in tears, “Anyway, about my transgender wife Barbara; so brave.”  Paul Horner, owner of the  Phoenix Suns , told ABC News he approves of the NBA’s decision but believes more should be done.  “I applaud the NBA in taking a stand against this type of discrimination and pulling the All-Star game from Charlotte. Furthermore, I believe it’s time for  Charlotte Hornets  owner  Michael Jordan  to take a stand against this law and move the team out of that backwards state.”  At this time, unless the North Carolina legislature repeals HB2, it is unclear where the 2017 All-Star game will be held. ", "post_date": "2016-04-11T15:47:59+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/mcdonald-scottsdale-robots-640x237.png", "title": "New McDonald’s In Scottsdale Run Entirely By Robots", "author": "Jimmy Rustling, ABC News", "content": "    A McDonald’s restaurant in Scottsdale, Arizona is employing nothing but robots to run its daily operations and entire workforce. (AP Photo/Dennis System)  Scottsdale, AZ — After seeing a decline in earnings for the first time in nine years,  McDonald’s  has begun to do something no other restaurant of its kind has ever done before; open stores run entirely by robots.  The store is set to open May 1st in Scottsdale, Arizona once the state-of-the-art robot remodel is complete. The restaurant will still employ a small team of human employees to insure all of the robots are working correctly, the food and cleaning supplies remain stocked along with removing the money collected by the robots. Visitors to the restaurant will see these new robots working in harmony at a speed of 50 times faster than the average McDonald’s employee, with no chance of error. The reason for the new robot-run-store in Scottsdale is the success of their  Phoenix restaurant that opened back in July  that is also run entirely by robots.  “I just love the robots at that McDonald’s in Phoenix,” 38-year-old Brian Mullan said. “I tell the robot what I want to eat, I then put money in their little robot hands, and within minutes, a cute little robot is bringing me out my food. They’re way better than humans, plus I don’t like people to begin with. They should just burn this whole system down and rebuild, but until that happens, I sure do like the robots at McDonald’s.”  The Scottsdale store’s new manager, Peter Gibbons, told ABC News that he has worked with the robots at a product development facility in San Francisco for the last six months and speaks highly of the machines.  “These things are great! They get their work done in a fast and orderly manner, plus they don’t ask for cigarette breaks.”  37-year-old Paul Horner, a spokesman for McDonald’s told reporters that because of the demand for a $15/hr minimum wage, the company has been playing with the idea of a restaurant run entirely by robots  for years  and believes their “McRobots” are the answer.  “With the high demand for a minimum wage of $15/hr and the  protests getting worse every day , this is something we had to implement. Plus with the tremendous margin of human error, poor hygiene, lack of education, laziness, as well as the recent advancements in artificial intelligence it just make sense to automate our restaurants now rather than later.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate in Arizona with brand new socks told ABC News that she approves of a $15/hr minimum wage increase.  “We see so many homeless people that work 40 hours a week, and that is just ridiculous,” Bradley said. “I think anyone not being claimed on someone else’s taxes deserves to make at least $15/hr. Some people just don’t have the physical or mental capability to get better jobs or go to college. I think in a country as great as ours, it is just sad that there are so many adults working 40 hours a week that have to worry about putting a roof over their head and food in their belly.”  Local Phoenix resident, 52-year-old Tom Downey, who has been unemployed for the last 3 years, was excited about the opening of a nearby McDonald’s until he heard about the robots.  “Now that they hire only robots, I don’t know what I can even do. I don’t have an education, a car, and now I’m not gonna even be able to get a burger job. Just the thought of having to go to the state unemployment office and stand in line with those scumbags!”  42-year-old Milton Waddams, an unemployed fast food worker, told reporters he is extremely disappointed by the decision to employ only robots instead of humans.  “The McDonald’s had my resume, I had already completed two job interviews there and they said I was scheduled to work once the new store opened and said they would return my phone call but they never called,” Waddams said. “I need a job I said, and I was told by Betty in HR that they have my resume on file, but they never called, and Sandra told me to talk to Bill, and then I hear of the robots instead of regular humans and that’s not what I asked for. And I need the job I told them, but there’s robots, so now I’m going to have to find another place of employment. And they were big giant robots, and I said no, no robots at McDonald’s. I could set the building on fire.”  Former grill cook, Tom Smykowski, from the original Phoenix McDonald’s location before it was shutdown for robot repairs and upgrades, is still mad about losing his job.  “You know there are people in this world who don’t have to put up with all this?” Smykowski told  FOX News . “You see, that’s what you have to do. You have to use your mind and come up with some really great idea like that and you never have to work again,” but Smykowski’s friendly attitude suddenly turns to anger, “Well-well look. I already told you: I dealt with the go*damn employees so the customers would get the correct order. I have people skills; I am good at dealing with people. Can’t you understand that? What the hell is wrong with you people?”  Horner said he is excited to pave the way to a more automated workforce, hence a more reliable and affordable one.  “Robots are the future of McDonald’s in the United States and around the world,” Horner said, “Human workers want more pay and this has created giant protests which need our attention now before it is too late. Robots will decrease prices, increase productivity and make for better food.” Horner continued, “Human beings were not meant to stand and make burgers all day, filling out useless forms and listening to eight different bosses drone on about about mission statements. Now I’ve had a chance to meet with some of these robots, and boy, they are just straight shooters with upper management written all over them.”  The new robot McDonald’s will be located on the  Southwest corner of Camelback and Miller . McDonald’s says that if the store is a success, 25,000 more robot-run restaurants will be built in the next three years. It is still unclear at this time what the robots look like or how customers will complete transactions as this information is being kept under strict confidentiality, but come July these questions will be answered. Will it be the right or wrong decision for McDonald’s? In the end, it will come down to what is best for the shareholders and the customer. The employees hoping to make $15/hr so they can afford basic human needs such as shelter and food; it looks like they will have to wait in line.   If you have any further questions about the robot-run establishment, McDonanld’s has setup a 24-hour robot hotline at (785) 273-0325. ", "post_date": "2016-04-08T02:07:21+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/bill-murray-saves-life-of-c-640x320.png", "title": "Bill Murray Saves Life Of Phoenix Man By Performing Heimlich Maneuver", "author": "Jimmy Rustling, ABC News", "content": " Phoenix, AZ — In a scene straight from the movie  Groundhog Day , Bill Murray saved the life of a man who was choking while dining at a popular steakhouse in Phoenix, Arizona today.  Murray was enjoying a meal at  Meritage Steakhouse  with friends when a man three tables from him began to choke on his food.  “I saw this guy choking, so I went over and helped him out,” Murray said. “I actually learned the  Heimlich maneuver  while working on the movie Groundhog Day. I’m glad I was able to get some good use of that skill outside of the movies.” Murray continued, “I’m no hero. I just did what anyone else would have done in a situation like that.”  37-year-old, Paul Horner, told ABC News how Murray saved his life.  “I guess I just took too much of a bite of streak because suddenly I couldn’t breathe and started choking. My wife says I started to turn blue, and the next thing I know, none other than Bill Murray is giving me the Heimlich maneuver,” Horner says. “It was an amazing experience and he is such a good person. I offered to pay his tab and the party he was with, but he wouldn’t let me. He did say I could buy him a drink though, so that’s what I did. He then ate one of my french fries and told me that  no one will ever believe me . It was so surreal.”  Tom Downey, who witnessed the incident, told local news station  ABC 15  about the day’s excitement.  “This man started choking, so without hesitation, Bill Murray got up from his table, ran over to this gentleman and immediately started giving him the Heimlich. While everyone else in the restaurant was wondering what to do, Murray stepped up and saved the day. What a cool guy.”  Murray told ABC News he will be in the Valley this week staying with friends and enjoying the sites.  “This week I plan on going to a couple things with friends and tonight will probably end up at the  Tempe Improv . There’s a couple comics playing there that I’ve been wanting to see for a while now. I might tell some jokes if I feel like it, we’ll see. I really like bartending. Maybe they’ll let me do that. Regardless, it should be a fun time for everyone.”  Paramedics said the man who Murray saved is doing fine and walked away from the scene on his own accord.     ", "post_date": "2016-04-06T05:00:37+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/04/fox-lies.jpg", "title": "Twentieth Century Fox Film Corporation v. Paul Horner", "author": "Jimmy Rustling, ABC News", "content": "  RESPONSE BY PAUL HORNER   To: Twentieth Century Fox Film Corporation, Complainant &amp; National Arbitration Forum \nFrom: Private Registrant / Respondent / Paul Horner \nDate: April 4, 2016 \nRe: Domain name FOXNEWS.COM.CO \nHello friends,  Here is my response with exhibits attached. Thank you for your time and have a great day! \nBest Regards,  Paul Horner \nTel: 480-828-0740 \nnetskrillsupport@gmail.com \nBACKGROUND FACTS \nA. About Paul Horner  Paul Horner is a political satirist, writer, stand up comedian and founder of a charity that gives socks to the homeless called sockitforward.com. See Exhibit 10 and Exhibit 14.  Links to interview and info about ‘Sock It Forward’: \nhttp://ktar.com/player/?a=318283 \nhttp://ktar.com/story/853803/faith-in-humanity-group-passes-out-socks-to-phoenix-homeless/ \nThe NY Post calls Paul Horner an “online jokester” in reference to an article that was published on foxnews.com.co. See Exhibit 11. \nhttp://nypost.com/2016/01/20/someone-convinced-the-internet-that-bill-murray-is-running-for-president/  What Wikipedia says about Paul Horner writing for the parody website NationalReport.net:  “Paul Horner was the publication’s lead writer, his employment began shortly after National Report went online. Horner is an Internet news satirist and article writer for numerous online satirical news sites.” See Exhibit 12. \nSnopes says, “Paul Horner, the prolific writer and ubiquitous satirical character who inserts his name into all his articles.” \nhttp://www.snopes.com/2016/01/14/fake-news-sites/  The Washington Post calls Paul Horner, “The Internet’s most prolific hoax artist.” \nhttps://www.washingtonpost.com/news/the-intersect/wp/2014/10/21/this-is-not-an-interview-with-banksy/ \nInternational Business Times says, “Paul Horner, the world’s biggest penis and the everyman of Internet hoax history.” See Exhibit 15. \nhttp://www.ibtimes.co.uk/banksy-arrested-paul-horner-worlds-biggest-penis-everyman-internet-hoax-history-1470892  Maxim Magazine says Paul Horner’s sites are satirical and just like International Business Times, agrees that he does in fact have the biggest penis the world. See Exhibit 16. \nhttp://www.maxim.com/entertainment/yelp-south-park-hoax-2015-10 \nRed State is just one of the many, many sites on the Internet that say Paul Horner’s news sites are satire. See Exhibit 17. \nhttp://www.redstate.com/streiff/2016/03/26/corey-lewandowski-ann-coulter-punked-satire-web-site/  B. About FoxNews.com.co  FoxNews.com.co is a parody website.  The Respondent has six other parody news sites. The Respondent uses FoxNews.com.co to post articles that would be absolutely ridiculous for the real FoxNews.com to publish. The articles on FoxNews.com.co mock Fox News, making the articles &amp; website all that more hilarious, satirical and parody.  Since being registered only back on 1/13/16, FoxNews.com.co cannot be judged for its lack of content since the site is so new and the Respondent is the only author.  Besides the Respondent’s few articles, the rest of the site is just the theme which came default, filled with pages and posts in Latin (also default). Proving the point that foxnews.com.co is just ridiculous and parody, and no one, after viewing those pages in Latin would believe this is owned by a multi-billion dollar company such as Twentieth Century Fox Film Corporation.  The popular online website Reddit.com classifies articles posted by foxnews.com.co as “satire”. See Exhibit 19. \nhttps://www.reddit.com/r/atheism/comments/4bs6qn/christian_antimasturbation_mascot_arrested_for/  Respondent’s articles are written in English, or Latin on pages that came with the theme of the website as default, and the .com.co extension is from Columbia. In addition to that, according to Snopes.com, if a domain name ends with a .com.co extension at the end, it is a parody website.  Respondent’s disclaimer that is at the bottom of every page is parody. It claims that Fox News is proudly owned by Dr. Paul Horner. The complaint phone number listed, that the site encourages people to call, is for the Westboro Baptist Church. It also talks about treating those seeking help for “self-rape” and to get off the Devil’s playground with the assistance of an anti-masturbation dolphin named “Fappy”. See Exhibit 8.  Because of this, the entire site is clearly satire and covered under fair use parody laws.  1. Respondent’s SUPPOSED Infringing Activities and Bad-Faith Acts with FoxNews.com.de  Respondent responded to Complainant’s request to transfer the name on 8/5/15. See Exhibit 18.  The Complainant did not respond to the email, instead they went directly to the Registrar and took the name by force; this was told to the Respondent by 101domains.com. Fox took the domain name foxnews.com.de without permission from the Respondent. Just like FoxNews.com.co, FoxNews.com.de had content that was made up entirely of parody and satire. \n2. Complainant claims that the Respondent seeks to financially benefit from foxnews.com.co by offering to sell the Domain Name for $699 on the domain-marketplace website Sedo  Sedo listed my domain name for sale without my permission. I have never offered to sell foxnews.com.co and have no intentions to sell it in the future, with Sedo or anyone else. In fact, this problem with Sedo is so common that they list this information on their website as a common question:  Why do I see my domain listed for sale on Sedo when I have not listed it for sale? \nhttps://sedo-us1.custhelp.com/app/answers/detail/a_id/2282/~/why-do-i-see-my-domain-listed-for-sale-on-sedo-when-i-have-not-listed-it-for  I used their form to have foxnews.com.co removed from their website. See Exhibit 4.  I received a reference number #160331-001745. See Exhibit 5.  I also received email confirmation. See Exhibit 6.  On March 31st, 2016 I received email confirmation that their unauthorized listing for the sale of my domain name will be removed within 24 hours. See Exhibit 7.  Following up on March 3rd, 2016: A quick check of the page that Sedo previously had my domain name listed for sale is no longer there. Their unauthorized attempt at selling my domain name without my permission has been removed. See Exhibit 9.  3. FoxNews.com.co is protected under fair use of copyrighted works and parody laws  Parody: An imitation of the style of a particular writer, artist, or genre with deliberate exaggeration for comic effect.  Fox News and their trademark is for: \n“ENTERTAINMENT SERVICES IN THE NATURE OF TELEVISION NEWS PROGRAMMING”. See Exhibit 21.  FoxNews.com.co is an online website with articles that are satirical, mocking Fox News using parody.  The fair use of copyrighted works for purposes such as criticism or comment is not an infringement of copyright. \nThe idea of fair use reflects copyright law’s careful consideration of First Amendment principles, as fair use permits later authors “to use a previous author’s copyright to introduce new ideas or concepts to the public.”  Previous domain name and court cases won over parody:  1. CFA Properties, Inc. v. Domains By Proxy, LLC and John Selvig Case No. D2012-1618 \n2. Beck v. Eiland-Hall \n3. See eg, Elsmere Music, Inc v. National Broadcasting Co., 482 F. Supp. 741, 747 (S.D.N.Y. 1980), aff’d, 623 F.2d 252 (2d Cir. 1980) (finding Saturday Night Live’s use of “I Love Sodom” to be protected parody of “I Love New York”). \n4. Wal-Mart Stores, Inc. v. wallmartcanadasucks.com and Kenneth J. Harvey Case No. D2000-1104  In the case of Fox News Network, LLC, v. Penguin Group (USA), Inc., and Alan S. Franken, Judge Chin said the case was an easy one (siding for Franken), and chided Fox for bringing its complaint to court. The judge said, “Of course, it is ironic that a media company that should be fighting for the First Amendment is trying to undermine it.” \nhttps://en.wikipedia.org/wiki/Fox_v._Franken  4. The stories published on FoxNews.com.co are not confusing to stories FoxNews.com would publish  The Respondent believes that Fox and its website FoxNews.com are pure evil. It is the Respondent’s opinion that they are the absolute definition of dumbing down the human race, accepting the idea to not question authority, religion, a police state, spreading hate and ignorance and the worse thing that has happened to mankind since the Bubonic plague. Respondent’s website FoxNews.com.co mocks this evil incarnate with parody.  The Respondent has only owned foxnews.com.co since 1/13/16, and in that time has published articles showing proof that Ted Cruz is the Zodiac Killer, how Fox News is NOT ‘fair and balanced’ as they claim, and other stories Fox News would never publish. FoxNews.com.co cannot be judged for its lack of content since the the site is so new and the Respondent is the only author.  For April Fools day: \nhttp://foxnews.com.co/fox-fair-balanced-source-news/  The Unmasking: Ted Cruz is Definitely the Zodiac Killer \nhttp://foxnews.com.co/the-unmasking-ted-cruz-is-definitely-the-zodiac-killer/  Christian Anti-Masturbation Mascot Arrested For Public Masturbation \nhttp://foxnews.com.co/christian-anti-masturbation-mascot-arrested-public-masturbation/  5. Anything that was done with a federal court and two UDRP Panelists in the past has nothing to do with this case.  The Complainant argues that things the Respondent did 15+ years ago with Amazon and Microsoft are somehow relevant to this case.  This case is about the rights that fall under fair use parody laws. Those cases the Complainant includes in their filing has nothing to do with parody laws. With that being said, everything they say about the Respondent, those two UDRP decisions and a court ruling in federal court are irrelevant. \n6. Fox News is commonly mocked and parodied  As owner of foxnews.com.co, Respondent is not the first to be a part of a much larger group that mocks Fox News with parody for its lack of fact-checking, mixing politics and religion, its far right-wing agenda etc.  In fact, back in October of 2013, Fox News aired a story on Live television that was written by the Respondent while writing for the parody website NationalReport.net. The story was about President Barack Obama using his own money to keep a Muslim museum open during the government shutdown.  Fox Falls For Fake Story About Obama Personally Funding Muslim Museum During Shutdown \nhttp://mediamatters.org/blog/2013/10/05/fox-falls-for-fake-story-about-obama-personally/196304  Jimmy Kimmel lampoons Fox News for falling for ‘Muslim museum’ hoax \nhttp://www.rawstory.com/2013/10/kimmel-lampoons-fox-news-for-falling-for-muslim-museum-hoax/  Fox has a history of passing off satirical stories as actual news: \nhttp://mediamatters.org/blog/2011/11/01/fox-falls-for-fake-occupy-protester-quote-from/182992 \nhttp://mediamatters.org/research/2008/06/06/gullible-fox-amp-friends-escape-lawsuit-for-rep/143677 \nhttp://www.politifact.com/truth-o-meter/article/2015/feb/26/fact-checks-behind-daily-shows-50-fox-news-lies/  If the websites mentioned above are not to your liking, a simple Google search of “Fox News Lies”, “Faux News” or “Fox News sucks” will provide hundreds of other articles and websites.  7. Digital Privacy Corporation  The Complainant says the Respondent is associated with the ‘Digital Privacy Corporation’. This is the private registration that is used by 101domains.com, the company foxnews.com.co was purchased through. The Respondent has no options when it comes to private registration when buying domain names through 101domains.com.The Respondent only mentions this fact if this somehow has anything to do with the decision made by the National Arbitration Forum and the panelist deciding this case. See Exhibit 20.  CERTIFICATION \nRespondent certifies that the information contained in this response is to the best of the Respondent’s knowledge. \nREMEDIES AND REQUESTED RELIEF \nRespondent requests that the domain name FOXNEWS.COM.CO not be transferred to Twentieth Century Fox Film Corporation and the Respondent continues ownership. \nRespectfully Submitted, \nPaul Horner ", "post_date": "2016-04-04T04:27:03+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/landscape-1427898150-511606293-640x320.jpg", "title": "BREAKING: Capitol Hill Shooter Identified as Right Wing Extremist", "author": "Kip LeSale", "content": "  WASHINGTON DC  – On Monday afternoon, an extremist carried out an attack on Capitol Hill, shooting and injuring a police officer. The man has been identified as Thomas Finnigan, a white supremacist from Maryland. He has been taken into police custody, although currently Capitol Hill, including Congress and and the White House, remain on lockdown.  When the attack was carried out, Finnigan was described by eyewitnesses as trying to leave the visitor’s center, and advance further into either the library, Supreme Court, or even the White House. \n“All I heard was ‘[expletive removed] Obama! [expletive removed] liberals and ISIS! Make America great again!” John Burke, a college student visiting the visitors center stated to ABC News. “Then we heard gun shots and were immediately instructed to leave the building.”  Thomas Finnigan is a 32 year old white supremacist linked towards having a strong affinity for Republican frontrunner Donald Trump on his Facebook. He grew up in a lower class family in Tennessee, and later moved to Maryland. Not much else is known about the shooter. \n“It’s concerning, how some of our own born-and-bred American citizens are turning into terrorists over political unrest,” ABC political analyst Ana Cuddy said. “While in my own opinion, I must say I take no issue with the conservatives of the United States in general, this is not the first time a Donald Trump supporter specifically has carried out violent acts towards other members of the population. It is concerning to see how the Republican party has radicalized, and I hope the United States of America can learn its lesson from the treacherous acts Trump incites in our citizens.”   UPDATE 4:00 PM EST:  The lockdown has been lifted according to Capitol Police. \n UPDATE 4:37 PM EST:  According to Capitol Police, no officer was shot. However, two tourists were injured by shrapnel. \nABC news will continue to bring you updated news involving the Capitol Hill shooting as information comes to light. ", "post_date": "2016-03-28T12:55:21+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/fappy-sentenced.jpg", "title": "Christian Anti-Masturbation Mascot Arrested For Public Masturbation At Japanese Embassy", "author": "Jimmy Rustling, ABC News", "content": " Los Angeles, CA — In an ironic twist of a fate, a mascot for a Christian anti-masturbation organization was arrested today for masturbating in public while at a protest being held at the  Japanese Embassy  in Los Angeles, California.   Fappy The Anti-Masturbation Dolphin , whose real name is 37-year-old Paul Horner, was arrested at the  Japanese Consulate  after protesters notified police about a man running through their protest with nothing on except a dolphin mascot head while touching himself. Ironically the protest was over  Japan’s annual dolphin drive  held in the town of  Taiji that kills thousands of dolphins a year . During Horner’s arrest, it was learned he was out on work release from the  Richard J. Donovan Correctional Facility , where he is currently serving eight-years for his 4th arrest of public masturbation along with a charge of aggravated assault on a police officer.  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she was at the protest when police arrived.  “It was really weird to see a naked man fondling himself and wearing a dolphin’s mascot head while running through a group of dolphin protesters,” Bradley said. “I thought maybe it was a stunt the protesters were doing to get more attention but I guess not.”  Tom Downey with the  Los Angeles Police Department , who took Horner into custody, spoke with local news station  KABC  about the arrest.  “At first we thought he was possibly intoxicated or mentally unstable, ya know, talking about children and how deadly it is for them to masturbate. Telling us he was at the park with a Christian organization speaking to children about the dangers of masturbation. Saying things like, ‘They need to stop playing on the Devil’s playground, stop pounding their Devil stick and ringing the Devil’s doorbell’, we thought he was insane,” Downey said. “Turns out he actually was with this anti-masturbation organization who were accompanying a group of 3rd graders around the park when Horner left the children when he saw images of dolphins on the signs that these protesters were carrying. Mr. Horner said he was ‘aroused’ by all the pictures of dolphins. We further learned that Mr. Horner has four previous arrests for public masturbation, all while employed by this anti-masturbation organization.”  Horner, along with his organization,  Stop Masturbation Now , recently finished a federally funded  31-city nationwide school tour  which they claim focused on educating children about the dangers and consequences of masturbation.  Lonnie Childs who is president and founder of  Stop Masturbation Now  spoke with reporters about the future of the organization after this recent setback.  “Thanks to your tax dollars, Fappy has helped tens of thousands of children learn to live a masturbation-free lifestyle. During his countless visits to schools around the world, Fappy has collected thousands of  signatures from children  promising to never masturbate; he has done amazing things,” Childs said. “It is a shame how the media is portraying Fappy right now. Paul Horner is a great man. He is passionate about his work, he loves being Fappy and he especially loves the kids. They even have a nickname for him; they call him the tickle monster. But now, all of that is possibly ruined by some trumped-up charges by the Los Angeles five-oh, such a shame.” Childs continued, “These lies about Fappy sicken me to my very core. The employees who supposedly observed the incident in question need to be investigated. What is their motive? Are they masturbators? Are they agents of Big Masturbation?  What are their crimes ? These are the questions that must be addressed. Furthermore, we have found that, over the years, the only thing that Fappy “beats” are all the fraudulent charges brought against him. I have activated my  prayer app  and I ask that each and every one of you to keep Fappy in your prayers until this misunderstanding is resolved.”  40-year-old Phil Freedom, who was there protesting at the Japanese Embassy, witnessed the act in question.  “This man just started running around, naked, furiously masturbating and yelling something about how great Donald Trump was. He then put on this dolphin mascot head and attempted to hump one of our protest signs that had an image of a dolphin on it. It was absolutely horrifying.”  On the group’s  Facebook page , news was posted of the arrest.   “All my faithful Fappy followers, I have some extremely bad news to report. I want you to hear it here first before the liberal media hate machine and Big Masturbation spread their lies about this incident. Fappy The Anti-Masturbation Dolphin, whose real name is Paul Horner, an inmate at the Richard J. Donovan Correctional Facility, was out on work release in Los Angeles, California this morning. Fappy, as usual, was educating elementary school children about the dangers and consequences of masturbation. Somehow he got separated from the group and joined up with a dolphin protest at the Japanese Embassy there. It is “reported” by “police” that he took off his mascot costume and began running around naked while touching himself. Our lawyers tell us he is being charged with public masturbation, resisting arrest and disorderly conduct. He is currently being held at the Los Angeles Central Jail until a bond is set by a judge, this happening hopefully soon. These are obviously lies, but until we have all the information, please don’t jump to any conclusions. Please keep Fappy in your prayers during this difficult time. Praise Fappy!”   Horner’s attorney, Katie Glacier, told ABC News that the dolphin mascot is innocent of these crimes but will continue teaching masturbation prevention while in prison.  “Horner is in good spirits and patiently waiting to see a judge for his bond hearing,” Smith said. “Horner told me he is innocent, but if found guilty, says he will put an end to inmate masturbation in every jail and prison across the country, starting with the one he is currently serving time at. I personally was not aware of this information about the penal system, but it seems jail is just a hotbed for self-rape and immoral acts. Horner is a saint, a hero, a prophet, and a savior to all the lost heathenish souls out there with deadly masturbation addictions.” Glacier continued, “This may be his fifth arrest for masturbating in public, and may be currently serving an eight-year prison term for the same crimes, but that doesn’t mean he’s guilty this time. If Donald Trump was President, this wouldn’t have happened, or if it did, Fappy would be immediately pardoned. I guess at this time, all I can ask is that you please keep Fappy in your prayers during these difficult times.”  Fappy The Anti-Masturbation Dolphin and Stop Masturbation Now are federally funded programs designed to teach children about the dangers and consequences of masturbation. For more information or if you would like the group to visit your child’s school call (785) 273-0325. ", "post_date": "2016-03-22T11:00:52+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/donald-trump-legal.png", "title": "Donald Trump: “I Will Pay The Legal Fees Of My Followers Who Attack Protesters”", "author": "Jimmy Rustling, ABC News", "content": " Donald Trump has broken all kinds of norms during his presidential campaign, but today he just went to a whole new level when he announced on  Fox News  that he will pay any legal fees occurred by his supporters who get into altercations with protesters.  “I know there has been talk of me paying the legal fees of  those accused of assaulting protesters at my events  and after thinking long and hard about this matter, I’ve decided I want to go ahead and do that,” Trump said. “My followers are passionate about making this country great again and I need to support them in any way that I can. If my followers are arrested, just for being patriotic, loyal, God-fearing Americans, then I will pay their legal fees,” Trump continued. “I know it could get costly, but it’s time to take a stand against those who cannot conform to a basic set of rules, a system. And these protesters, who still live at home with their mommy and daddy, they hate America, and they hate freedom and they deserve what they get.”  Today is the first time Trump has made it official that he will indeed pay the legal fees incurred by his followers in the event of an arrest, but not the first time he has talked about the subject. In February, Trump told a crowd to  ‘knock the crap out’  of protesters and that  ‘I will pay for the legal fees’ . Then just days after  canceling a rally in Chicago due to violence , Trump said  he might pay the legal fees  of  John McGraw, 78 , who  sucker-punched  a protester at a  rally in North Carolina .  “ There used to be consequences’ for protesting ,” Trump said. “I’m not condoning violence, but what ever happened to the days when police were allowed to just do their job? I remember the  Kent State shootings . Were police out of line doing what they did there? How can I be the one to say what’s right and what’s wrong? I’d have to do more research on that.  Honestly, I’d have to look into it , it would be unfair otherwise.”  Besides the many protesters at his rallies, Trump also has them online .  On March 4th the group  Anonymous   posted a video  declaring “total war” on the  presidential candidate . It hopes to not only bring down many of Trump’s sites, but also halt his presidential bid by uncovering and exposing embarrassing information.  “We need you to shut down his campaign and sabotage his brand,” said a  Guy Fawkes-masked  individual in the video. “Your inconsistent and hateful campaign has not only shocked the United States of America, you have shocked the entire planet with your appalling actions and ideas.”  Using the hashtag,  #OpTrump , the group is asking for help on April 1st to bring down websites that belong to Trump such as, donaldjtrump.com, trump.com, trumpchicago.com, trumphotelcollection.com, donaldtrump2016online.com and citizensfortrump.com.  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News she disapproves of the Trump campaign.  “Donald Trump is bringing out the worst in the worst people. It is only a matter of time before someone gets seriously injured or killed at one of his rallies,” Bradley said. “Trump has made no attempt to correct his followers on their  racist remarks , their  bigotry  or stop any of their  violent outbursts , not once. If their was a Hitler playbook, it would be in Trump’s back pocket.”  Trump finished by saying that he will do what it takes to stop the violence at his rallies.  “These protesters think they can flip the bird and shout out whatever they want, and I’m here to say, we won’t put up with it anymore,” Trump said. “Remember the  civil rights protesters in Selma who attacked police  back in the 60’s? The police held their ground on something they believed was right, something that would keep America great. And honestly I don’t know exactly what happened there, I’d have to look into it. You wouldn’t want me to  condemn a group  that I know nothing about. But what happened to those days?”  Washington political analyst, Paul Horner, told ABC News that the problem with the violence generated by Trump’s supporters starts with Trump himself.  “This hate and ignorance has always been there, Donald Trump just gave it a place to gather and unite,” Horner said. “With  four bankruptcies ,  three wives ,  despises minorities  and the  gay community , believes  every religion is wrong  except his own; Donald Trump is the perfect Republican candidate for President.”  Trump’s campaign has set up a hotline for any of his followers who incur legal charges in the event of an arrest at (785) 273-0325. ", "post_date": "2016-03-17T07:05:59+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/scientology-640x457.png", "title": "The United States Revokes Scientology’s Tax-Exempt Status", "author": "Jimmy Rustling, ABC News", "content": " In a unanimous decision by the  Supreme Court  today, the  eight justices  ruled in favor of revoking the  Church of Scientology’s  tax-exempt status in the United States. Under the ruling, Scientology will still be able to operate as a business but no longer as a non-profit religious organization.  The case was brought forward by the  Internal Revenue Service Criminal Investigation Division  after concluding a two-year-long investigation into the inner workings of Scientology.  The investigation, along with an extensive audit, found the group to be a “criminal operation with a sole purpose of making money”. The eight justices agreed with the IRS and its findings that Scientology was neither  a religion  or fell under the guidelines of a  non-profit charitable organization . \n    CI Special Agent , Tom Downey, worked closely with  IRS Chief Counsel Criminal Tax Attorneys  during the course of the investigation.  “If private schools had similar prices to the  courses in Scientology , students would receive the absolute highest level of education by the top educators in the country,” Downey said. “But in reality, based on the ridiculously high  cost of Scientology , there is no school out there that even exists. The best schools in this country charge a fraction of the exorbitant amounts of money that Scientology charges its members.”  Paul Horner, a spokesperson for Scientology, told ABC News the ruling is “discrimination based on religious beliefs”.  “In a free country, such as ours, it amazes me that  over ten million Scientologists  can have their beliefs trampled on like this,” Horner said. “The Church of Scientology is working hard to make this world a better place, constructing more  buildings  and  ships  and other  really neat stuff , and now, most of that will have to be put on hold because of a few religious bigots.”  For years, Scientology’s claim of ten million followers has been  widely disputed . In 2011, former editor, and longtime Scientology foe,  Tony Ortega , wrote the following in  The Village Voice :  “According to the  latest survey , the total number of people who identify as Scientologists is just 25,000 in this country of more than 300 million human beings.”  Scientology  teaches  that  75 million years ago an evil galactic overlord named Xenu , ruler of a  Galactic Confederacy , decided to tackle overpopulation by rounding up 13.5 trillion people in  DC-8 -like spacecraft, flying them to Earth (then known as  Teegeeack ), dropping them in the volcanoes of Hawaii and vaporizing them with  hydrogen bombs .  Their spirits, known as  thetans , attached themselves to humans at the dawn of man, and according to Scientology founder  L. Ron Hubbard  is the root cause of all our fears, confusion and problems. For humans to reach a  clear state , thetans must be removed from the body through therapy sessions, known within Scientology as  auditing .  Scientology adherents must work through  eight stages  of auditing over a period of many years to reach this clear state, each of which costs thousands of dollars to partake in. It was these costs that the court  took issue with , ruling that they far outstrip average course fees for educational establishments.  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks, told ABC News she lost her family because of  Scientology’s disconnection policy .  “I was born into Scientology,” Bradley said. “When I turned seventeen I began to question some of their beliefs. My family, who are all members, told me to stay quiet, but it was too late and I was  excommunicated  from the church. Scientology’s upper management told me I was no longer able to see or talk to my family ever again,” Bradley said. “It broke my heart, I couldn’t even say goodbye to them. They were told by Scientology if they had any communication with me that they would be excommunicated too. My family chose Scientology over me.” Holding back tears Bradley says, “I just hope my family is proud of me, all that I’m doing with my life and everything I’m doing to  help the homeless . I wish more than anything to see them one day; I love and miss them so much.”  Downey told reporters that Scientology spends tens of millions of dollars every year doing what no other religious non-profit organization does.  “The money is used to  harass former members ,  coerce abortions , to  secure their International base so people can’t escape ,  child abuse , forcing members to  disconnect  from  family and friends who aren’t Scientologist friendly , and to  litigate  to death anyone who opposes them,” Downey said. “Years ago, the  Cult Awareness Network  was an organization that provided information on groups that it considered to be cults. After years of litigation with Scientology and being forced into bankruptcy, it is now a Scientology run enterprise. Over the years Scientology has also put many  government officials and politicians  in their pocket.”  For years, the Church of Scientology often pointed to their tax-exempt status as proof that it is a recognized religious entity in the United States. And there’s no disputing that tax-exempt status has been a huge boon to the Scientology industry. With  such few members , but  billions in real estate holdings , the Church of Scientology has been called “the most famous small business in the world,” with its tax exempt status saving the Church  an estimated $20 million a year on property taxes alone .  Roberto Sigmond of  Amnesty International  told ABC News that revoking the Church of Scientology’s tax-exempt status in the United States is a huge win.  “From all the  deaths Scientology has caused  over the years to its  phony drug rehabilitation program , this is a great day for anyone that believes in human rights.”  After originally being recognized as a  tax-exempt religious organization in 1957 , Scientology’s tax-exempt status was lost in a 1967  IRS  audit. As part of the effort to regain  tax exemption  during the late 1970s, Scientologists repeatedly infiltrated the IRS, copying large numbers of documents and at one point placing an electronic bugging device in an IRS conference room. These actions took place within a program code-named  Operation Snow White . Eleven high-ranking Scientologists, including Hubbard’s wife  Mary Sue Hubbard , were sentenced to time in prison for acts surrounding this operation. L. Ron Hubbard himself was named as an unindicted co-conspirator as investigators could not link him to the crimes.  The United States is not the first country to revoke Scientology’s tax exemption. In October of last year,  a Dutch court revoked Scientology’s status  as a “public welfare institution” and the tax exemption that goes along with it.  Janine Pieters, reporting in the   NL Times ,  said the court ruled that sales of Scientology’s courses and therapy sessions are aimed at profit-making and that it does not therefore belong on the tax authorities charity list.  Beginning April 6th, 2016, The Church of Scientology will no longer receive tax exemption in the United States. Attorneys for Scientology have 30 days to appeal the case, although it is not yet clear whether they will or not.   UPDATE 4/28/16:  The Church of Scientology has regained their tax-exempt status within the United States.   Contact your local Representative to complain and have it removed  . ", "post_date": "2016-03-13T09:10:32+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/bribe.png", "title": "Senators Whine About FCC’s 25 Mbps Broadband Standard, Insist Nobody Needs That Much Bandwidth", "author": "Jimmy Rustling, ABC News", "content": " All six of the senators that complained to the FCC about lowering their 25 Mbps broadband standard are in the pockets of one or more internet service provider (ISP). The ISP’s want a lower broadband standard to increase profits so they hire senators to complain to the FCC for them. It is absolutely fucking insane this corruption is allowed to happen. These are BRIBES given to evil, greedy assholes, who care nothing about the people that elected them; they only care about the money. And no one does anything to stop this; people just keep reelecting these unethical, immoral motherfuckers year after year after year.   The letter complaining to the FCC about their 25Mbps broadband standard was signed by:    Roy Blunt (Mo.)  \n Steve Daines (Mont.)  \n Deb Fischer (Neb.)  \n Cory Gardner (Colo.)  \n Ron Johnson (Wis.)  \n Roger Wicker (Miss.)     What money they receive and from who:    Roy Blunt (R-MO): $55,700 from Comcast, $26,000 from AT&amp;T, $21,500 from Verizon \nContact:  https://www.blunt.senate.gov/public/index.cfm/contact-roy   Steven Daines (R-MT): $15,000 from AT&amp;T, $13,500 from Comcast, $13,000 from DirecTV (now AT&amp;T) \nContact:  http://www.daines.senate.gov/connect/email-steve   Deb Fischer (R-NE): $20,000 from Deutsche Telekom (T-mobile); $16,000 from National Cable &amp; Telecommunications Assn; $15,250 from Comcast; $15,000 from AT&amp;T; $13,750 from Cox Enterprises; $13,000 from Verizon; $9,500 from National Telecommunications; Cooperative Assn; $9,150 from CenturyLink; $7,500 from Cellular Telecom &amp; Internet Assn \nContact:  http://www.fischer.senate.gov/public/index.cfm/contact   Deb Fisher has a “Stand Up For Life” quote on her homepage LOL  Cory Gardner (R-CO): $ 27,600 from CenturyLink; $23,000 from National Cable &amp; Telecommunications Assn; $23,000 from AT&amp;T; $20,500 from DirecTV (now AT&amp;T); $18,350 from Comcast; $16,500 from tw telecom. \nContact:  http://gardnerforco.wpengine.com/contact-us/   Ron Johnson (R-WI): $15,000 from Verizon; $10,000 from National Cable &amp; Telecommunications Assn; $10,000 from AT&amp;T \nContact:  https://www.ronjohnson.senate.gov/public/index.cfm/email-the-senator   Roger Wicker (R-MS): $36,500 from Cox Enterprises; $32,500 from Comcast; $27,000 from National Cable &amp; Telecommunications Assn; $17,000 from AT&amp;T; $11,500 from Verizon; $10,500 from Deutsche Telekom (T-Mobile); $10,000 from Time Warner Cable \nContact:  https://www.wicker.senate.gov/public/index.cfm/contact      The following is the story from TechDirt     Just about a year ago, the FCC  voted to raise  the base definition of broadband from 4 Mbps downstream, 1 Mbps upstream — to 25 Mbps downstream, 3 Mbps upstream. This, of course, annoyed the nation’s mega providers, since the higher standard highlights the lack of competition and next-generation upgrades in countless markets. It especially annoyed the nation’s phone companies, given that the expensive, sub-6 Mbps DSL foisted upon millions of customers can no longer even technically be called broadband.  Fast forward a year and the broadband providers’ favorite politicians in the House are  still whining about the improved definition . In a  letter sent to the FCC last week  (pdf), the six senators complained that the FCC is on a mad power grab, using a crazy and arbitrary new definition to saddle broadband providers with all manner of onerous regulations. Besides, argued the six Senators, 25 Mbps is more than any American consumer could ever possibly need:   “Looking at the market for broadband applications, we are aware of few applications that require download speeds of 25 Mbps. Netflix, for example, recommends a download speed of 5 Mbps to receive high-definition streaming video, and Amazon recommends a speed of 3.5 Mbps. In addition, according to the FCC’s own data, the majority of Americans who can purchase 25 Mbps choose not to.”   Focusing on the fact that a single Netflix stream eats just 3.5 to 5 Mbps ignores the fact that broadband connections serve  an entire house of hungry users , many of whom will be gobbling significantly more bandwidth using any number of services and connected devices. It’s also worth pointing out that  a single Netflix Ultra HD stream  can eat 25 Mbps all by itself. And on the upstream side of the equation, the FCC’s definition of 3 Mbps remains relatively last-generation and arguably pathetic. Similarly, many consumers may not buy 25 Mbps because the lack of competition can result in high prices for faster tiers.  In other words, claiming 25 Mbps is some kind of “arbitrary,” pie-in-the-sky standard is absurd.  Of course, the Senators don’t really care about technical specifics, they’re just blindly echoing the broadband industry’s annoyance that the FCC is now actually highlighting the lack of broadband competition in the market. They’re specifically bothered by  this recent FCC study , which notes that  two-thirds of U.S. households  lack the choice of more than one ISP at speeds of 25 Mbps or greater. Companies like AT&amp;T and Verizon also don’t like how this data highlights the fact they’re giving up on rural America and many second- and third-tier cities, freezing broadband deployments and in some cases even  refusing to repair  aging infrastructure.  And while it’s certainly true the higher standard helps prop up the FCC’s Congressional mandate to ensure quality broadband is deployed in a “reasonable and timely” basis (and by proxy its  Title II  reclassification), a lot of the FCC’s efforts have quietly involved eliminating regulation, ranging from streamlining tower placement and pole attachment regulations, to eliminating the kind of  awful state level protectionist laws  that keep municipal and public/private broadband networks from taking root in incumbent duopolist territories.  At the end of the day, incumbent providers and the politicians who love them are simply annoyed that the FCC has any standards whatsoever, since that makes it immeasurably harder to  pretend  that the nation’s broadband competition and connectivity issues don’t exist.    The complaint letter to the FCC:   \n     Note from the author: I was tagging this article as “Republican”. Then I realized that I actually didn’t know what party these six senators were affiliated with, I was just assuming Republican. So I checked, and I was right. Then I laughed. Then I felt sad about this reality.  UPDATE 3/2/16 \nI just got a response from Senator Ron Johnson about Net Neutrality. This sentence was in the email: “The term “net neutrality” might sound good, but it is just a clever name for government control of the Internet.”  The whole email is bullshit, but that sentence above made me sick. He’s using it to manipulate people while getting paid (bribed) by ISP’s to push their agenda thru, attempting to silence free speech. This person has lost all his morals years ago and is nothing but a greedy, evil, shill for whoever can pay him the most money…. and he’ll probably get re-elected again by the same people who he does not serve.  ========== \nDear Mr. Horner,  Thank you for contacting me regarding the issue of net neutrality.  On February 26, 2015, unelected bureaucrats at the Federal Communications Commission (FCC) voted 3-2 to impose heavy-handed regulations known as net neutrality on the Internet. The term “net neutrality” might sound good, but it is just a clever name for government control of the Internet.  Since the Clinton administration, the FCC has wisely applied a light regulatory touch to broadband services, resulting in a highly successful broadband industry. The FCC reversed that bipartisan policy decision after consulting with outside interests rather than Congress. The decision is wrong, and the process raises serious questions about the president’s inappropriate influence over what is supposed to be an independent agency overseen by Congress.  Thank you again for contacting my office. It is very helpful to hear the views of the constituents I serve. To date, my office has received more than 1,800,000 letters, emails and phone calls. My mission is to provide information to as many people as possible concerning the enormous financial and cultural challenges facing America.  Please see my website at www.ronjohnson.senate.gov for additional information. It is an honor representing you and all the people of Wisconsin.  Sincerely,  Ron Johnson United States Senator ", "post_date": "2016-03-02T10:56:37+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/02/bill-murray-stops-robber-640x365.png", "title": "Bill Murray Unwittingly Breaks Up Bank Robbery In Phoenix Arizona", "author": "Jimmy Rustling, ABC News", "content": " Phoenix, AZ — A bank robber was apprehended in Phoenix today after stopping to talk with none other than actor  Bill Murray .  Phoenix Police Chief Tom Downey spoke with local news station  ABC15  about the incident.  “The man we currently have in custody apparently had just robbed a Bank of America ATM machine, ran out, saw Mr. Murray walking on the sidewalk and stopped to talk to him. That’s when Phoenix Police were able to apprehend the suspect.”  Bill Murray, who is in town visiting friends, told ABC News about the incident.  “I saw this man on the sidewalk running towards me with a bag in his hand. Then he suddenly stopped when he saw me. He asked me if I was the zombie  Bill Murray  from  Zombieland . I told him, ‘sure, why not’. Then he started telling me how much he loved me, and how that was his favorite movie. I was polite, I told him that was very nice of him to say. Then kind of out of nowhere, police showed up and tackled the man,” Murray said. “Some people might call me a hero, but I’m no hero. The real heroes today are the men and women of the Phoenix Police Department.”  37-year-old Phoenix resident Paul Horner was at the ATM when the robbery occurred.  “I was just standing behind this guy waiting my turn when suddenly he starts busting in the ATM with all these tools,” Horner said. “He gets the ATM open and fills a bag up with whatever cash was in the machine, then he runs out the door and down the street. It happened so fast for me to be scared or even get shaken up about it. Though what I am shaken up about is that Bill Murray is the one who stopped this guy and I didn’t get a chance to meet him.” Horner continued, “Bill Murray is my personal hero and today he was an actual hero for the city of Phoenix. What  can’t  that living legend do?”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she isn’t surprised by Murray’s heroics.  “Bill Murray is always doing something amazing,” Bradley said. “I actually met Mr. Murray a while back when we were starting our cause that gives new socks to the homeless. Bill  made a donation right there on the spot , saying what we were doing was incredible; he’s such a great guy. He truly cares about people and making the world a better place.”  Murray told ABC News he will be in the Valley this week staying with friends and enjoying the sites.  “This week I plan on going to a couple things with friends and then on Wednesday will probably end up at the  Tempe Improv . There’s a couple comics playing there that night that I’ve been wanting to see for a while now. I might tell some jokes if I feel like it, we’ll see. I really like bartending. Maybe they’ll let me do that. Regardless, it should be a fun time for everyone.”  The robber, whose name has not yet been released, was apprehended and taken into police custody. On his person police found a gun and a bag filled with an undisclosed amount of money. ", "post_date": "2016-03-01T05:00:52+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/02/bill-murray-president-640x371.png", "title": "Bill Murray Kicks Off Presidential Campaign In South Carolina With A Bang", "author": "Jimmy Rustling, ABC News", "content": " Charleston, SC — Just one day after the  Democratic Primary , legendary actor, comedian, and writer,  Bill Murray , brought his  newly announced Presidential campaign  to Charleston, South Carolina, speaking to an estimated crowd of over 100,000 cheering fans and supporters.  “Hello South Carolina! Are you ready to get weird or what?” Murray said to the roaring crowd.  Murray’s speech, which lasted a little more than an hour, touched on many issues from his campaign, including increased wages, health care, the cost of higher education and human rights in general. The rally also included wine tasting and stages where the people in attendance were allowed to sing karaoke.  “I saw the  Republican debate  the other night and it made me sick to my stomach,” Murray told the crowd. “Here are grown men, candidates running for President of the United States, and they’re acting like 4-year-olds. They’re up there on stage, broadcasted to the entire world,  calling each other names, interrupting each other , making complete fools of themselves and I just thought to myself; I think the American people deserve better than this. I know we deserve better than this because we are better than this.”  Political analyst, Paul Horner, told ABC News he has taken an extreme interest in what Murray is doing since he  announced his run for President  just a little more than a week ago.  “I don’t know if Bill Murray is really running for President or if he’s just having some fun, but the man is making some excellent points out there. He’s getting people to think about the state their country is in right now and making a lot of people happy while doing it. I applaud Mr. Murray for what he’s doing.”  “I pretty much don’t like any of the candidates that are running for President right now,” Murray told the crowd, “I think Bernie Sanders seems like a decent guy, but the rest of em’, are pretty much complete pond scum in my opinion.” Murray continued, “I’m always traveling around the world, but I’m proud to call America, the good ole’ U.S. of A, my home. I think there’s a lot of great people here, a lot of potential, but there’s also a lot of confusion and hate right now. People don’t know what to make of these Hitler wanna-be’s like  Donald Trump , and the  Ted Cruz’s , who want to start World War III. They feed on the hate and paranoia a lot of this country has, and because of that, you see them leading in the polls. And it’s sad that people go along with it, and can’t see it for what it really is.”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she fully supports Murray and his run for President.  “We need a new face in Washington. Someone who has no political ties or agenda and can’t be bought,” Bradley said. “I actually met Bill Murray a while back when we were starting our cause that gives new socks to the homeless. Bill  made a donation right there on the spot , saying what we were doing was amazing; he’s such a great guy. He truly cares about people and making the world a better place.”  Murray finished the rally by saying, “I’m no hero, I just want to help out, and I hope you all choose to stand behind me, or beside me, or wherever is comfortable for you, but just as long as it’s with me. Look, we don’t need to make America great again, because it already is; we all just need to try a little bit harder and have more love in our hearts for our fellow man. I think if you can take care of yourself and then maybe take care of someone else then that’s sort of how you’re supposed to live. Lets all help each other make this the best life experience possible!”  Murray still has yet to announce if he will be running as an Republican, Democrat or Independent.  David Mikkelson, founder of Snopes, a website that takes the fun out of stories on the internet in order to generate advertising revenue, told ABC News that he approves of what a story like this is accomplishing.  “This type of story, when it goes viral, and we debunk it, we make money,” Mikkelson said. “The secret behind a good Snopes article is a formula that we have used since day one, it’s actually quite simple. First, we start with the same cookie-cutter outline we use for every site that we debunk. Next, we copy and paste parts of the original article into ours. After that, one of our “writers” will type one or two sentences that talk about the content we just copy and pasted. And now, last but not least, we slap a title on there similar to the article’s headline that we’re debunking. This way it will show up at the top of Google for anyone searching for that story, and that’s it! Then we just sit back and let the money roll in. We are the absolute definition of  clickbait ! I’ll tell what, if it wasn’t for great writers like Internet news satirist  Paul Horner , putting out the stories that he does, my children wouldn’t have been able to go to college.” Holding back tears, Mikkelson finishes by saying, “Though we are currently being sued by  Fox News for calling them a “fake news site” , so lets just hope Paul Horner writes another story soon.”  Murray’s campaign team told reporters their next stop is the  Arizona State Capitol  on March 2nd and then the  Tempe Improv  later that night. It is rumored Murray will be at the Improv meeting with locals and telling a few jokes.  Tickets to that show are only $10 . ", "post_date": "2016-02-28T06:45:04+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/02/e8zz3uzochqohsnt1z5q-640x360.jpg", "title": "The Unmasking: Ted Cruz is Definitely the Zodiac Killer", "author": "Kip LeSale", "content": " The Internet is the international online truth machine, and no matter how much the government may try to cover up massive conspiracies, the internet manages to find the truth. People in positions of prominence and authority are the most likely to be involved in such schemes, and as a result, have their secrets uncovered by diligent internet citizens. As such, Ted Cruz, a junior senator from Texas and candidate for the Republican nomination has become the center of a particularly enthralling and convincing conspiracy. We will state it simply:  Ted Cruz is definitely the Zodiac Killer.  Most people know quite a bit about the Zodiac Killer, without ever uncovering who he was. He committed a series of killings in the Bay Area of California about forty years ago – resulting in up to three dozen killings – after which the killer, presumed to be Ted Cruz, sent letters to California including a coded message.  The messages were coded with symbols, forming what is called a “cipher”. A cipher is something like this:   dtz itsy sjji yt yjqq rj ymfy ymnx fwynhqj bfx f izrg bfxyj tk ynrj fx n fr fbfwj   These notes, coded and uncoded, went on for years. The killer was never identified.  Until now.  So how did this come back to Cruz? Simply put, various online internet sleuths.  The Daily Dot, which is to Internet happenings as News Examiner is to reliable news, traced the origin of the Ted Cruz is the Zodiac Killer theory back to 2013 with the following tweet:   #CPAC  Alert: Ted Cruz is speaking!! His speech is titled: ‘This Is The Zodiac Speaking’  — Red Pill America (@RedPillAmerica)  March 14, 2013   Public Policy Polling, a left leaning polling firm was convinced by Twitter users to let the truth come to light by including their question on the end of their Florida poll.  In this poll, nearly 40% of Floridians believe that there is at least some possibility that Ted Cruz could be the Zodiac Killer. Soon, Snopes, a website definitely bought out by the government to prevent the truth from coming to light, will likely write an article debunking this theory. Do not believe them.    \n 1) They look scary alike \n            The resemblance is uncanny, perhaps besides the portrayal of the Zodiac wearing eyeglasses. The lips, the hairline, and the ears are incredibly similar. Even the chin and facial shape are disgustingly similar. Unfortunately, the person who originally made the Zodiac sketch was probably too high to include Cruz’s signature eyebrows. Not only that, but it’s well established that Cruz has an unsettling facial expression, making it look like he is permanently in a state of disgust, especially when he smiles. It’s not difficult to deduce – something is clearly bothering him in the back of his mind.    \n 2) His name appears in at least one encryption \n            Of course, the most difficult codes to solve would be the ones that give away the identity of the killer. As well, the first 25 characters are able to be decoded to say “I, TED CRUZ, AM THE ZODIAC KILLER”.    \n 3) His campaign logo is a cryptic anagram \n            Enough said.    \nSites like The Washington Post claim there’s no way he could have committed the murders due to him being too young at the time of the murders. Unfortunately, those websites are easily paid off to ignore the existence of reptilians. I must ask, why would Ted Cruz’s campaign slogan be “TrusTed” if he didn’t have a scaly secret?    \n 5) He hasn’t denied it \n    \n    \nAnd let me reiterate… Look at that disgusted smile.    \nWant to continue to expose Cruz, AKA Zodiac, while helping the women he screwed over in his home state? Buy a rad as frick t-shirt  HERE ! ", "post_date": "2016-02-26T07:53:32+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/02/executive-order-obama.png", "title": "Obama Signs Executive Order: Appoints Rashad Hussain As New Supreme Court Justice", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON — Just two days after the  funeral  for the late  Supreme Court Justice Antonin Scalia , who died last week of a heart attack at the age of 79,  President Obama  signed Executive Order 14651, which appoints  Rashad Hussain  as the new Supreme Court Justice to replace Scalia.  “We cannot wait for a new President or the Senate Republicans to fill this vacancy left by Scalia, so I have taken it upon myself to do what needed to be done,” Obama told reporters at a press conference today. “Republican Senators believe that it is appropriate not to act on such an important matter, and as I have shown today, I do not agree with that.”  Hussain, of Muslim heritage, is an attorney who has served as US Special Envoy to the  Organization of Islamic Cooperation  (OIC), the second largest intergovernmental body after the UN, and as US Special Envoy for Strategic Counterterrorism Communications. Hussain has also served in the White House Counsel’s Office and on the National Security Council as a political appointee of the Obama Administration.  Even though under the Constitution, it is the President’s job to nominate Supreme Court justices, Obama’s selection is already drawing sharp criticism from Republicans. Presidential hopeful  Donald Trump  told ABC News that he does not agree with the President’s decision.”  “Hussain is a Muslim and a sympathizer, just like Obama, and now he takes over the legacy the great Antonin Scalia left behind. The President should be ashamed of himself.”  “The American people should have had a voice in the selection of their next Supreme Court justice,”  Senate Majority Leader Mitch McConnell  (R-Ky.) said. “Appointing a Muslim to replace Scalia is absolutely appalling.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she fully supports Obama’s decision.  “We needed someone in there to fill that spot as quickly as possible,” Bradley said. “Regardless if you agree with Obama’s appointed choice of Hussain, Scalia was a disgrace to the Supreme Court. He was a  religious radical ,  a bigot ,  a racist ,  against women’s rights ,  gay rights  and  human rights in general ; there’s absolutely no reason a person like that should have ever had power like that in the first place. He will always be remembered as being on the wrong side of history.”  David Mikkelson, founder of Snopes, a website that takes the fun out of stories on the internet in order to generate advertising revenue, who is also currently being sued by  Fox News for calling them a “fake news site” , told ABC News that he approves of what a story like this is accomplishing.  “This type of story, when it goes viral, and we debunk it, we make money,” Mikkelson said. “We use our cookie-cutter outlines, we copy and paste the original article into ours, type in one or two sentences of original content and then we make hella cash. If it wasn’t for people like Internet news satirist  Paul Horner , my children wouldn’t have been able to go to college.”  Legal experts believe Republicans will attempt to block Obama’s appointee until he’s out of office, leaving the court with a gaping vacant seat for nearly a year.  “Obama has a right to do what he did, but we’ll fight him to the end on this,” Tom Downey of the  Republican National Lawyers Association  told reporters. “This will not stand, ya know, this aggression will not stand, man.” ", "post_date": "2016-02-23T09:10:05+00:00"},
{"image_url": "http://abcnews.com.co/wp-content/uploads/2016/02/fox-news-vs-snopes-640x390.png", "title": "Fox News Sues Snopes For $20 Million Over Story Calling Them A ‘Fake News Site’", "author": "Jimmy Rustling, ABC News", "content": " San Francisco, CA — Today,  Fox News Channel  filed a $20 million dollar lawsuit against  Snopes.com . In the lawsuit, Fox is seeking damages caused by an article Snopes published which called the media giant “ clickbait ” and a “fake news site”.  The Snopes article at the center of the $20 million lawsuit, titled “TRUE: Fox Is A Fake News Site Promoting Fear &amp; Paranoia Through Their Echo Chamber Of Hate &amp; Ignorance”, which has since has been removed, is shown here in a screen shot that has been posted on various social media websites:     Tom Downey, who is a spokesman for Fox News, spoke with ABC News about details of the lawsuit.  “The Fox News Channel, along with its millions of loyal followers, rely on us heavily, for fair and balanced reporting of events from around the world. The article on Snopes was in extremely bad taste and not funny whatsoever. To say our followers live in an echo chamber of hate and ignorance, and are nothing but a bunch of old, white, bigoted, racists is beyond ridiculous. To say we bring out the worst in the worst people is the definition of libel and slander. We couldn’t have the word “news” in “Fox News”, unless we were a real news outlet and not “fake news” like Snopes has claimed us to be. I believe any reasonable court in America will agree with the lawsuit and rule in our favor.”  Snopes, a website that debunks stories on the internet in order to generate traffic and advertising revenue, told ABC News they are confident in winning the suit.  “Clickbait is defined as web content that is aimed at generating online advertising revenue, especially at the expense of quality or accuracy, relying on sensationalist headlines to attract click-throughs and to encourage forwarding of the material over online social networks. Well, in that case, technically, any story on the internet that has a clickable headline and ads within their article could be considered clickbait,” Snopes founder David Mikkelson said. “Personally I don’t know why Fox is so mad about about us calling them clickbait. I mean, under the definition of clickbait, our website is clickbait. 99% of the internet is clickbait. I think the only sites out there that you couldn’t call clickbait are those not serving up any kind of ads. And as for Fox claiming not to be “fake news”, I think 99% of the internet, that same 99% that is clickbait, would agree with us on that one.”   Paul Horner ,  who Snopes calls , “The prolific writer and ubiquitous satirical character who inserts his name into all his articles,” said he has mixed emotions about the lawsuit.  “Fox News is pure evil, but I don’t blame them for suing Snopes. They call my articles “fake news” and “clickbait” all the time,” Horner said. “Throughout the years, I can’t even imagine how much money I’ve made Snopes because of all the articles they have written about me, my stories and my websites. Seriously,  four of my recent stories have been featured on Snopes in the last 6 days alone . With all the money I make them, I’ve probably put at least a couple of their kids through college by now. And do I even get a Christmas card or even a thank you? No. Well, you’re welcome Snopes. Just remember, I pay your salary.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she agrees with Snopes and is sickened by Fox News and their coverage of the media.  “If it’s a story that will scare people or make them angry, Fox News covers it,” Bradley said. “They exaggerate the truth so it fits their agenda of imprisoning minds with fear and hate. They make racism and bigotry worse in this country instead of covering real news stories, something positive, like what we are doing to help the homeless.” Bradly continued, “Fox News only covers how much of a burden the homeless are. Why not try and help them? By helping them, they become less of a burden on the tax payers of this country, there’s less crime and you’re also helping out your fellow man instead of being selfish and only looking out for yourself. Also, I sincerely want to thank everyone that has supported our cause in giving new socks to the homeless, it means so much! Please,   give what you can  .”  Harvard law professor, Erick Biez, believes Fox News will lose the $20 million lawsuit.  “It is of my personal opinion that this case falls under fair use laws protected by freedom of speech and using parody to deliver its message,” Biez said. “Though, if I was Snopes I would still be worried. They’ve made a lot of enemies over the years and it was only a matter of time before something like this happened.”  The $20 million lawsuit was filed at the  Superior Court of California  with opening arguments beginning March 15th. ", "post_date": "2016-02-22T07:00:41+00:00"}
]