[
{"post_date": "2016-11-03T12:30:37+00:00", "author": "Jimmy Rustling, ABC News", "content": " COLUMBUS, OH  (AP)  — History was made today in Columbus, Ohio when more than 3 million Amish poured into the city to see the American Amish Brotherhood (AAB), an organization which acts as an informal governing body for the Amish community, endorse Donald Trump for president. That number represents a significant portion of the total Amish population, which the United States Census Bureau says numbers more than 20 million men and women nationwide all pledging their vote to Trump for President. With the full force of the Amish community behind him, Donald Trump is now mathematically guaranteed to win the presidency in November.  The organization typically meets once a year and the meetings usually consist of about 300 Amish leaders who meet to discuss the challenges, such as urban sprawl, that face the community. This year, however, the organization wanted as many people in attendance as possible so they can effectively instruct all Amish men and women of legal voting age to cast their vote for the flamboyant Republican nominee.  The  Amish , who are direct descendants of the protestant reformation sect known as the Anabaptists, have typically stayed out of politics in the past. As a general rule, they don’t vote, serve in the military, or engage in any other displays of patriotism. This year, however, the AAB has said that it is imperative that they get involved in the democratic process.  “Over the past eight years, the Democratic Party has launched a systematic assault on biblical virtues,” said AAB Chairman Elijah Fisher. “We have seen more and more Christians being persecuted for their faith; we have seen the state defile the institution of marriage allowing the homogays to come together just like normal people. And now, they want to put a woman in the nation’s highest leadership role in direct violation of my favorite Bible passage,  1 Timothy 2:12 , ‘I do not permit a woman to teach or to assume authority over a man; she must be quiet’.” Fisher continued, “We need to stop this assault on God and take a stand for biblical principles. Donald Trump has shown in both action and deed that he is committed to restoring this country to the Lord’s way.”  According to statistician Nate Silver of the website fivethirtyeight.com, there are no possible scenarios in which Hillary Clinton can win with Donald Trump carrying the Amish vote.  “The Amish have their highest numbers in perennial swing states like Pennsylvania, Virginia, Ohio, Indiana, and Iowa,” Silver noted. “They also have strong numbers in reliably Democratic states like Michigan, Illinois, and New York, meaning that Hillary will lose those states as well. There is also a sizeable community in Florida which, while not as large as it is in the Midwest, is still large enough to turn Florida for Trump. Over the next two weeks, you can expect Hillary to enter into a state of freefall in all of my predictive models.”  37-year-old Paul Horner, a self-proclaimed “Donald Trump supporter since day one” told Leilani Hernandez, a reporter with local Columbus news station  WBNS-10TV  he is thrilled that Trump will be the next President.  “This is such great news, a Trump victory, I knew it would happen, I have been praying for it night and day,” Horner said. “Plus I work November 8th and it was going to be tough for me to get off work and vote because my boss is not the nicest of people. But now thanks to the great Amish people of this country, they have this thing locked up for a Donald Trump victory against crooked Hillary and I won’t have to miss work! God is good!”  The Clinton campaign issued a written statement to the AAB asking them to reconsider their decision.  “I don’t believe that Donald Trump is the person who best represents your interests,” Clinton wrote to the AAB. “As a career real estate developer, he represents a clear threat to your simple way of life. As former first lady of Arkansas, I understand the concerns of rural Americans more than any candidate in this election. I implore you to consider all of the facts before voting for my opponent.”  Most pundits believe that Mrs. Clinton’s plea is too little too late.  During a press conference in Manhattan early this morning, Trump thanked the AAB for their support and promised to put the Amish to work maintaining government buildings, which he said would save taxpayers millions because “the Amish do great work, the best work, for a very low price.”  Though Clinton has pledged to stay in the race until the very end, many of her campaign workers have already resigned. According to the  Associated Press , it is expected that the Clinton campaign will lose 50% of its staff within the next week. There is a general mood of hopelessness and despair in the Clinton camp, and many simply want to cut their losses.  “It looked like she was going to win this election easily,” said Tom Downey, a campaign manager in Ohio, “But this is what happens when you wake a sleeping giant. Clearly, Mrs. Clinton took far too much for granted in this race, and we are all now paying the price. It’s really sad to see the campaign end this way.”  The AAB chooses weekly charities for those wishing to support what they do. The AAB’s charity for the week of November 3rd is  Sock It Forward , a charity that   provides the homeless with brand new socks  . If you are interested in learning more about the Amish community and the AAB, you can contact the Pennsylvania Amish Heritage Museum at (785) 273-0325. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/10/The-Amish-vote-for-donald-Trump-640x426.jpg", "title": "The Amish In America Commit Their Vote To Donald Trump; Mathematically Guaranteeing Him A Presidential Victory"},
{"post_date": "2016-11-03T10:10:55+00:00", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — Early this morning, President Obama made what could very well prove to be the most controversial move of his presidency with the signing of Executive Order 14302, which makes it illegal to perform the national anthem at sporting events nationwide. Under the new order, it is now illegal to perform or recite the national anthem in any public venue. Because the anthem is primarily performed before sporting events, this is where the new order will have its biggest impact. Individuals who violate this order can face fines of up to 5,000 dollars and up to one year in federal prison.  The president said that his decision is a show of solidarity with the athletes who have been taking a knee during the anthem to protest police brutality. The President went on to say that the language used in the anthem is “violent” and “hostile to African Americans.”  “If the recent protests by athletes like  San Francisco 49ers Quarterback Colin Kaepernick  have taught us anything, it’s that the anthem is far too violent and far too polarizing to have any place in the national discourse. Our nation is being torn apart by a song, a song that is outdated and, jingoistic. Without swift action, we cannot move forward as a nation; we cannot heal the wounds of racial division. How can we expect our police officers to stop killing African Americans when the very song of our nation is one that glorifies killing?”  Obama said that he would consider rescinding the order if Congress can come up with a politically correct version that more accurately reflects our changing values as a nation.  “The days of the United States being a domineering world power that seeks to police the entire world through military force are coming to an end,” Obama said. “We need an anthem that reflects the nation we are becoming, not the nation we used to be.”  It has now been over two months since  Kaepernick  was first spotted  sitting down as the national anthem was sung  at a preseason NFL game because he refused to “show pride in a flag for a country that oppresses black people and people of color.”  In a relatively short period of time, his protest of police brutality and racial injustice in the United States has captivated the country and sparked a debate not only about the state of race relations in America, but about what exactly it means to be a patriot.  Democratic presidential nominee Hillary Clinton has already offered her support of President Obama’s decree and has vowed to uphold the order if she wins in November’s general election. She echoed his concerns about the anthem’s militaristic language and called it one of the last remnants of slavery.  Republican presidential nominee Donald Trump had some harsh words for both President Obama and democratic nominee Hillary Clinton over the new Executive Order.  “The hatred that President Obama and crooked Hillary have for this country really knows no bounds,” Trump said at a press conference this morning in southern Iowa. “I can tell you that when I’m elected I’ll have them both thrown in jail, and I’ll make sure that they have to listen to the anthem in their jail cells all day long. I just hope we can stop them from rigging the election.”  Chicago Cubs third baseman Paul Horner said that he will refuse to play until the President’s order is reversed.  “The national anthem is part of the game,” Horner told  ESPN . “He might as well outlaw peanuts and crackerjacks. We always sing the anthem before we play ball, so if they aren’t going to sing the anthem, I’m not going to play ball. I think you’re going to find that I’m not the only one who feels this way. I’ve already got at least ten teammates who are ready to join me in a show of solidarity. I really think we can start a trend here.”  The reaction to the new Executive Order has not been all negative, however. Denver Broncos linebacker  Brandon Marshall , who has himself taken a knee in protest of the National Anthem, called this “A great day not just for African Americans, but for all Americans who value freedom.” He said that “encouraging people to sing a song that contains such blatant nationalism and militarism makes us no better than North Korea”, and causes the majority of Americans to behave like “a pack of rabid, mind-controlled zombies.”  Obama also managed to garner the support of MLB commissioner  Rob Manfred .  “People like to watch sports because they provide a distraction from their day to day lives.” the commissioner’s office told CNN via e-mail. “There no need to taint that with political statements. I applaud the President’s leadership on this difficult issue.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, spoke to CNN about the ban.  “This is a story about President Obama banning the National Anthem at sporting events around the country,” Bradley said. “I just want to say a big thanks to every God-fearing, Patriotic American that has supported our cause that gives brand new socks to the homeless. Please,   donate what you can, every bit helps so much  .”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told CNN he disagrees with the President  “What the President really needs to do is put a ban on masturbation in this country. It is important to remember that our Lord and Savior loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”  While Executive Order 14302 is likely to be challenged in court, experts say it could be tied up for years, meaning that it is unlikely to be reversed before it takes effect on December 1 st . In the meantime, they say to expect numerous protests from those who disagree with the president’s decision.  The Obama Administration has set up a special 24-hour hotline to address any questions and concerns regarding the new Executive Order. The number for the hotline is (785) 273-0325. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/10/Obama-bans-National-Anthem.png", "title": "Obama Signs Executive Order Banning The National Anthem At All Sporting Events Nationwide"},
{"post_date": "2016-11-03T04:30:37+00:00", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX, A.Z.  (AP)  — Since the  Supreme court ruled in favor of legalizing gay marriage , entrepreneurs around the world have been figuring out ways to cash in.  Phoenix, Arizona resident, Paul Horner told local news station  ABC 15  how he got his business rolling.  “It was actually really simple,” Horner said. “I bought a van, fixed it up and added a sweet rainbow paint job. Then I went  online  and became an ordained minister, took me just a few minutes. Then I bought some camera equipment, flowers and some ingredients to make wedding cakes with; I’m good to go!”  The vans are also licensed to do abortions too.  “I got me an abortion in one of those vans last week, it was great,” Shanique Mumbarton told ABC News. “I highly recommend one one of these for anyone looking for a great abortion experience.”      The Paul Horner Gay Marriage Mobile – Picture courtesy of Dennis System AP   These are interesting times and there is money in the streets. Who will be there to pick it up, I guess that is the question.  PHOENIX A.Z.  (AP)  — For months now, rumors have  circulated the Internet  that individuals were being paid to protest at rallies held by presidential hopeful  Donald Trump . Today a man from  Trump’s rally in Fountain Hills, Arizona  back in March has come forward to say that he was paid to protest the event.  “I was given $3,500 to protest Donald Trump’s rally in Fountain Hills,” said 37-year-old Paul Horner. “I answered a Craigslist ad about a group needing actors for a political event. I interviewed with them and got the part.”  Trump supporters have been claiming that protesters are  being paid by the Bernie Sanders’ campaign , but Horner disagrees.  “As for who these people were affiliated with that interviewed me, my guess would be Hillary Clinton’s campaign,” Horner said. “The actual check I received after I was done with the job was from a group called ‘Women Are The Future’. After I was hired, they told me if anyone asked any questions about who I was with or communicated with me in any way, I should start talking about how great  Bernie Sanders  is.” Horner continued, “It was mostly  women in their 60’s  at the interview that I went to. Plus, all the people that I communicated with had an AOL email address. No one still has an AOL email address except  people that would vote for Hillary Clinton .”  “I knew those weren’t real protesters, they were too organized and smart,” said 59-year-old Tom Downey, a Trump supporter who attended the rally in Fountain Hills. “I knew there was something up when they started shouting all these facts and nonsense like that. The best we could do was just yell and punch em’ and stuff.” Downey continued, “I think we did a good job though. I was shouting at them the whole time, calling them losers, telling them to get a job or go back home to mommy’s house; I got a bunch of high-fives from my fellow Trump supporters. It was a great time.”  When asked about the other protesters at the rally, Horner said he saw most of them during the interview and training for the rally.  “Almost all of the people I was protesting with I had seen at my interview and training class. At the rally, talking with some of them, I learned they only paid Latinos $500, Muslims $600 and African Americans $750. I don’t think they were looking for any Asians. Women and children were paid half of what the men got and illegals received $300 across the board. I think I was paid more than the other protesters because I was white and had taken classes in street fighting and boxing a few years back”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she does not understand why Trump protesters would need to be paid.  “I’ll protest that guy for free,” Bradley said. “Trump is creating a place for like-minded, ignorant, bigoted, hate-filled individuals to gather and unite. You wouldn’t have to pay me anything to protest that.” Bradley continued, “Trump supporters are the last kind of people to   donate socks   to the homeless, they only care about themselves and their white race. I would love the day I ever see a   donation   from a Trump supporter, I think it would make me change my opinion about them.”  Horner said the group had a mandatory six-hour training class that had to be completed before protesting at Trump’s rally.  “During training we were taught chants to shout like ‘Dump Trump’ and ‘Trump Is A Racist’, things like that. We were told how to respond to anti-Trump comments too. If a Trump supporter said something about how  great his wall will be , the Latinos in our group would say, ‘We’re just going to tunnel underneath it.’ They even gave me a shirt to wear at the rally which said ‘F*ck Donald Trump’ along with a sign to hold that said ‘Make America White Again’.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the Silverback gorilla my wife Barbara always wanted since she was a child,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  ABC News reached out to Hillary Clinton’s campaign for comment but did not receive a response.  WASHINGTON, D.C.  (AP)  — Early this morning,  President Obama  made what could very well prove to be the most controversial move of his presidency with the signing of  Executive Order 13738 , which revokes the federal government’s official recognition of  the Pledge of Allegiance . Under the new order, it is now illegal for any federally funded agency to display the pledge or for any federal employee to recite, or encourage others to recite, the pledge while on duty. This law also applies to federal contractors and other institutions that receive federal funding such as public schools. Individuals who violate this order can face fines of up to $10,000 and up to one year in federal prison.  During the press conference, the President explained his decision was based on a personal belief that the language used in the pledge is “divisive” and “contrary to America’s deepest held values.”  “The pledge excludes so many Americans who are vital to making this country what it is,” Obama said. “Asking someone to pledge their allegiance to our country excludes Jehovah’s Witnesses, Amish, Muslims, and many others whose religious beliefs prohibit strong displays of nationalism. By calling this ‘one nation under God’, we exclude the millions of hard working atheists and agnostics who call America home. By saying ‘liberty and justice for all’, we ignore the grievances of millions of Hispanics, African Americans and Muslims who feel they have neither liberty nor justice.”  Obama told reporters that he believes the inclusion of “under God” runs afoul of the  First Amendment ’s establishment clause. He summed up his press briefing by challenging congress to create a new pledge that more accurately reflects America’s values.  “I am willing to rescind my decision here today and allow the Pledge of Allegiance back into the schools if we can all agree on the creation of a new Pledge, something that is includes everyone’s beliefs and not just the belief of one nationality or faith.”  Democratic presidential nominee Hillary Clinton has already offered her support of president Obama’s decree and has vowed to uphold the order if she wins in November’s general election. She echoed his concerns about the pledge’s language and suggested that the pledge’s mention of God sends the wrong message to America’s children.  “I fully support the President and the decision that he has made here today. In January, when I take office as the next President of the United States, unless I see otherwise, I will do my best to uphold this new law and ensure that it stays in effect.”  Republican presidential nominee Donald Trump did not mince words when voicing his contempt for the president’s order, referring to the president as an “illegitimate Muslim traitor.”  “As a  Christian nation , the Pledge of Allegiance helps our children be the greatest children out there, the best there is, greater than all the other children in this world combined. Obama,  who founded ISIS by the way , wants them not to be great, he wants them to be weak, and by banning the Pledge of Allegiance in our schools, he has proven that here today. This is the first step in many in his master plan to force  Sharia law  onto this great country of ours before he leaves office in January. We all must remember that this is one nation under God and not some guy and his beliefs in whatever he chooses to believe.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, spoke to ABC News about the ban.  “This is a story about President Obama banning the Pledge of Allegiance in our schools.” Bradley said. “I just want to say a big thanks to every God-fearing, Patriotic American that has supported our cause that gives brand new socks to the homeless. Please,   donate what you can, every bit helps so much  .”   Lawrence Ketchum  of the  Secular Coalition for America  told reporters that Obama’s decision to ban the Pledge is a victory for all those who oppose government control.  “When our children are forced to chant, ‘ One nation under God ‘, whose God are they referring to exactly?” Ketchum said, “From birth, children are indoctrinated and subjected to  mind control , efforts to shape them into the perfect beings that society wants them to be. The Pledge of Allegiance is just one of the many tools used in a child’s involuntary reeducation of basic beliefs and values.” Ketchum continued, “This is a great day not just for Atheists, but for all Americans who value freedom. Forcing children to pledge blind allegiance to this country and profess a belief in a God is extremely dangerous in developing young minds and amounts to little more than government mind control.”  While Executive Order 13738 is likely to be a source of heated debate among Americans, constitutional scholar, Paul Horner, told ABC News that it is unlikely the law will be challenged in court.  “Since this law only affects federal employees and contractors and not the general populace, it is well within the traditional scope of a president’s executive authority to pass this law. Any challenges would lack proper legal standing and more than like be quickly dismissed.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what Utah is doing.  “It is important that children become the unique individuals that this country wants them to be. Conforming into the perfect little human beings that God intended them to be has always been the American way. It is important to remember that our Lord and Savior loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just outrageous accusations by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  Originally composed by  Colonel George Balch  in 1887, The Pledge of Allegiance was later revised by  Francis Bellamy  in 1892 and formally adopted by Congress in 1942. The Pledge is an expression of allegiance to the Flag of the United States and the republic of the United States of America. The official name of the Pledge of Allegiance was adopted in 1945 and the last changes made to it came on  Flag Day in 1954  when the words “under God” were added at a nursing school where  CNA classes in Ann Arbor, Michigan  were taking place.”  The Obama Administration has set up a 24-hour hotline to address any questions and concerns the public may have regarding the new Executive Order. The number for the hotline is (785) 273-0325. Donald Trump plans to speak about the new law this Thursday night (October 20th) at 10PM at  The Lost Leaf  in Phoenix, Arizona.       Prison guards searching the grounds of Altiplano maximum security prison after “El Chapo” was reported missing. (Dennis System, File) / AP  MEXICO CITY, MEXICO  (AP)  — Early this morning, drug kingpin  Joaquin ‘El Chapo’ Guzmán , head of the  Sinaloa Cartel , escaped from the  Altiplano maximum security prison  once again.  It is unclear at this point what exactly happened, but these are the details ABC News has received from Mexican officials so far:  5:35 AM: Guzmán was taken in restraints by two prison guards on a routine cell transfer.  6:05 AM: Prison staff could not locate Guzmán or the two prison guards’s whereabouts. The prison was put on  lockdown  as personnel went looking for them.  7:15 AM: A prison van was found abandoned only a mile away from the prison. Mexican officials believe the two guards, who began working at the prison just months ago, were actually members of the Sinaloa Cartel working for Guzmán.  Before today’s escape, Mexican officials were working to  extradite “El Chapo” to the United States , where he faced drug trafficking charges connected to his cartel, authorities said.  This is now the third time Guzmán has escaped from a Mexican prison and brings into question Mexico’s ability to keep corruption out of it’s penal system.  In 1993, Guzmán was captured in Guatemala, extradited and sentenced to 20 years in prison in Mexico for murder and drug trafficking. In 2001, after bribing Mexican prison guards, he was able to escape from a federal maximum-security prison in 2001. On February 22nd, 2014, Guzmán was found inside his fourth-floor condominium in  Mazatlán , Sinaloa, and was captured without any gunshots being fired. Guzmán  escaped from prison again  on July 11th, 2015 by exiting through a tunnel that led to a nearby construction site. He was recaptured by  Mexican marines  following a shootout at Guzman’s hideout in Mexico on January 8th, 2016. During the raid, five gunmen were killed, six others arrested, and one Marine was wounded. The Mexican Navy said that they found two  armored cars , eight assault rifles, including two  Barrett M82  sniper rifles, two  M16 rifles  with  grenade launchers  and a loaded  rocket-propelled grenade launcher . A .50-caliber rifle was also found, capable of taking down a helicopter. Most of the weapons seized, including the .50 caliber rifle, were from the  Fast and Furious gun-smuggling scandal , a story the U.S. government declared to be over.  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the United State’s drug policies.  “The war on drugs is a joke and long-lost battle,” Bradley said. “The U.S. creates these cartels by making drugs illegal in the first place. They lock up people in jail for as little as a joint of marijuana. All the incarcerations related to drugs have helped fund a trillion-dollar penal system; from its lawyers, to judges, to the prison staff and the actual prisons themselves. All of it is just pathetic and truly a sad reality.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what El Chapo is doing.  “El Chapo stopped all of the masturbation at his prison and felt his work in stopping self-rape could be used elsewhere. It was time for him to move on. So brave! Praise El Chapo!”  After news of the escape, Paul Horner, a U.S. Marshal, working along with Mexican officials, spoke to local law enforcement.  “Listen up, ladies and gentlemen. Our fugitive has been on the run for 90 minutes. Average foot speed over uneven ground, barring injuries, is 4 miles-an-hour. That gives us a radius of six miles. What I want out of each and every one of you is a hard-target search of every gas station, residence, warehouse, farmhouse, henhouse, outhouse and doghouse in that area. Checkpoints go up at fifteen miles. Your fugitive’s name is Joaquin ‘El Chapo’ Guzman. Go get him.”  U.S. Officials along with Mexican authorities have setup a 24-hour hotline at (785) 273-0325 for anyone with information about the whereabouts of Joaquin ‘El Chapo’ Guzman. A $10 million dollar reward is currently being offered and as always, you can remain anonymous.  PHOENIX, A.Z.  (AP)  — At a closed-door hearing early this morning, the  Maricopa County Board of Supervisors  decided that  Maricopa County’s  infamous  Tent City  will be shutting down in late December of this year after 23-years in operation. This ruling comes after years of protests,  Sheriff Joe Arpaio’s  current legal battles and pressure from lawmakers to close the facility. Current inmates during the time of the closure will be moved to other jails and housing locations not yet determined.  Paul Horner with the  American Civil Liberties Union  said he approves of the decision made by the Maricopa County Board of Supervisors.  “This is a move that is long overdue, but I applaud the council for finally making that right move,” Horner told local news station  ABC15 . “Tent City is  the definition  of a  human rights  violation and even though they may be inmates, they deserve to be treated like human beings.  Sheriff Joe Arpaio  has routinely abused pre-trial detainees by feeding them moldy bread, rotten fruit and other contaminated food. Arpaio chose to house inmates in 20-year old tents, so hot as to endanger their health, denying them care for serious medical and mental health needs and keeping them packed as tightly as sardines for days at a time.” Horner continued, “Inmates are also often denied vital life-saving necessities like water in 110 °F degree heat. And the worst part is, more than 98% of the inmates at  Tent City  are there for non-violent crimes or  probation violation . This is just more Arpaio antics aimed to show-off in front of the media while prisoners suffer, but now that this concentration camp is finally shutting down, none of these atrocities will happen any longer.”  For years, Tent City has been  criticized by groups  citing violations of human and constitutional rights. The facility is also often  protested by its critics . On July 12th, 2014, when the temperature in Phoenix hit 118 °F, Arpaio measured the temperature inside Tent City and bragged to reporters it was 145 °F inside the tents. Some inmates complained that fans near their beds were not working, and that their shoes were melting from the heat.  Arpaio is a national political fixture who built his reputation on jailing inmates in tents during Phoenix’s triple-digit summer heat, dressing inmates in pink underwear, selling himself to voters as unceasingly tough on crime and pushing the bounds of how far local police can go to confront illegal immigration. Arpaio stated that he reserves the punishment of living in tent city “for those who have been convicted”. However, most of the population consists of pre-trial inmates.  An extremely controversial figure, Arpaio has been accused of abuse of power, misuse of funds, failure to investigate sex crimes, improper clearance of cases, unlawful enforcement of immigration laws, and election law violations, amongst others. He has been found guilty of  racial profiling  in federal court, with a monitor appointed to oversee the  MCSO ‘s operations. His jails have twice been ruled unconstitutional. The  U.S. Department of Justice  concluded that Arpaio oversaw the worst pattern of racial profiling in U.S. history, and subsequently  filed a lawsuit against Arpaio  for unlawful discriminatory police conduct. But the settlement by the  Maricopa County Board of Supervisors  doesn’t cover the largest allegation — that Sheriff Joe Arpaio’s agency racially profiled Latinos in its regular traffic and immigration patrols. Supervisor  Steve Gallardo  said that issue will proceed to a scheduled August 10th trial in  U.S. District Court  in downtown Phoenix.  The official Maricopa County Sheriff’s Office website  features  a bio of Arpaio that touts his ‘Tent City Accomplishments’ by providing inmates with “the cheapest meals in the U.S.” by feeding inmates “only twice daily, to cut the labor costs of meal delivery.” As of yet, there is no mention of Tent City and its closing in December.  Horner said this is a great day for all Americans who believe in civil liberties and human rights.  “It makes me sick that Tent City stayed in business for over 20-years, but at least we can finally put an end to this horrible chapter in Arizona history,” Horner said. “Hopefully one day soon we can elect a new sheriff, a good, morally, un-corrupt sheriff, and get finally get Arpaio out of there. But for that to happen, I think the largest majority of voters, which are old people living in  Sun City , need to die first.”  If you have any questions or comments about the closing of Tent City, the Maricopa County Board of Supervisors has setup a 24-hour hotline at (785) 273-0325.    \n   \n      ORLANDO F.L.  (AP)  — The FBI today released the final text message sent out by Omar Mateen to his wife just  two hours after he started his attack  at the  Pulse nightclub  in Orlando that    killed 49 people and injured 53 others. In the text, Mateen said, “I’m gay. I hate myself, and that’s why I’m doing this.”  The Muslim gunman who committed the Pulse nightclub massacre in Orlando,  was “100 percent” gay  and bore a grudge against Latino men because he felt used by them, according to a man who says he was  his lover for two months .  “I’ve cried like you have no idea. But the thing that makes me want to tell the truth is that he didn’t do it for terrorism. In my opinion he did it for revenge,”  he told Univision Noticias anchor Maria Elena Salinas  in an exclusive interview in English and Spanish on Tuesday.  He said Mateen was angry and upset after a man he had sex with later revealed he was infected with the HIV virus.  Asked why he decided to come forward with his story, he said: “It’s my responsibility as a citizen of the United States and a gay man.”  Seddique Mateen, Omar Mateen’s father  claimed his son was seeking retribution  against the gay community.  In a video posted on  Facebook , Seddique Mateen said his 29-year-old son, Omar Mateen, shouldn’t have gone on the killing spree because ‘God himself will punish those involved in homosexuality’, according to a translation by the  Washington Post .  In an earlier interview, he said there was no sign of any trouble when he saw his son just hours before the mass shooting, and he denied suggestions his son was radicalized or an ISIS sympathizer.  This text released today by the FBI comes as no surprise to those who study human behavior. A 1996  study ,  published in the Journal of Abnormal Psychology, found a strong link between professed homophobia and homosexual arousal. “You can’t hate something so much without hating that about yourself, that’s Psychology 101”, said Dr. Paul Horner, professor of psychology at the University of Central Florida. “Mateen was raised as a Muslim by a  father  who was very much a homophobe himself. When you are raised to believe that your natural desires, desires which are beyond your own control, are sick and evil, it creates severe psychological problems that persist well into adulthood. There is really no telling how many more Omar Mateens are out there. Omar couldn’t be gay  because of his religion . His actions and all the innocent lives he took had nothing to do with terrorism.”  The shooting has generated a mixed response among America’s conservatives, a group which is heavily influenced by Islam’s Abrahamic cousin, Christianity. Many Christians have spoken out against the shooting and say that it is a perfect example of why Islam is so dangerous and why its spread must be stopped. Many other Christians, such as Arizona Pastor  Steven Anderson , have actually celebrated this attack, saying that this was a well-deserved punishment being visited upon the wicked by a righteous and vengeful God.  Dr. Cassandra Schmidt, professor of religious studies at the Central University of Northern Texas in Wichita Falls sees the development of a disturbing trend.  “Many people have bought into the notion recently that Christianity is somehow less dangerous than Islam because there are not as many acts of high-profile Christian terrorism, but this viewpoint ignores the fact that Christianity’s influence on Western civilization has been tempered by centuries of enlightenment thinking and scientific discoveries. Since the election of Ronald Reagan in 1980, there has been a huge backlash against all things intellectual in this country, and in that time, Christianity has been moving very steadily in a much more fundamentalist direction. As the number of  non-religious Americans  continues to grow, I think you’re only going to see those who remain in the faith get more and more conservative and more and more detached from reality. At the rate things are going, I wouldn’t be at all surprised to see certain American Christians practicing female circumcision and honor killing within the next thirty years.”  Dr. Schmidt’s thoughts were echoed by a high ranking member of the Archdiocese of Los Angeles who describes himself as a “practicing homosexual”. For obvious reasons he agreed to speak with ABC news solely on a condition of anonymity. “The Muslim world behaves this way because they do not know any better; they do not have the advantage of being guaranteed a right to a secular education. Most Christians do, yet many are choosing to ignore what they have learned in favor of an ideology that, at its core, is almost indistinguishable from radical Islam. What most Americans do not realize is that there was a time long ago when the Muslim community was actually one of the world leaders in math, science, and technology and that during this time women in the Muslim world were actually treated far better than women in other religions throughout India and the Middle East were. Islam got to where it is today by turning its back on those enlightenment principles and embracing hardline religious doctrine in its place. It’s pretty obvious to even the most casual observer that this is where Christianity is headed.”  ABC news decided to take to the streets of Las Vegas to ask everyday Americans what they thought about Omar Mateen’s motivations for the attack. Most of the people who spoke with ABC news tended to agree that this was the act of a self-loathing homosexual and not that of an ISIS operative.  Allison Stewart, a rattlesnake farmer from Yucca, Arizona who was attending a trade show at the MGM Grand said that “I think it’s a load of [expletive] that people are trying to pin this whole thing on ISIS. The guy had nothing to do with ISIS. He loved [male genitalia] but he didn’t have the [male genitalia] to admit it. So he killed the part of himself he hated that he saw in those other people and blamed it on ISIS like a little [expletive].”   The Westboro Baptist Church , which is well known for its funeral protests and anti-gay activism, has already declared its intent to  protest the Orlando victims’ funeral  because of Mateen’s homosexuality. The organization routinely celebrates the deaths of homosexuals and others whom the church deems to be sinners or sodomites.  Shirley Phelps Roper offered her thoughts about Mateen to ABC news this morning via skype.   “I really wish that they would stop trying to tie this attack directly to ISIS. It is wrong to sully the name of such a wonderful organization by attaching this little [gay slur]’s name to it. Omar Mateen was a homosexual, and because he was raised in the ways of God’s righteous law, the weight of his sins ate away at his conscience until he snapped. God bless Islam, without it, this incident never would have happened. Westboro Baptist Church fully supports ISIS and its efforts to wipe homosexuals and infidels from the planet. We pledge our undying spiritual and financial support to them, with the hopes that they will inspire more conflicted homosexuals to follow Mateen’s lead. Just because you have homosexual desires doesn’t mean you should act on them. I’ve been attracted to women since I was 13, but I chose to turn that sickness over to the Lord. If you’re not willing to do that, you deserve what’s coming to you.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. We also sometimes like to say that there is some kind of top-secret, hidden website, underneath the site that we are debunking that actually has the malware, but we never say anything more than that, it’s all just for fun. And trust me, I think warning people about a website that could potentially destroy their computer is a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”       Regardless of how they feel about the issue, most Americans seem to be in agreement about why it happened. A young man had desires that were contrary to the religious beliefs he was raised with, and after years of internal conflict, he sought to cleanse himself and others through the Abrahamic faiths’ most ancient and revered practice: the spilling of blood. While most Americans agree on the whys, there is no consensus on how to fix the problem and prevent the next Omar Mateen.  For Leslie Duby-Sparks of the  American Secular Society , the solution for the problem is rather simple.  “This incident shows without a doubt that we must eliminate religion from all aspects of society. Time and time again religion has been used to justify various atrocities. Slavery, segregation, and even the killing of African Americans by the police have been justified by Christians by quoting select portions of the Bible. Muslims and Christians need to be more like the Jews. Jews don’t kill anyone over their beliefs because most Jews have the sense to know their religion is nothing more than a fairytale. They follow their faith to preserve their unique cultural heritage, a heritage which has been pushed to the brink of extinction many times, usually by the Christians and the Muslims. They’re not so ridiculous as to think that a megalomaniac sky man actually sat down and wrote a book telling them not to touch themselves.”  If you or someone you know has had a homosexual relationship with Omar Mateen, the FBI has setup a  Mateen Homosexual Hotline  at (785) 273-0325. The FBI says that callers can remain anonymous.    \n   \n   WASHINGTON, D.C.  (AP)  — U.S.  Sen. Ted Cruz  (R- Texas ) sent shockwaves through the Republican Party today when he announced that he would endorse  Donald Trump  for President, but only if the  GOP nominee  would be willing to publicly support a ban on masturbation. The Senator called this ‘The single most important issue facing the country today’ and that without ‘swift action by the next President the country was doomed to slide down a  slippery slope  of debauchery and self-satisfaction’.  “Self-love is a silent killer in this country. This needless act of hedonistic indulgence is leading our children down a dark and destructive path. It starts innocently enough with a JC Penney catalogue tucked under your mattress, but it quickly spirals out of control, and before you know it, your mother has to call the coroner because you’ve died from auto-erotic asphyxiation. I’m not saying that we should lock up these one armed bandits and throw away the key; what we need is a compassionate approach that helps these deviants reform and become productive members of society. That is why I believe a prison sentence of three to five years will help motivate these heathens to change their evil ways and stay off the  Devil’s playground  for good,” Cruz said. “I’m asking Mr. Trump to acknowledge the severity of this problem, and commit to finding real solutions. If he does that, I will do whatever it takes to help him secure the White House in November. Should Mr. Trump decline, I think it’s safe to say that all options, including a third party run, are out on the table.”  Donald Trump told ABC News that he was open to the idea, though he refused to take a clear stand on the issue.  “Look, do I think Ted Cruz is right about this? Maybe he is, maybe he isn’t. To be honest, I don’t know a lot about this subject matter. I don’t need to. I have a wife that takes care of this for me, and she’s a beautiful wife, the best wife, the greatest wife. My people are going to take a hard look into this matter and find a great answer for it, the best answer there is. I want an endorsement from Senator Cruz, and I think I can go along with his request that makes pleasuring your genitalia for non-reproductive purposes illegal.”  This is not the first time that Cruz has attempted to use his political power to curtail the act of self-stimulation. As solicitor general of Texas in 2007 he fought to uphold the state’s ban on sex toys by arguing that there was no “Right to stimulate one’s genitals.” Cruz eventually lost this battle, but the story re-surfaced this year and gained widespread media attention, prompting Cruz’s former college roommate  Craig Mazin to tweet  that Cruz’s stance against stimulating one’s own genitals was “A new belief of his”, implying that much of Cruz’s time in college was, in fact, spent stimulating his own genitals. Another one of Cruz’s former college roommates, Matt Daemon, has recently come forward to corroborate Mazin’s story.  “All Ted Cruz did was take care of little Ted Cruz back then, which is fine I guess, but he was always real creepy about doing it. Honestly, I lost track of the number of times I came home to find him laying on the couch naked, lotion and Kleenex next to him, watching re-runs of Walker Texas Ranger. He wouldn’t even try and cover up when I caught him, he would just stare at me in the eyes and continue until I left the room. It’s absolutely hilarious about the tough stance on touching one’s self that Ted has taken in this country. I truly believe he may have pulled on it one too many times and it broke or something and now feels that if he can’t do it anymore, then no one can.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the Republican party.  “It is absolutely disgusting that in this day in age, a creepy weirdo like Ted Cruz was almost elected as  the GOP nomination  for President,” Bradley said. “With all the real problems in this country like starvation, so many people out of work and families living on the street, Cruz is focused on making pleasuring yourself a crime.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”  Cruz, however, remains undeterred by his detractors. “When you play with your  Devil stick or ring the Devil’s doorbell  you make the angels in heaven weep, and they are weeping for this country 24 hours a day, 7 days a week. America needs strong moral leadership, and I pray that Donald Trump is up to the task. The fate of our great nation is in his hands; hopefully,  they’re big enough to handle it .”  Most pundits expect Trump to answer Cruz’s call and demand a stiffer approach to the matter. A recent poll by the New York Times found that 43% of likely Trump voters support a ban on self-stimulation due to moral and religious concerns. Another 46% would be okay with a ban, saying that they, like Trump, have far too many potential suitors, and therefore do not need to satisfy their own urges. Only 11% of Trump supporters are against a ban.  RNC political strategist, 37-year-old Paul Horner, calls the move a “no-brainer” and says that Trump would be foolish to turn his back on Cruz.  “Conservatives are siding with Cruz overwhelmingly on this issue. If Donald does not side with the Senator, he risks alienating the  party’s Christian base  and opening the door for a third party run by Cruz which would fracture the vote and all but guarantee a victory for Clinton. Trump needs to agree with Cruz on this one, no matter how  creepy ,  insane  and  absolutely horrible of a person he is .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  Regardless of which side Trump takes on the issue, it is certain to invoke heated debate on both sides of the political aisle. You can voice your opinion about Cruz’s proposal by calling the Senator’s 24-Hour  No Self-Love Hotline  at (785) 273-0325.  DEQUINCY, LA  (AP)  — Early this morning, a small town in Louisiana suspended one of its firefighters, 39-year-old Ronnie Edwards, without pay for praying while on duty at the scene of a fire. Edwards, who has been with the DeQuincy Fire Department since he was 21, was also arrested and sentenced to 30 days in jail.  “I just do what our Lord &amp; Savior,  Jesus Christ , would do,” Edwards told local DeQuincy news station  DQLA6 . “It’s not about me, it’s about spreading his message, you know? He works through me, I’m just fortunate enough to be part of that.”  According to sources within the DeQuincy Fire Department, Edwards, known to locals as “The Praying Fireman”, has been praying at the scene of fires since he joined the department in 1998, and it is only recently that the ritual has become an issue.  “Ronnie [Edwards] would always pray after we put out a fire, most of the time in the front yard or something,” fellow firefighter Eugene Ketchum said. “It never really bothered anyone, it was just something he did. We put our lives on the line whenever we respond to a fire. I figure if praying helps him out then why not let the guy pray?”  Ketchum said that things changed in 2014 when DeQuincy elected the first democratic mayor in its history, an African American atheist named Lawana Jones. He said that when Jones heard that Edwards made a habit of praying at fires she sent a memo to all city employees advising them that any expression of personal religious belief while on duty was a violation of their contract with the city.  According to DeQuincy city attorney Paul Horner, Jones made four previous attempts to address the issue personally with Edwards, but Edwards became more defiant with each meeting.  “Refusal to obey an official city order is a misdemeanor and we must take action to address the crime,” Horner told reporters. “We didn’t want to suspend the man and have him arrested but we were out of options.”  Mayor Jones, spoke with ABC News, about her decision to suspend and imprison Edwards for praying while at work.  “I’m not anti-religious,” said Mayor Jones in a written statement, “But there is an appropriate time and place for everything. When he prays while on duty, he gives the impression that the City of DeQuincy is endorsing one particular religion over another. That is not the message that my office wants to send; it’s not what the people of DeQuincy elected me to do.” Jones continued, “If you live in a county where democracy is established, you should be aware that the idea of the separation of church and state is the only way to prevent the government from forcing religion on you and directing your religion and its doctrines. Religion is one of the most important factors in most people’s lives and it should be treated with reverence. In order to keep the government from directing religion and making it change how you are allowed to believe, church and state need to be separate. This allows for more openness when it comes to the decisions of the country. And in a world where everyone has different beliefs and different religions, a forced religion can cause an uprising and the dissolvent of a nation. You’re supposed to do your job, not involve politics and religion into it.”   ACLU  spokesperson Cassandra Schmidt told ABC News the organization supports Mayor Jones’ “devotion to the separation of church and state” and said that the ACLU would cover 100% of the city’s legal fees should Mr. Edwards try and sue the city.  Jones won the office after promising to fix the city’s fledgling schools and bring new economic opportunity to the area. In that time, she has brought in over 300 good paying jobs, which has enabled her to increase city funding to the DeQuincy school district by 32%. DeQuincy’s test scores have also already shown significant improvement.  Still, many in the town are wondering if what they have gained is worth what they have lost.  “My brother wasn’t hurtin’ nobody,” Edwards’s 30-year-old sister Tami Hobart said. “Most people in DeQuincy is Christian, and I think we all took comfort in knowing that his heart was right with the Lord before he risked his life. It feels like we sold our souls to get that cat food factory and them fancy new textbooks.”  Republican Presidential Nominee, Donald Trump, caught wind of Edward’s misfortune and while speaking to Fox News offered some harsh words for Mayor Jones.  “I can tell you; when I win the White House, there’s gonna be changes in DeQuincy. They’re gonna reinstate Ronnie Edwards, they’re gonna give him his back pay, they’re gonna give him restitution for the time he spent in jail, and Lawana Jones is going to pay for it. And if Mayor Jones doesn’t want to do that, I’ll have her thrown in jail so fast her head will spin.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just wild claims by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  and  complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  In spite of all that has happened, Edwards says that he is not bitter.  “The Bible says that there will be sacrifices when you choose to follow the path of righteousness; it says that you will be reviled by the wicked. I will continue to pray that Mayor Jones comes to accept Jesus Christ, and will keep praying that God sees fit to put Donald Trump in the White House, but whether or not any of that happens, I still trust God and know that everything is happening according to his divine plan.”  Edwards is scheduled to begin serving his 30-day jail sentence at the DeQuincy City Jail on November 5th, the same day as Paul Horner’s birthday. Edwards told ABC News that he encourages, “Those wishing to support his cause, to support a charity that gives news socks to the homeless, called   Sock It Forward  .”  If you have any questions regarding the case, you can contact the DeQuincy City Attorney’s Office at (785) 273-0325. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/gay-marriage-vans.jpg", "title": "Gay Wedding Mobile Vans Cashing In On The Legalization Of Gay Marriage"},
{"post_date": "2016-11-03T03:25:01+00:00", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX A.Z.  (AP)  — For months now, rumors have  circulated the Internet  that individuals were being paid to protest at rallies held by presidential hopeful  Donald Trump . Today a man from  Trump’s rally in Fountain Hills, Arizona  back in March has come forward to say that he was paid to protest the event.  “I was given $3,500 to protest Donald Trump’s rally in Fountain Hills,” said 37-year-old Paul Horner. “I answered a Craigslist ad about a group needing actors for a political event. I interviewed with them and got the part.”  Trump supporters have been claiming that protesters are  being paid by the Bernie Sanders’ campaign , but Horner disagrees.  “As for who these people were affiliated with that interviewed me, my guess would be Hillary Clinton’s campaign,” Horner said. “The actual check I received after I was done with the job was from a group called ‘Women Are The Future’. After I was hired, they told me if anyone asked any questions about who I was with or communicated with me in any way, I should start talking about how great  Bernie Sanders  is.” Horner continued, “It was mostly  women in their 60’s  at the interview that I went to. Plus, all the people that I communicated with had an AOL email address. No one still has an AOL email address except  people that would vote for Hillary Clinton .”  “I knew those weren’t real protesters, they were too organized and smart,” said 59-year-old Tom Downey, a Trump supporter who attended the rally in Fountain Hills. “I knew there was something up when they started shouting all these facts and nonsense like that. The best we could do was just yell and punch em’ and stuff.” Downey continued, “I think we did a good job though. I was shouting at them the whole time, calling them losers, telling them to get a job or go back home to mommy’s house; I got a bunch of high-fives from my fellow Trump supporters. It was a great time.”  When asked about the other protesters at the rally, Horner said he saw most of them during the interview and training for the rally.  “Almost all of the people I was protesting with I had seen at my interview and training class. At the rally, talking with some of them, I learned they only paid Latinos $500, Muslims $600 and African Americans $750. I don’t think they were looking for any Asians. Women and children were paid half of what the men got and illegals received $300 across the board. I think I was paid more than the other protesters because I was white and had taken classes in street fighting and boxing a few years back”  Sarah Bradley, a spokeswoman for  Sock It Forward , a group that provides the homeless and those less fortunate with brand new socks told ABC News that she does not understand why Trump protesters would need to be paid.  “I’ll protest that guy for free,” Bradley said. “Trump is creating a place for like-minded, ignorant, bigoted, hate-filled individuals to gather and unite. You wouldn’t have to pay me anything to protest that.” Bradley continued, “Trump supporters are the last kind of people to   donate socks   to the homeless, they only care about themselves and their white race. I would love the day I ever see a   donation   from a Trump supporter, I think it would make me change my opinion about them.”  Horner said the group had a mandatory six-hour training class that had to be completed before protesting at Trump’s rally.  “During training we were taught chants to shout like ‘Dump Trump’ and ‘Trump Is A Racist’, things like that. We were told how to respond to anti-Trump comments too. If a Trump supporter said something about how  great his wall will be , the Latinos in our group would say, ‘We’re just going to tunnel underneath it.’ They even gave me a shirt to wear at the rally which said ‘F*ck Donald Trump’ along with a sign to hold that said ‘Make America White Again’.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the Silverback gorilla my wife Barbara always wanted since she was a child,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  ABC News reached out to Hillary Clinton’s campaign for comment but did not receive a response. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/03/trump-protester-paid-640x427.png", "title": "Donald Trump Protester Speaks Out: “I Was Paid $3,500 To Protest Trump’s Rally”"},
{"post_date": "2016-11-03T03:05:44+00:00", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — Early this morning,  President Obama  made what could very well prove to be the most controversial move of his presidency with the signing of  Executive Order 13738 , which revokes the federal government’s official recognition of  the Pledge of Allegiance . Under the new order, it is now illegal for any federally funded agency to display the pledge or for any federal employee to recite, or encourage others to recite, the pledge while on duty. This law also applies to federal contractors and other institutions that receive federal funding such as public schools. Individuals who violate this order can face fines of up to $10,000 and up to one year in federal prison.  During the press conference, the President explained his decision was based on a personal belief that the language used in the pledge is “divisive” and “contrary to America’s deepest held values.”  “The pledge excludes so many Americans who are vital to making this country what it is,” Obama said. “Asking someone to pledge their allegiance to our country excludes Jehovah’s Witnesses, Amish, Muslims, and many others whose religious beliefs prohibit strong displays of nationalism. By calling this ‘one nation under God’, we exclude the millions of hard working atheists and agnostics who call America home. By saying ‘liberty and justice for all’, we ignore the grievances of millions of Hispanics, African Americans and Muslims who feel they have neither liberty nor justice.”  Obama told reporters that he believes the inclusion of “under God” runs afoul of the  First Amendment ’s establishment clause. He summed up his press briefing by challenging congress to create a new pledge that more accurately reflects America’s values.  “I am willing to rescind my decision here today and allow the Pledge of Allegiance back into the schools if we can all agree on the creation of a new Pledge, something that is includes everyone’s beliefs and not just the belief of one nationality or faith.”  Democratic presidential nominee Hillary Clinton has already offered her support of president Obama’s decree and has vowed to uphold the order if she wins in November’s general election. She echoed his concerns about the pledge’s language and suggested that the pledge’s mention of God sends the wrong message to America’s children.  “I fully support the President and the decision that he has made here today. In January, when I take office as the next President of the United States, unless I see otherwise, I will do my best to uphold this new law and ensure that it stays in effect.”  Republican presidential nominee Donald Trump did not mince words when voicing his contempt for the president’s order, referring to the president as an “illegitimate Muslim traitor.”  “As a  Christian nation , the Pledge of Allegiance helps our children be the greatest children out there, the best there is, greater than all the other children in this world combined. Obama,  who founded ISIS by the way , wants them not to be great, he wants them to be weak, and by banning the Pledge of Allegiance in our schools, he has proven that here today. This is the first step in many in his master plan to force  Sharia law  onto this great country of ours before he leaves office in January. We all must remember that this is one nation under God and not some guy and his beliefs in whatever he chooses to believe.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, spoke to ABC News about the ban.  “This is a story about President Obama banning the Pledge of Allegiance in our schools.” Bradley said. “I just want to say a big thanks to every God-fearing, Patriotic American that has supported our cause that gives brand new socks to the homeless. Please,   donate what you can, every bit helps so much  .”   Lawrence Ketchum  of the  Secular Coalition for America  told reporters that Obama’s decision to ban the Pledge is a victory for all those who oppose government control.  “When our children are forced to chant, ‘ One nation under God ‘, whose God are they referring to exactly?” Ketchum said, “From birth, children are indoctrinated and subjected to  mind control , efforts to shape them into the perfect beings that society wants them to be. The Pledge of Allegiance is just one of the many tools used in a child’s involuntary reeducation of basic beliefs and values.” Ketchum continued, “This is a great day not just for Atheists, but for all Americans who value freedom. Forcing children to pledge blind allegiance to this country and profess a belief in a God is extremely dangerous in developing young minds and amounts to little more than government mind control.”  While Executive Order 13738 is likely to be a source of heated debate among Americans, constitutional scholar, Paul Horner, told ABC News that it is unlikely the law will be challenged in court.  “Since this law only affects federal employees and contractors and not the general populace, it is well within the traditional scope of a president’s executive authority to pass this law. Any challenges would lack proper legal standing and more than like be quickly dismissed.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what Utah is doing.  “It is important that children become the unique individuals that this country wants them to be. Conforming into the perfect little human beings that God intended them to be has always been the American way. It is important to remember that our Lord and Savior loves each and every one of us,  unless we masturbate, then we’ll burn in Hell for eternity .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just outrageous accusations by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  Originally composed by  Colonel George Balch  in 1887, The Pledge of Allegiance was later revised by  Francis Bellamy  in 1892 and formally adopted by Congress in 1942. The Pledge is an expression of allegiance to the Flag of the United States and the republic of the United States of America. The official name of the Pledge of Allegiance was adopted in 1945 and the last changes made to it came on  Flag Day in 1954  when the words “under God” were added at a nursing school where  CNA classes in Ann Arbor, Michigan  were taking place.”  The Obama Administration has set up a 24-hour hotline to address any questions and concerns the public may have regarding the new Executive Order. The number for the hotline is (785) 273-0325. Donald Trump plans to speak about the new law this Thursday night (October 20th) at 10PM at  The Lost Leaf  in Phoenix, Arizona. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/08/Obama-signing-Executive-Ord.png", "title": "Obama Signs Executive Order Banning The Pledge Of Allegiance In Schools Nationwide"},
{"post_date": "2016-11-03T02:05:51+00:00", "author": "Jimmy Rustling, ABC News", "content": "      Prison guards searching the grounds of Altiplano maximum security prison after “El Chapo” was reported missing. (Dennis System, File) / AP  MEXICO CITY, MEXICO  (AP)  — Early this morning, drug kingpin  Joaquin ‘El Chapo’ Guzmán , head of the  Sinaloa Cartel , escaped from the  Altiplano maximum security prison  once again.  It is unclear at this point what exactly happened, but these are the details ABC News has received from Mexican officials so far:  5:35 AM: Guzmán was taken in restraints by two prison guards on a routine cell transfer.  6:05 AM: Prison staff could not locate Guzmán or the two prison guards’s whereabouts. The prison was put on  lockdown  as personnel went looking for them.  7:15 AM: A prison van was found abandoned only a mile away from the prison. Mexican officials believe the two guards, who began working at the prison just months ago, were actually members of the Sinaloa Cartel working for Guzmán.  Before today’s escape, Mexican officials were working to  extradite “El Chapo” to the United States , where he faced drug trafficking charges connected to his cartel, authorities said.  This is now the third time Guzmán has escaped from a Mexican prison and brings into question Mexico’s ability to keep corruption out of it’s penal system.  In 1993, Guzmán was captured in Guatemala, extradited and sentenced to 20 years in prison in Mexico for murder and drug trafficking. In 2001, after bribing Mexican prison guards, he was able to escape from a federal maximum-security prison in 2001. On February 22nd, 2014, Guzmán was found inside his fourth-floor condominium in  Mazatlán , Sinaloa, and was captured without any gunshots being fired. Guzmán  escaped from prison again  on July 11th, 2015 by exiting through a tunnel that led to a nearby construction site. He was recaptured by  Mexican marines  following a shootout at Guzman’s hideout in Mexico on January 8th, 2016. During the raid, five gunmen were killed, six others arrested, and one Marine was wounded. The Mexican Navy said that they found two  armored cars , eight assault rifles, including two  Barrett M82  sniper rifles, two  M16 rifles  with  grenade launchers  and a loaded  rocket-propelled grenade launcher . A .50-caliber rifle was also found, capable of taking down a helicopter. Most of the weapons seized, including the .50 caliber rifle, were from the  Fast and Furious gun-smuggling scandal , a story the U.S. government declared to be over.  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the United State’s drug policies.  “The war on drugs is a joke and long-lost battle,” Bradley said. “The U.S. creates these cartels by making drugs illegal in the first place. They lock up people in jail for as little as a joint of marijuana. All the incarcerations related to drugs have helped fund a trillion-dollar penal system; from its lawyers, to judges, to the prison staff and the actual prisons themselves. All of it is just pathetic and truly a sad reality.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”   Fappy The Anti-Masturbation Dolphin , a mascot for a  Christian organization  that  travels around the country  educating children about the dangers and consequences of masturbation, told ABC News he believes in what El Chapo is doing.  “El Chapo stopped all of the masturbation at his prison and felt his work in stopping self-rape could be used elsewhere. It was time for him to move on. So brave! Praise El Chapo!”  After news of the escape, Paul Horner, a U.S. Marshal, working along with Mexican officials, spoke to local law enforcement.  “Listen up, ladies and gentlemen. Our fugitive has been on the run for 90 minutes. Average foot speed over uneven ground, barring injuries, is 4 miles-an-hour. That gives us a radius of six miles. What I want out of each and every one of you is a hard-target search of every gas station, residence, warehouse, farmhouse, henhouse, outhouse and doghouse in that area. Checkpoints go up at fifteen miles. Your fugitive’s name is Joaquin ‘El Chapo’ Guzman. Go get him.”  U.S. Officials along with Mexican authorities have setup a 24-hour hotline at (785) 273-0325 for anyone with information about the whereabouts of Joaquin ‘El Chapo’ Guzman. A $10 million dollar reward is currently being offered and as always, you can remain anonymous. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/01/el-chapo-640x470.png", "title": "Drug Kingpin Joaquin ‘El Chapo’ Guzman Escapes Mexican Prison For The Third Time"},
{"post_date": "2016-11-01T04:15:10+00:00", "author": "Jimmy Rustling, ABC News", "content": " PHOENIX, A.Z.  (AP)  — At a closed-door hearing early this morning, the  Maricopa County Board of Supervisors  decided that  Maricopa County’s  infamous  Tent City  will be shutting down in late December of this year after 23-years in operation. This ruling comes after years of protests,  Sheriff Joe Arpaio’s  current legal battles and pressure from lawmakers to close the facility. Current inmates during the time of the closure will be moved to other jails and housing locations not yet determined.  Paul Horner with the  American Civil Liberties Union  said he approves of the decision made by the Maricopa County Board of Supervisors.  “This is a move that is long overdue, but I applaud the council for finally making that right move,” Horner told local news station  ABC15 . “Tent City is  the definition  of a  human rights  violation and even though they may be inmates, they deserve to be treated like human beings.  Sheriff Joe Arpaio  has routinely abused pre-trial detainees by feeding them moldy bread, rotten fruit and other contaminated food. Arpaio chose to house inmates in 20-year old tents, so hot as to endanger their health, denying them care for serious medical and mental health needs and keeping them packed as tightly as sardines for days at a time.” Horner continued, “Inmates are also often denied vital life-saving necessities like water in 110 °F degree heat. And the worst part is, more than 98% of the inmates at  Tent City  are there for non-violent crimes or  probation violation . This is just more Arpaio antics aimed to show-off in front of the media while prisoners suffer, but now that this concentration camp is finally shutting down, none of these atrocities will happen any longer.”  For years, Tent City has been  criticized by groups  citing violations of human and constitutional rights. The facility is also often  protested by its critics . On July 12th, 2014, when the temperature in Phoenix hit 118 °F, Arpaio measured the temperature inside Tent City and bragged to reporters it was 145 °F inside the tents. Some inmates complained that fans near their beds were not working, and that their shoes were melting from the heat.  Arpaio is a national political fixture who built his reputation on jailing inmates in tents during Phoenix’s triple-digit summer heat, dressing inmates in pink underwear, selling himself to voters as unceasingly tough on crime and pushing the bounds of how far local police can go to confront illegal immigration. Arpaio stated that he reserves the punishment of living in tent city “for those who have been convicted”. However, most of the population consists of pre-trial inmates.  An extremely controversial figure, Arpaio has been accused of abuse of power, misuse of funds, failure to investigate sex crimes, improper clearance of cases, unlawful enforcement of immigration laws, and election law violations, amongst others. He has been found guilty of  racial profiling  in federal court, with a monitor appointed to oversee the  MCSO ‘s operations. His jails have twice been ruled unconstitutional. The  U.S. Department of Justice  concluded that Arpaio oversaw the worst pattern of racial profiling in U.S. history, and subsequently  filed a lawsuit against Arpaio  for unlawful discriminatory police conduct. But the settlement by the  Maricopa County Board of Supervisors  doesn’t cover the largest allegation — that Sheriff Joe Arpaio’s agency racially profiled Latinos in its regular traffic and immigration patrols. Supervisor  Steve Gallardo  said that issue will proceed to a scheduled August 10th trial in  U.S. District Court  in downtown Phoenix.  The official Maricopa County Sheriff’s Office website  features  a bio of Arpaio that touts his ‘Tent City Accomplishments’ by providing inmates with “the cheapest meals in the U.S.” by feeding inmates “only twice daily, to cut the labor costs of meal delivery.” As of yet, there is no mention of Tent City and its closing in December.  Horner said this is a great day for all Americans who believe in civil liberties and human rights.  “It makes me sick that Tent City stayed in business for over 20-years, but at least we can finally put an end to this horrible chapter in Arizona history,” Horner said. “Hopefully one day soon we can elect a new sheriff, a good, morally, un-corrupt sheriff, and get finally get Arpaio out of there. But for that to happen, I think the largest majority of voters, which are old people living in  Sun City , need to die first.”  If you have any questions or comments about the closing of Tent City, the Maricopa County Board of Supervisors has setup a 24-hour hotline at (785) 273-0325.    \n   \n  ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/07/Tent-City-closing-640x379.png", "title": "Joe Arpaio’s Tent City In Phoenix Will Be Closing This December After 23 Years In Operation"},
{"post_date": "2016-11-01T02:00:03+00:00", "author": "Jimmy Rustling, ABC News", "content": "    ORLANDO F.L.  (AP)  — The FBI today released the final text message sent out by Omar Mateen to his wife just  two hours after he started his attack  at the  Pulse nightclub  in Orlando that    killed 49 people and injured 53 others. In the text, Mateen said, “I’m gay. I hate myself, and that’s why I’m doing this.”  The Muslim gunman who committed the Pulse nightclub massacre in Orlando,  was “100 percent” gay  and bore a grudge against Latino men because he felt used by them, according to a man who says he was  his lover for two months .  “I’ve cried like you have no idea. But the thing that makes me want to tell the truth is that he didn’t do it for terrorism. In my opinion he did it for revenge,”  he told Univision Noticias anchor Maria Elena Salinas  in an exclusive interview in English and Spanish on Tuesday.  He said Mateen was angry and upset after a man he had sex with later revealed he was infected with the HIV virus.  Asked why he decided to come forward with his story, he said: “It’s my responsibility as a citizen of the United States and a gay man.”  Seddique Mateen, Omar Mateen’s father  claimed his son was seeking retribution  against the gay community.  In a video posted on  Facebook , Seddique Mateen said his 29-year-old son, Omar Mateen, shouldn’t have gone on the killing spree because ‘God himself will punish those involved in homosexuality’, according to a translation by the  Washington Post .  In an earlier interview, he said there was no sign of any trouble when he saw his son just hours before the mass shooting, and he denied suggestions his son was radicalized or an ISIS sympathizer.  This text released today by the FBI comes as no surprise to those who study human behavior. A 1996  study ,  published in the Journal of Abnormal Psychology, found a strong link between professed homophobia and homosexual arousal. “You can’t hate something so much without hating that about yourself, that’s Psychology 101”, said Dr. Paul Horner, professor of psychology at the University of Central Florida. “Mateen was raised as a Muslim by a  father  who was very much a homophobe himself. When you are raised to believe that your natural desires, desires which are beyond your own control, are sick and evil, it creates severe psychological problems that persist well into adulthood. There is really no telling how many more Omar Mateens are out there. Omar couldn’t be gay  because of his religion . His actions and all the innocent lives he took had nothing to do with terrorism.”  The shooting has generated a mixed response among America’s conservatives, a group which is heavily influenced by Islam’s Abrahamic cousin, Christianity. Many Christians have spoken out against the shooting and say that it is a perfect example of why Islam is so dangerous and why its spread must be stopped. Many other Christians, such as Arizona Pastor  Steven Anderson , have actually celebrated this attack, saying that this was a well-deserved punishment being visited upon the wicked by a righteous and vengeful God.  Dr. Cassandra Schmidt, professor of religious studies at the Central University of Northern Texas in Wichita Falls sees the development of a disturbing trend.  “Many people have bought into the notion recently that Christianity is somehow less dangerous than Islam because there are not as many acts of high-profile Christian terrorism, but this viewpoint ignores the fact that Christianity’s influence on Western civilization has been tempered by centuries of enlightenment thinking and scientific discoveries. Since the election of Ronald Reagan in 1980, there has been a huge backlash against all things intellectual in this country, and in that time, Christianity has been moving very steadily in a much more fundamentalist direction. As the number of  non-religious Americans  continues to grow, I think you’re only going to see those who remain in the faith get more and more conservative and more and more detached from reality. At the rate things are going, I wouldn’t be at all surprised to see certain American Christians practicing female circumcision and honor killing within the next thirty years.”  Dr. Schmidt’s thoughts were echoed by a high ranking member of the Archdiocese of Los Angeles who describes himself as a “practicing homosexual”. For obvious reasons he agreed to speak with ABC news solely on a condition of anonymity. “The Muslim world behaves this way because they do not know any better; they do not have the advantage of being guaranteed a right to a secular education. Most Christians do, yet many are choosing to ignore what they have learned in favor of an ideology that, at its core, is almost indistinguishable from radical Islam. What most Americans do not realize is that there was a time long ago when the Muslim community was actually one of the world leaders in math, science, and technology and that during this time women in the Muslim world were actually treated far better than women in other religions throughout India and the Middle East were. Islam got to where it is today by turning its back on those enlightenment principles and embracing hardline religious doctrine in its place. It’s pretty obvious to even the most casual observer that this is where Christianity is headed.”  ABC news decided to take to the streets of Las Vegas to ask everyday Americans what they thought about Omar Mateen’s motivations for the attack. Most of the people who spoke with ABC news tended to agree that this was the act of a self-loathing homosexual and not that of an ISIS operative.  Allison Stewart, a rattlesnake farmer from Yucca, Arizona who was attending a trade show at the MGM Grand said that “I think it’s a load of [expletive] that people are trying to pin this whole thing on ISIS. The guy had nothing to do with ISIS. He loved [male genitalia] but he didn’t have the [male genitalia] to admit it. So he killed the part of himself he hated that he saw in those other people and blamed it on ISIS like a little [expletive].”   The Westboro Baptist Church , which is well known for its funeral protests and anti-gay activism, has already declared its intent to  protest the Orlando victims’ funeral  because of Mateen’s homosexuality. The organization routinely celebrates the deaths of homosexuals and others whom the church deems to be sinners or sodomites.  Shirley Phelps Roper offered her thoughts about Mateen to ABC news this morning via skype.   “I really wish that they would stop trying to tie this attack directly to ISIS. It is wrong to sully the name of such a wonderful organization by attaching this little [gay slur]’s name to it. Omar Mateen was a homosexual, and because he was raised in the ways of God’s righteous law, the weight of his sins ate away at his conscience until he snapped. God bless Islam, without it, this incident never would have happened. Westboro Baptist Church fully supports ISIS and its efforts to wipe homosexuals and infidels from the planet. We pledge our undying spiritual and financial support to them, with the hopes that they will inspire more conflicted homosexuals to follow Mateen’s lead. Just because you have homosexual desires doesn’t mean you should act on them. I’ve been attracted to women since I was 13, but I chose to turn that sickness over to the Lord. If you’re not willing to do that, you deserve what’s coming to you.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. We also sometimes like to say that there is some kind of top-secret, hidden website, underneath the site that we are debunking that actually has the malware, but we never say anything more than that, it’s all just for fun. And trust me, I think warning people about a website that could potentially destroy their computer is a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”       Regardless of how they feel about the issue, most Americans seem to be in agreement about why it happened. A young man had desires that were contrary to the religious beliefs he was raised with, and after years of internal conflict, he sought to cleanse himself and others through the Abrahamic faiths’ most ancient and revered practice: the spilling of blood. While most Americans agree on the whys, there is no consensus on how to fix the problem and prevent the next Omar Mateen.  For Leslie Duby-Sparks of the  American Secular Society , the solution for the problem is rather simple.  “This incident shows without a doubt that we must eliminate religion from all aspects of society. Time and time again religion has been used to justify various atrocities. Slavery, segregation, and even the killing of African Americans by the police have been justified by Christians by quoting select portions of the Bible. Muslims and Christians need to be more like the Jews. Jews don’t kill anyone over their beliefs because most Jews have the sense to know their religion is nothing more than a fairytale. They follow their faith to preserve their unique cultural heritage, a heritage which has been pushed to the brink of extinction many times, usually by the Christians and the Muslims. They’re not so ridiculous as to think that a megalomaniac sky man actually sat down and wrote a book telling them not to touch themselves.”  If you or someone you know has had a homosexual relationship with Omar Mateen, the FBI has setup a  Mateen Homosexual Hotline  at (785) 273-0325. The FBI says that callers can remain anonymous.    \n   \n  ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/Omar-Mateen-text-to-his-wife-says-he-is-gay.jpg", "title": "Omar Mateen’s Final Text To Wife Released: “I’m Gay, That’s Why I’m Doing This.”"},
{"post_date": "2016-10-31T05:00:42+00:00", "author": "Jimmy Rustling, ABC News", "content": " WASHINGTON, D.C.  (AP)  — U.S.  Sen. Ted Cruz  (R- Texas ) sent shockwaves through the Republican Party today when he announced that he would endorse  Donald Trump  for President, but only if the  GOP nominee  would be willing to publicly support a ban on masturbation. The Senator called this ‘The single most important issue facing the country today’ and that without ‘swift action by the next President the country was doomed to slide down a  slippery slope  of debauchery and self-satisfaction’.  “Self-love is a silent killer in this country. This needless act of hedonistic indulgence is leading our children down a dark and destructive path. It starts innocently enough with a JC Penney catalogue tucked under your mattress, but it quickly spirals out of control, and before you know it, your mother has to call the coroner because you’ve died from auto-erotic asphyxiation. I’m not saying that we should lock up these one armed bandits and throw away the key; what we need is a compassionate approach that helps these deviants reform and become productive members of society. That is why I believe a prison sentence of three to five years will help motivate these heathens to change their evil ways and stay off the  Devil’s playground  for good,” Cruz said. “I’m asking Mr. Trump to acknowledge the severity of this problem, and commit to finding real solutions. If he does that, I will do whatever it takes to help him secure the White House in November. Should Mr. Trump decline, I think it’s safe to say that all options, including a third party run, are out on the table.”  Donald Trump told ABC News that he was open to the idea, though he refused to take a clear stand on the issue.  “Look, do I think Ted Cruz is right about this? Maybe he is, maybe he isn’t. To be honest, I don’t know a lot about this subject matter. I don’t need to. I have a wife that takes care of this for me, and she’s a beautiful wife, the best wife, the greatest wife. My people are going to take a hard look into this matter and find a great answer for it, the best answer there is. I want an endorsement from Senator Cruz, and I think I can go along with his request that makes pleasuring your genitalia for non-reproductive purposes illegal.”  This is not the first time that Cruz has attempted to use his political power to curtail the act of self-stimulation. As solicitor general of Texas in 2007 he fought to uphold the state’s ban on sex toys by arguing that there was no “Right to stimulate one’s genitals.” Cruz eventually lost this battle, but the story re-surfaced this year and gained widespread media attention, prompting Cruz’s former college roommate  Craig Mazin to tweet  that Cruz’s stance against stimulating one’s own genitals was “A new belief of his”, implying that much of Cruz’s time in college was, in fact, spent stimulating his own genitals. Another one of Cruz’s former college roommates, Matt Daemon, has recently come forward to corroborate Mazin’s story.  “All Ted Cruz did was take care of little Ted Cruz back then, which is fine I guess, but he was always real creepy about doing it. Honestly, I lost track of the number of times I came home to find him laying on the couch naked, lotion and Kleenex next to him, watching re-runs of Walker Texas Ranger. He wouldn’t even try and cover up when I caught him, he would just stare at me in the eyes and continue until I left the room. It’s absolutely hilarious about the tough stance on touching one’s self that Ted has taken in this country. I truly believe he may have pulled on it one too many times and it broke or something and now feels that if he can’t do it anymore, then no one can.”  Sarah Bradley, a spokeswoman for   Sock It Forward  , a group that provides the homeless and those less fortunate with brand new socks, told ABC News that she is sickened by the Republican party.  “It is absolutely disgusting that in this day in age, a creepy weirdo like Ted Cruz was almost elected as  the GOP nomination  for President,” Bradley said. “With all the real problems in this country like starvation, so many people out of work and families living on the street, Cruz is focused on making pleasuring yourself a crime.” Bradley continued, “Also, I just want to say a big thank you to everyone that has supported our cause in giving new socks to the homeless, it means so much. Please,   donate what you can, every bit helps  .”  Cruz, however, remains undeterred by his detractors. “When you play with your  Devil stick or ring the Devil’s doorbell  you make the angels in heaven weep, and they are weeping for this country 24 hours a day, 7 days a week. America needs strong moral leadership, and I pray that Donald Trump is up to the task. The fate of our great nation is in his hands; hopefully,  they’re big enough to handle it .”  Most pundits expect Trump to answer Cruz’s call and demand a stiffer approach to the matter. A recent poll by the New York Times found that 43% of likely Trump voters support a ban on self-stimulation due to moral and religious concerns. Another 46% would be okay with a ban, saying that they, like Trump, have far too many potential suitors, and therefore do not need to satisfy their own urges. Only 11% of Trump supporters are against a ban.  RNC political strategist, 37-year-old Paul Horner, calls the move a “no-brainer” and says that Trump would be foolish to turn his back on Cruz.  “Conservatives are siding with Cruz overwhelmingly on this issue. If Donald does not side with the Senator, he risks alienating the  party’s Christian base  and opening the door for a third party run by Cruz which would fracture the vote and all but guarantee a victory for Clinton. Trump needs to agree with Cruz on this one, no matter how  creepy ,  insane  and  absolutely horrible of a person he is .”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate information they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two  debunking it , we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the gender reassignment surgery my wife Barbara has always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons. For example, do you remember that recent  article we wrote debunking a story which claimed Scientology lost its tax-exempt status ?  Did you actually read our story?  Who is the name of the person responsible for the hoax? What is the actual website URL? We claim to know it, but no real information is posted by us.” Mikkelson continues, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , oh the hypocrisy, but it is so funny at the same time! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  that locates the actual article will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Plus, I know for our writers like  Kim LaCapria , it is way more fun for them to cause controversy than report the facts; it results in more visitors. Kim LaCapria and Jeff Zarronandia go as far as accusing the site that the story originated from as ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. The thing that is troubling about these claims and what Snopes and our authors are known for. We don’t list ONE factual piece of evidence to back up any of our claims; It’s just more of our hack, unethical journalism, and I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work? To be honest, I’d say in a given week I probably only do about  fifteen minutes  of real, actual, work.”  Regardless of which side Trump takes on the issue, it is certain to invoke heated debate on both sides of the political aisle. You can voice your opinion about Cruz’s proposal by calling the Senator’s 24-Hour  No Self-Love Hotline  at (785) 273-0325. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/06/ted-cruz-to-endorse-donald--640x347.png", "title": "Ted Cruz: “I Will Endorse Donald Trump For President If He Makes Masturbation Illegal”"},
{"post_date": "2016-10-31T04:45:40+00:00", "author": "Jimmy Rustling, ABC News", "content": " DEQUINCY, LA  (AP)  — Early this morning, a small town in Louisiana suspended one of its firefighters, 39-year-old Ronnie Edwards, without pay for praying while on duty at the scene of a fire. Edwards, who has been with the DeQuincy Fire Department since he was 21, was also arrested and sentenced to 30 days in jail.  “I just do what our Lord &amp; Savior,  Jesus Christ , would do,” Edwards told local DeQuincy news station  DQLA6 . “It’s not about me, it’s about spreading his message, you know? He works through me, I’m just fortunate enough to be part of that.”  According to sources within the DeQuincy Fire Department, Edwards, known to locals as “The Praying Fireman”, has been praying at the scene of fires since he joined the department in 1998, and it is only recently that the ritual has become an issue.  “Ronnie [Edwards] would always pray after we put out a fire, most of the time in the front yard or something,” fellow firefighter Eugene Ketchum said. “It never really bothered anyone, it was just something he did. We put our lives on the line whenever we respond to a fire. I figure if praying helps him out then why not let the guy pray?”  Ketchum said that things changed in 2014 when DeQuincy elected the first democratic mayor in its history, an African American atheist named Lawana Jones. He said that when Jones heard that Edwards made a habit of praying at fires she sent a memo to all city employees advising them that any expression of personal religious belief while on duty was a violation of their contract with the city.  According to DeQuincy city attorney Paul Horner, Jones made four previous attempts to address the issue personally with Edwards, but Edwards became more defiant with each meeting.  “Refusal to obey an official city order is a misdemeanor and we must take action to address the crime,” Horner told reporters. “We didn’t want to suspend the man and have him arrested but we were out of options.”  Mayor Jones, spoke with ABC News, about her decision to suspend and imprison Edwards for praying while at work.  “I’m not anti-religious,” said Mayor Jones in a written statement, “But there is an appropriate time and place for everything. When he prays while on duty, he gives the impression that the City of DeQuincy is endorsing one particular religion over another. That is not the message that my office wants to send; it’s not what the people of DeQuincy elected me to do.” Jones continued, “If you live in a county where democracy is established, you should be aware that the idea of the separation of church and state is the only way to prevent the government from forcing religion on you and directing your religion and its doctrines. Religion is one of the most important factors in most people’s lives and it should be treated with reverence. In order to keep the government from directing religion and making it change how you are allowed to believe, church and state need to be separate. This allows for more openness when it comes to the decisions of the country. And in a world where everyone has different beliefs and different religions, a forced religion can cause an uprising and the dissolvent of a nation. You’re supposed to do your job, not involve politics and religion into it.”   ACLU  spokesperson Cassandra Schmidt told ABC News the organization supports Mayor Jones’ “devotion to the separation of church and state” and said that the ACLU would cover 100% of the city’s legal fees should Mr. Edwards try and sue the city.  Jones won the office after promising to fix the city’s fledgling schools and bring new economic opportunity to the area. In that time, she has brought in over 300 good paying jobs, which has enabled her to increase city funding to the DeQuincy school district by 32%. DeQuincy’s test scores have also already shown significant improvement.  Still, many in the town are wondering if what they have gained is worth what they have lost.  “My brother wasn’t hurtin’ nobody,” Edwards’s 30-year-old sister Tami Hobart said. “Most people in DeQuincy is Christian, and I think we all took comfort in knowing that his heart was right with the Lord before he risked his life. It feels like we sold our souls to get that cat food factory and them fancy new textbooks.”  Republican Presidential Nominee, Donald Trump, caught wind of Edward’s misfortune and while speaking to Fox News offered some harsh words for Mayor Jones.  “I can tell you; when I win the White House, there’s gonna be changes in DeQuincy. They’re gonna reinstate Ronnie Edwards, they’re gonna give him his back pay, they’re gonna give him restitution for the time he spent in jail, and Lawana Jones is going to pay for it. And if Mayor Jones doesn’t want to do that, I’ll have her thrown in jail so fast her head will spin.”   David Mikkelson , founder of  Snopes.com , a website known for its biased opinions and inaccurate aricles they write about stories on the internet in order to  generate advertising revenue , told ABC News that he approves of what a story like this is accomplishing.  “You have to understand that when a story like this goes viral, and we spend a minute or two debunking it, we make lots of money. Stories like this have helped put my children through college, buy a new car, a home and even get the sex reassignment surgery my wife Barbara always wanted since she was a little boy,” Mikkleson said. “We claim ‘ to provide evidence for such debunkings and confirmation as well ‘, but that’s just ridiculous. Do you know how much time that would take? Instead, we just copy and paste parts of the original article into ours, write a couple sentences, and that’s it. I just want to be clear, our website does zero journalism or anything creative, and I’m only telling you this for legal reasons.” Mikkleson continues, “ A typical story of ours  makes wild claims, using grammatical errors, misspellings and words like ‘umimumimaginative’, ‘recycled’, ‘hoax’, saying that a story ‘illegally appropriates the trademarks of legitimate news organizations’, but we list no links or sources of information, they are all just wild claims by us. And  that story  will get 50,000 shares or more on Facebook, that’s a lot of ad revenue for only writing a couple sentences.” Mikkelson further explains, “It is common for us to  rewrite a story we’re debunking  if we don’t like it. In one  recent story  of ours, we actually  removed a person’s name from the original article  and then  called him a liar , it’s so funny! We also like to  post fake ,  un-funny, juvenile disclaimers  supposedly from the site in question and it is our authors, such as  Jeff Zarronandia  who are responsible for those gems.  We tell our readers that the disclaimer is from the story we are debunking , but a simple  google search  will show that our disclaimer is 100% fabricated. Sometimes I think that someone should start a company that debunks our debunkings, they could probably make a lot of money,” Mikkelson laughs. “ And lots of people complain  and  complain  about our  authors attacking websites and their owners  for  reasons that are 100% proven false , but since we block  archive.org  it just becomes their word versus ours. Our writers like Zarronandia go as far as to say that the story originated from ‘ a clickbait fake news site that infringes the trademark-protected visual elements and domain names of legitimate news outlets in order to generate traffic and drive advertising revenues by creating and spreading entirely false “news” stories ‘. But we don’t list ONE factual piece of evidence to back up our claims; It’s just more of our hack, unethical journalism, and as I said before, I only tell you this for legal reasons. I think it is business as usual for us to accuse the story we are debunking of spreading  malware and viruses , but we never say what website it actually is. I think warning people about a site that could potentially destroy their computer is probably a good idea, and I hope one day to do that kind of ethical journalism, but people will click our ads regardless, bottom line; so why do the extra work?”  In spite of all that has happened, Edwards says that he is not bitter.  “The Bible says that there will be sacrifices when you choose to follow the path of righteousness; it says that you will be reviled by the wicked. I will continue to pray that Mayor Jones comes to accept Jesus Christ, and will keep praying that God sees fit to put Donald Trump in the White House, but whether or not any of that happens, I still trust God and know that everything is happening according to his divine plan.”  Edwards is scheduled to begin serving his 30-day jail sentence at the DeQuincy City Jail on November 5th, the same day as Paul Horner’s birthday. Edwards told ABC News that he encourages, “Those wishing to support his cause, to support a charity that gives news socks to the homeless, called   Sock It Forward  .”  If you have any questions regarding the case, you can contact the DeQuincy City Attorney’s Office at (785) 273-0325. ", "image_url": "http://abcnews.com.co/wp-content/uploads/2016/09/praying-firefighter-640x381.png", "title": "Fireman Suspended & Jailed By Atheist Mayor For Praying At Scene Of Fire"}
]